[
  {
    "cooking_method": "['Set the racks in the middle and upper thirds of the oven and preheat the oven to 425 F', 'In a large skillet over medium heat, heat the olive oil until shimmering. Add the onion, garlic and red pepper flakes and cook until golden, stirring occasionally, about 5 minutes.', 'Add the fennel and cook until the vegetables are soft and translucent, an additional 3 to 5 minutes.', 'Reduce the heat to medium and add the tomatoes with their juices. Using the back of a wooden spoon, smash the tomatoes and cook for 5 minutes.', 'Add the basil, wine, olives, 1 teaspoon salt, and 1/8 teaspoon black pepper.', 'Reduce to low and simmer for 15 minutes, or until the sauce is slightly thickened, while you prepare the fish.', 'Pat the fillets dry, lightly spray them with cooking spray, and season with salt and pepper.', 'In a heavy ovenproof skillet over high heat, heat the olive oil until shimmering. Add the fillets, rounded-side down, and cook for 2 minutes.', 'Carefully flip the fillets with a metal spatula and place the skillet in the oven. Bake until the fish is no longer translucent, 8 to 10 minutes.', 'Switch the oven to broil and place the skillet on the upper rack. Broil until the tops of the fillets are golden brown, 2 to 4 minutes.', 'Arrange the fillets on individual plates, spoon on the sauce, and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/05/Mediterranean-Sea-Bass-10.jpg",
    "ingredients": "['1 tablespoons extra virgin olive oil', '1 cup chopped yellow onion', '3 cloves garlic (minced)', '1/4 teaspoon crushed red pepper flakes (or to taste)', '1/2 cup chopped fennel', 'One 28 ounce can whole peeled tomatoes (with their juices)', '3/4 cup fresh basil leaves (very thinly sliced)', '1/2 cup dry white wine', '1/4 cup pitted Kalamata olives (halved)', 'Kosher salt', 'Freshly ground pepper', 'Four 4-6 ounce skinless Chilean sea bass fillets (or other sustainable firm white-fleshed fish fillets such as halibut, cod or striped bass)', 'Organic olive oil cooking spray', 'Kosher salt', 'Freshly ground black pepper', '1 tablespoon extra-virgin olive oil']",
    "recipe_name": "Mediterranean Sea Bass"
  },
  {
    "cooking_method": "['Preheat the oven to 400F.', 'Pour 2 tablespoon of grated cheese onto a silicone lined baking sheet (highly recommended for this) and lightly pat down with your fingers to make about 4 inches round.', 'Repeat 3 more times with remaining cheese, leaving 1/2-inch space in between each circle.', 'Bake 3 minutes, until almost done.', 'Combine the sesame seeds, onion, garlic and poppy seeds in a small bowl.', 'Top each with 3/4 teaspoon.', 'Bake for 5 minutes or until golden and crisp. Cool before eating.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/05/Everything-Parmesan-Crisps-5.jpg",
    "ingredients": "['1/2 cup freshly grated Parmesan (not pre-grated using the large holes of a box grater)', '3/4 teaspoon sesame seeds', '3/4 teaspoon minced dried onion flakes', '3/4 teaspoon minced dried garlic flakes', '3/4 teaspoon poppy seeds']",
    "recipe_name": "Everything Parmesan Crisps"
  },
  {
    "cooking_method": "['Combine sour cream and brown sugar and mix well. Place about five strawberries in each glass and drizzle each with 2 tablespoons of cream sauce. The cream can be made ahead and be refrigerated for up to 3 days.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2010/04/Strawberries-Romanoff.jpg",
    "ingredients": "['16 oz strawberries (washed and cut)', '4 oz low fat sour cream', '2 tbsp brown sugar']",
    "recipe_name": "Strawberries Romanoff"
  },
  {
    "cooking_method": "['In a medium bowl combine the buttermilk, mayo, chives, salt, garlic powder, onion powder, parsley, basil and black pepper and mix.', 'Add the shredded chicken and mix well. Refrigerate until ready to eat.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/04/RANCH-CHICKEN-SALAD-11.jpg",
    "ingredients": "['1/2 cup 1% buttermilk', '3 tablespoons mayonnaise', '2 tablespoon fresh finely chopped chives', '1/2 teaspoon kosher salt', '1/4 teaspoon garlic powder', '1/4 teaspoon onion powder', '1/4 teaspoon dried parsley', '1/4 teaspoon dried basil', 'fresh black pepper (to taste)', '2 cups shredded boneless chicken breast (from rotisserie chicken or leftover)']",
    "recipe_name": "Ranch Chicken Salad"
  },
  {
    "cooking_method": "['One at a time, place all 6 of the tortillas directly over the flame of the burner over medium heat 20 to 30 seconds per side, until slightly charred.', 'Set 4 aside on a plate with a dish towel over them to keep them warm until ready to serve, cut the remaining 2 in half, then chop into 1/2 inch thick strips.', 'Place the eggs in a medium bowl, season with salt and pepper, and whisk to combine.', 'Heat 1 teaspoon of the oil in a 10-inch nonstick skillet over medium heat.', 'Add the 2 chopped tortillas and cook, stirring until crisp, about 4 minutes. Set aside.', 'Add the remaining oil to the skillet, then add the onion, tomato, jalapeno, cilantro and season with salt and pepper, cook until soft and translucent, about 4 minutes stirring.', 'When the onion is ready add the eggs and cook 3 to 4 minutes until the eggs are almost set, stirring a few times to scramble, then stir in the tortillas.', 'Stir and cook 1 more minute. Remove from heat and top with cheese, fresh salsa, avocado, hot sauce and cilantro for garnish.', 'Serve with warmed tortillas.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/04/Tex-Mex-Migas-9.jpg",
    "ingredients": "['1/3 cup diced onion', '1/2 vine tomato (seeded and diced)', '1 jalapeno (half diced, half sliced thin for garnish)', '3 tablespoons chopped cilantro (plus more for garnish)', '2 corn tortillas', '2 teaspoons olive oil', '1/2 teaspoon kosher salt and black pepper (to taste)', '8 large eggs', '4 corn tortillas', '1/4 cup crumbled queso fresco', '4 ounces avocado (sliced)', 'hot sauce or salsa (for serving)']",
    "recipe_name": "Tex-Mex Migas"
  },
  {
    "cooking_method": "['Preheat oven to 425F. Spray a large baking sheet lightly with spray.', 'Combine breadcrumbs and parmesan cheese in a bowl. Beat the egg in another bowl.', 'Dip the chicken into the eggs, then into the breadcrumb mixture. Discard the remaining crumbs.', 'Place the chicken on the prepared baking sheet, lightly spray the top with oil and bake in the oven for 25 minutes, do not turn. When done, remove from the oven and reduce oven temp to 400F.', 'Meanwhile, combine the ricotta, parmesan cheese, and basil in a medium bowl.', 'In a 9 x 13 x 3-inch Pyrex Deep baking dish, ladle 3/4 cup of marinara on the bottom of the dish.', 'Arrange 3 lasagna noodles across the dish (they will expand as they cook), top with 3/4 cup sauce, 4 pieces of chicken, 1/4 of the ricotta cheese mixture, 1/2 cup mozzarella cheese, 3/4 cup spinach.', 'Repeat the 2nd layer, skipping the chicken.', 'Repeat the 3rd layer with the chicken, and the 4th layer without the chicken.', 'For the 5th layer, spread the last 3 sheets of pasta noodles with the remaining 1 1/2 cups of marinara sauce on top.', 'Cover with foil and bake in a 400F preheated oven in the center rack 50 minutes.', 'Uncover, add the remaining cup of mozzarella and bake until melted, 5 minutes.', 'Remove from oven and let it rest 15 minutes before serving.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/03/Chicken-Parmesan-Lasagna-2-2.jpg",
    "ingredients": "['4 32 ounces boneless, skinless chicken breasts, sliced in half lengthwise to make 8', '3/4 cup seasoned breadcrumbs (I used whole wheat, you can also use GF crumbs)', '1/4 cup grated Parmesan cheese', '2 large eggs (beaten)', 'olive oil spray', '15 ounce container part-skim ricotta cheese (I like Polly-o (almost 2 cups))', '1/2 cup grated Pecorino Romano or Parmesan cheese', '1/4 cup fresh chopped basil (plus more for garnish)', '4 3/4 cups homemade or jarred marinara sauce (from about 2)', '9 ounce box no-boil lasagna noodles (I used Barilla)', '3 cups baby spinach', '3 cups part-skim shredded mozzarella cheese']",
    "recipe_name": "Chicken Parmesan Lasagna"
  },
  {
    "cooking_method": "['Preheat the oven to 350F.', 'In a small bowl combine 2 tbsp of the ketchup with Worcestershire sauce.', 'In a small skillet, heat olive oil and onion on low heat until translucent, 3 to 5 minutes, remove from heat.', 'In a medium bowl combine the turkey, onion, breadcrumbs, egg, 1/4 cup ketchup, salt and marjoram.', 'Place mixture into a loaf pan or shape into a loaf and place on a baking pan. Spoon sauce on top.', 'Bake uncovered for 55-60 minutes, remove from oven and let it sit for 5 minutes before slicing.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2009/02/turkey-meatloaf-8.jpg",
    "ingredients": "['1/4 cup plus 2 tbsp ketchup (I use organic)', '2 tsp Worcestershire sauce', '1/2 small onion (minced)', '1 tsp olive oil', '1.3 lb 99% lean ground turkey', '1/2 cup seasoned whole wheat or gluten-free breadcrumbs (I like 4C)', '1 large egg', '1 tsp marjoram', '1 teaspoon kosher salt']",
    "recipe_name": "Turkey Meatloaf"
  },
  {
    "cooking_method": "['For the meat:', 'Brown turkey in a large skillet breaking it into smaller pieces as it cooks.', 'When no longer pink add dry seasoning and mix well.', 'Add the onion, pepper, water and tomato sauce and cover.', 'Simmer on low for about 15 minutes, uncover and simmer until dry, about 8 to 12 minutes. You dont want any liquid remaining, it will make the dough soggy.', 'For the dough:', 'Preheat oven to 375F.', 'Place parchment paper or a silpat on a baking sheet. If using parchment paper, spray with oil to avoid sticking.', 'In a medium bowl combine the flour, baking powder and salt and whisk well.', 'Add the yogurt and mix with a fork or spatula until well combined, it will look like small crumbles.', 'Lightly dust flour on a work surface and remove dough from the bowl, knead the dough a few times until dough is tacky, but not sticky, about 15 turns (it should not leave dough on your hand when you pull away).', 'Place on a floured work surface and roll the dough out until its very thin. Cut circles about 4-3/4 inches (I used a small work bowl turned upside down) cut out as many rounds as you can.', 'With the remaining dough, roll out and form into more rounds. I got 10 altogether.', 'Place 2 tablespoons of the meat mixture on each round topped with 1/2 tablespoon cheese.', 'Brush the edges with egg wash then fold the edge over and crimp with a fork.', 'Transfer to the baking sheet and brush the tops with egg wash.', 'Bake in the center of the oven for 22 minutes, or until golden']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/06/potato-broccoli-patties-1-12.jpg",
    "ingredients": "['1/2 pound 93% ground turkey', '1/2 teaspoon garlic powder', '1/2 teaspoon cumin', '1/2 teaspoon kosher salt', '1/4 teaspoon chili powder', '1/4 teaspoon paprika', '1/4 teaspoon oregano', '1/4 small onion (minced)', '1 tablespoon bell pepper (minced)', '2 tablespoons water', '2 ounces canned tomato sauce (1/4 can)', '5 tbsp part-skim shredded Mexican cheese blend', '1 cup 5 oz unbleached all purpose or whole wheat flour', '1 1/2 teaspoons baking powder (make sure its not expired or it wont rise)', '3/4 teaspoon kosher salt (use less if using table salt)', '1 cup non-fat Greek yogurt (use Stonyfield or Fage, not regular yogurt, not Chobani, it will be too sticky)', '1 whole egg (beaten)']",
    "recipe_name": "Taco Empanadas"
  },
  {
    "cooking_method": "['Bring a skillet sprayed with nonstick spray to medium-high heat. Sprinkle chicken with seasonings, and cook for about 4 minutes per side, until cooked through.', 'Once cool enough to handle, roughly chop. In a small bowl, coat chicken with BBQ sauce.', 'Lay tortilla flat, and spread BBQ chicken onto one half. Top chicken with remaining ingredients.', 'Clean skillet, if needed. Respray and return to medium-high heat. Cook the half-loaded tortilla for 2 minutes.', 'Fold the bare tortilla half over the filling with a spatula, and press lightly to seal. Carefully flip and cook until crispy, about 3 minutes.', 'Slice into wedges.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/04/BBQ-Quesadilla-1-2.jpg",
    "ingredients": "['One 3-oz. raw boneless skinless chicken breast cutlet', '1/8 tsp garlic powder', '1/8 tsp onion powder', '1 tbsp BBQ sauce with 45 calories or less per 2-tbsp. serving (plus more for serving)', '1 large high-fiber flour tortilla with 110 calories or less (I used Ole Xtreme)', '1/4 cup shredded reduced-fat Mexican-blend cheese', '2 tbsp chopped red onion', '1 tbsp chopped fresh cilantro', 'nonstick spray']",
    "recipe_name": "BBQ Chicken Quesadilla"
  },
  {
    "cooking_method": "['Preheat oven to 350 degrees Farenheit.', 'Roll the dough out on a well-floured work surface until its approximately 11 to 12-inches in diameter.', 'Transfer it to a 9-inch metal or glass pie dish. Using your fingers, press it firmly into the bottom and sides of the pie plate. Trim off any excess, leaving about 1/2-inch overhanging. Then fold/crimp the overhanging dough.', 'Prick the bottom of the pie crust with the tines of a fork. Transfer the pie crust to your pre-heated oven and bake for 10 to 15 minutes, until par-baked.', 'Meanwhile in a large mixing bowl combine eggs with spinach, milk, 2 tablespoons parmesan cheese, basil and salt; mix well.', 'Pour mixture into the par-baked pie crust.', 'In a small bowl combine ricotta with mozzarella and remaining parmesan.', 'Dollop the ricotta all around and top and place tomatoes around the cheese.', 'Place foil on the edges of the crust to prevent them from burning.', 'Place quiche on cookie sheet and bake on the middle oven rack for 50 to 55 minutes, or until top is browned and a knife inserted in center comes out clean.', 'Let cool before serving.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/05/spinach-quiche-1-8.jpg",
    "ingredients": "['refrigerated Dough for 1 (9-inch pie crust)', '7 large eggs (beaten)', '2 cups chopped fresh baby spinach (1 1/2 ounces)', '2/3 cup skim milk', '6 tablespoons grated parmesan', '3 tablespoons chopped fresh basil', '1/4 teaspoon kosher salt', '1/2 cup part skim ricotta', '1/3 cup part skim shredded mozzarella', '3/4 cups halved grape or cherry tomatoes']",
    "recipe_name": "Spinach Ricotta Quiche"
  },
  {
    "cooking_method": "['Preheat the oven to 350F.', 'Prepare an 8-inch square glass or ceramic baking dish pan by lightly spraying the inside with baking spray.', 'Make a sling: Cut 2 sheets of parchment paper 15 x 15 inches each. Fold them in half so they are 7 1/2 x 15 inches, which will make them sturdier.', \"Line the pan with the 2 long sheets of parchment paper placed perpendicular to each other in the pan. This is so you can get the bars out after they are cooked, so don't skip this step. They should be long enough to hang over the sides to use as handles to lift out the baked lemon bars before cutting.\", 'Spray the inside of the parchment with baking spray.', 'For the crust: In a food processor combine the flours, brown sugar, cornstarch, lemon zest, baking powder and salt and process until well combined.', \"Add the butter and yogurt to the flour mixture at once and pulse at least a dozen times before turning out into the prepared pan and pressing into an even layer and up the sides of the dish about 1/4-inch so the filling doesn't spill out.\", 'Bake until evenly browned about 30 minutes. Shut the oven off and cool the crust on a metal rack for at least 20 minutes.', 'Once cooled, heat the oven to 325F.', 'Prepare the filling in a medium bowl by whisking together the eggs, honey and lemon zest. Add the flour 1 tablespoon at a time, and the salt and mix well. (this is best to prepare just before baking)', 'Stir in the lemon juice and pour over the cooled crust.', 'Bake until filling is set, about 22 to 25 minutes.', 'Cool completely before lifting the bars out of the pan with the parchment. For best results, refrigerate overnight for a firmer topping.', 'Cut into 12 squares using a clean hot knife, clean in between slices.', 'Dust with confectioners sugar just before serving.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2012/06/Skinny-Honey-Lemon-Bars-12.jpg",
    "ingredients": "['6 tablespoons white whole wheat flour', '6 tablespoons all purpose flour', '1/4 cup light brown sugar (not packed)', '3 tablespoons cornstarch', '2 teaspoons grated lemon zest', '1/2 teaspoon baking powder', '1/4 teaspoon kosher salt', '4 tablespoons unsalted butter (cut into bits and chilled)', '1 tablespoons 0% Greek yogurt', '1/3 cup honey', '3 large eggs (lightly beaten)', '2 tablespoons white whole wheat flour', '1/8 teaspoon kosher salt', '1 teaspoon grated lemon zest', '5 tablespoons fresh lemon juice', '1 tablespoon powdered sugar (for dusting on top)']",
    "recipe_name": "Honey Lemon Bars"
  },
  {
    "cooking_method": "['Preheat oven to 400 degrees F.', 'On a large sheet pan, toss broccoli, squash and onions with olive oil, salt and pepper, to taste.', 'Spread veggies out in an even layer and roast for 20-25 minutes, or until crisp tender.', 'Meanwhile, heat a medium skillet over medium-low heat and lightly spray with oil.', 'Add eggs, one at a time, leaving space between them. Season each with a pinch of salt and pepper, cover and cook until whites are just set and yolk is still runny.', 'Divide rice and roasted veggies evenly among 4 bowls.', 'Top each with 1 ounce avocado and 1 egg and 1 tablespoon pecans.', 'Serve immediately.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/03/Heather_s-Buddha-Bowl-7-1.jpg",
    "ingredients": "['4 cups broccoli florets', '2 cups cubed butternut squash', '1 small onion (sliced into 12 moons)', '1 tablespoon olive oil', '1 small (4-ounce Hass avocado, sliced)', 'Olive oil spray', '4 large eggs', 'Kosher salt', 'Freshly ground black pepper', '2 cups cooked brown rice', '14 cup chopped pecans']",
    "recipe_name": "Heather’s Buddha Bowl"
  },
  {
    "cooking_method": "['Char both sides of the tortillas on a hot griddle or over the open flame. Keep warmed in the oven if eating right away. This will help the tortillas become more pliable and also improves the taste, in my opinion.', 'Heat a large non-stick skillet over medium heat. Add the bacon and cook until cooked through, about 4 to 5 minutes. Transfer with a slotted spoon to drain on a paper towel lined plate.', 'In a large bowl whisk the eggs with salt. Mix in scallions and bell pepper.', 'Discard the bacon grease leaving 1 teaspoon then add the eggs, let them set on the bottom then stir a few times to cook through, set aside.', 'On a clean work surface, divide a generous 1/2 cup of the egg mixture onto the bottom third of the tortilla. Top each a slice of bacon and 2 tablespoons cheese. Roll from the bottom, folding the left and right corners in toward the center and continue and roll into a tight cylinder. Set aside, seam-side down, and repeat with remaining tortillas and filling.', 'If eating right away, heat a skillet over medium heat. When hot, spray the skillet with oil and add the burritos, seam side down. Cook, covered, until the bottom of the burritos are golden brown, about 2 minutes on each side. Serve with hot sauce or salsa, if desired.', 'Place the foil on a work surface vertically, place the rolled burrito in the center bottom third, roll partially, folding the sides of the foil over the burrito, then roll it up.', 'Transfer to a freezer bag to prevent freezer burn (you can reuse the bags).', 'Use a sharpie to label it with the name and date. (also helpful to write down cook time and temp).', 'To reheat, thawed overnight in the refrigerator: (Best results)', 'Transfer burrito to the refrigerator the night before. Bake in foil, in a preheated oven 425F 20 minutes, turning halfway. Unwrap foil and bake uncovered 5 minutes. Optional, you can also broil 2 to 3 minutes at the end to toast.', 'To reheat direct from freezer to oven: (Best results)', 'Bake in a preheated oven 425F 45 minutes turning halfway. Unwrap foil and bake uncovered 5 minutes. Optional, you can also broil 2 to 3 minutes at the end to toast. Let stand 2 minutes before eating.', 'To reheat direct from freezer to microwave (Least favorite results): Remove the burrito from the foil and place on a microwave safe dish, cover with a paper towel microwave 1 minute. Turn then cook an additional 1 to 1 1/2 minutes. Let stand 2 minutes before eating. (optional, brown on a skillet 2 minutes on each side to toast, or broil 2 to 3 minutes.', 'To reheat in air fryer, thawed overnight in the refrigerator: (crisp results)', 'Transfer burrito to the refrigerator the night before. Unwrap and discard foil, spritz with a little oil and air fry in a preheated air fryer 400F 8 to 9 minutes, turning halfway until heated through in the center.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/03/breakfast-burritos-1-11.jpg",
    "ingredients": "['6 strips center cut bacon', '10 large eggs (beaten)', '4 scallions (chopped)', '1/2 red bell pepper (diced)', '1/2 teaspoon salt', '12 tablespoons shredded cheddar or pepper jack cheese', '6 8-inch low carb flour tortillas (I used Ole Xtreme Wellness)', '6 pieces Reynolds Wrap Heavy-Duty Aluminum Foil (cut 10 x 12 inches each)', 'hot sauce for serving (optional)']",
    "recipe_name": "Freezer Breakfast Burritos"
  },
  {
    "cooking_method": "['Place green beans in a large pot and cover with water, about 6 cups. Bring to a boil, then cover and cook until tender crisp, about 6 minutes (dont overcook or they will get mushy).', 'Drain and rinse under cold water when done to prevent them from overcooking, drain.', 'In a large bowl, combine balsamic, oil, salt and pepper. Toss in the green beans, scallions and olives.', 'Mix well and top with sliced eggs. Refrigerate and serve chilled or room temperature.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2009/03/Green-Bean-Salad-8.jpg",
    "ingredients": "['24 oz 6 cups string beans beans, ends trimmed', '2.25 ounce can sliced black olives (drained (check labels for Whole30))', '3 tablespoons balsamic vinegar', '3 tablespoons extra virgin olive oil', '3 medium scallions (chopped)', '3/4 teaspoon kosher salt', 'fresh black pepper (to taste)', '5 hard boiled eggs (peeled and sliced)']",
    "recipe_name": "Green Bean Salad"
  },
  {
    "cooking_method": "['In a blender combine, starting with the liquid first add the milk, yogurt, eggs, vanilla, flour, baking powder and salt and mix until well combined and smooth, about 30 to 60 seconds.', 'Heat a waffle iron over medium heat (I used number 3 on mine) and let it heat up.', 'When hot spray with cooking spray and pour 1/2 cup of batter in the center, close and cook until golden brown and slightly crisp on the edges, about 3 to 4 minutes.', 'Repeat with the remaining batter or refrigerate the remaining.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/03/Yogurt-Waffles-8.jpg",
    "ingredients": "['1 1/4 cup almond milk (or any milk you wish)', '2/3 cup Stonyfield Plain 0% Fat Yogurt', '2 large eggs', '1 teaspoon vanilla extract', '2 cups all-purpose unbleached (white whole wheat flour or gluten-free flour mix*)', '1 tablespoon + 2 teaspoons baking powder', '1/4 teaspoon kosher salt', 'cooking spray']",
    "recipe_name": "Yogurt Waffles"
  },
  {
    "cooking_method": "['INSTANT POT:', 'Season the chicken with salt.', 'Press saute and add the oil.', 'Add the onion, celery, carrot and garlic and saute until soft, 4 to 5 minutes.', 'Add the chicken, broth, bay leaves and 1/8 teaspoon black pepper.', 'Cover and cook high pressure 15 minutes, let the pressure release naturally.', 'Discard the bay leaves, coarsely shred the chicken with two forks and return to the soup, add the noodles and cook 2 minutes high pressure. Quick or natural release.', 'Garnish with parsley and serve.', 'STOVE:', 'Season the chicken with salt.', 'Heat a large pot or Dutch oven over medium high heat.', 'Add the oil, onion, celery, carrot and garlic and saute until soft, 5 minutes.', 'Add the chicken, chicken broth, 1/4 cup water, bay leaves and 1/8 teaspoon black pepper.', 'Bring to a boil over high heat, then cover and reduce to a simmer, cook until the chicken shreds easily with a fork, about 35 minutes.', 'Discard the bay leaves, coarsely shred the chicken with two forks and return to the soup, add the noodles and cook according to the package directions.', 'Garnish with parsley and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/12/Instant-Pot-Chicken-Noodle-Soup-Finals-8.jpg",
    "ingredients": "['4 boneless skinless chicken thighs (trimmed of all fat (about 1 pound total))', '1/4 teaspoon kosher salt', '1 teaspoon olive oil', '1/2 cup diced onion', '1/2 cup diced celery', '1/2 cup peeled and sliced carrot', '3 cloves garlic (minced)', '4 cups low-sodium chicken broth', '2 bay leaves', 'black pepper (to taste)', '1 cup 1 1/2 oz egg noodles', 'parsley (for garnish)']",
    "recipe_name": "Chicken Noodle Soup"
  },
  {
    "cooking_method": "['Preheat the oven to 400F and lightly spray an 8 x 10-inch oval baking dish or 2-quart gratin dish with olive oil or nonstick cooking spray.', 'Pat the scallops dry then spritz them with a little oil, season with 1/8 teaspoon salt.', 'In a small bowl combine the panko, Parmesan, parsley, oregano, 1/8 teaspoon salt and black pepper, to taste.', 'Arrange the scallops in a single layer in the prepared dish. Top with the crumb mixture.', 'Whisk half of the lemon juice, melted butter, and white wine together and pour over the scallops.', 'Bake for 15 minutes, or until the scallops are opaque.', 'Set the oven to broil on high and broil second rack from the top until the topping is golden, about 2 to 3 minutes.', 'Squeeze the remaining lemon over the scallops and eat right away.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/11/Baked-Scallops-1.jpg",
    "ingredients": "['olive oil spray', '16 large (1 pound large sea scallops)', '1/4 cup panko crumbs', '1 1/2 tablespoons grated Parmesan cheese', '1 tablespoon fresh minced parsley', '1/4 teaspoon dried oregano', '1/4 kosher teaspoon salt (divided)', 'fresh black pepper (to taste)', 'Juice of 1 lemon (divided)', '2 1/2 tablespoons melted unsalted butter', '1 tablespoon white wine']",
    "recipe_name": "Baked Scallops"
  },
  {
    "cooking_method": "['Peel, core, and slice the apples.', 'Place them in the slow cooker.', 'Add the cinnamon stick, lemon peel, lemon juice and brown sugar.', 'Set crock pot to low and cook for 6 hours.', 'Stir apples occasionally, apples will slowly become a delicious applesauce.', 'Remove cinnamon stick and use an immersion blender to blend until smooth or if you prefer a chunky sauce, leave sauce intact.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2011/10/Crockpot-Applesauce-7.jpg",
    "ingredients": "['8 medium apples (Use a combination of Golden Delicious, Honey Crisp, Fuji, Gala, etc.)', '1 strips of lemon peel - use a vegetable peeler', '1 tsp fresh lemon juice', '3 inch cinnamon stick', '5 teaspoons light brown sugar (unpacked (you can leave out for sugar-free))']",
    "recipe_name": "Crock Pot Applesauce"
  },
  {
    "cooking_method": "['Heat oven to 350F degrees.', 'Combine apples, raisins, cinnamon, honey and lemon juice in large bowl.', 'Sprinkle with cornstarch. Toss until fruit is coated.', 'Place fruit in an ungreased baking dish. Cover with foil and bake15 minutes. Remove from the oven.', 'Mix the remaining topping ingredients. Sprinkle over fruit.', 'Bake about 60 minutes or until topping is golden brown and fruit is tender.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2009/09/APPLE-CRISP-11.jpg",
    "ingredients": "['6 medium apples ((honey crisp or gala) peeled and sliced 1/4-inch thick)', '1.5 ounces raisins (small box)', '3/4 teaspoon ground cinnamon', '1 teaspoon fresh lemon juice', '1 tablespoon cornstarch', '1/4 cup honey', '1 cup quick oats (check labels for gluten-free)', '3 tablespoons light brown sugar (not packed)', '1 teaspoon cinnamon', '2 1/2 tablespoons butter (melted)']",
    "recipe_name": "Cinnamon Apple Crisp"
  },
  {
    "cooking_method": "['Wash leeks very carefully to remove all grit. I usually cut them horizontally and separate the rings to make sure no dirt remains. Coarsely chop them when washed.', 'In a medium soup pot, melt butter and add flour on low flame.', 'Using a wooden spoon, mix well. This will thicken your soup and give it a wonderful flavor.', 'Add chicken stock, leeks, onion, potatoes and bring to a boil.', 'Cover and simmer on low for about 20-25 minutes, until potatoes are soft.', 'Using an immersion blender, blend the soup until smooth adding the milk and adjusting salt and pepper to taste.', 'Serve immediately.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2009/10/POTATO-LEEK-SOUP2.-5.jpg",
    "ingredients": "['4 medium leeks (dark green stems removed)', '1/2 large white onion (chopped)', '2 medium russet potatoes (peeled and cut into cubes)', '1 tablespoon flour (use AP gluten free flour for GF)', '1 tbsp butter', '4 cups chicken stock (use vegetable broth for vegetarians)', '1/2 cup 2% milk', 'salt and fresh pepper']",
    "recipe_name": "Potato Leek Soup"
  },
  {
    "cooking_method": "['In a large bowl combine the tomatoes, red onion, basil, olive oil, garlic and season liberally with salt and pepper.', 'Let the tomato mixture sit room temperature for about 20 minutes to let the flavors blend (the juices from the tomatoes will release and create a kind of dressing). Toss well.', 'When ready to serve, toss the tomato mixture and divide in 4 bowls. Eat with crusty bread if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/09/BEEFSTEAK-TOMATO-SALAD-6.jpg",
    "ingredients": "['5 large or 8 cups medium ripe red heirloom or beefsteak tomatoes (cut into 1-inch cubes)', '1/2 cup red onion (chopped)', '8 - 10 fresh basil leaves (chopped)', '1 tablespoon extra virgin olive oil', '1 clove garlic (minced)', 'Kosher salt and fresh ground pepper to taste', 'good crusty bread (for serving (optional))']",
    "recipe_name": "Tomato Salad"
  },
  {
    "cooking_method": "['In a medium bowl, combine tuna with onion, scallions, soy sauce, sesame oil and sriracha.', 'Gently toss to combine and set aside while you prepare the bowls.', 'Peel, seed and cube the mango and avocado. Peel, halve, seed and thinly slice the cucumber. Thinly slice the jalapeno and scallions.', 'In 2 bowls, layer 1/2 the rice, 1/2 the tuna, mango, avocado, cucumber, jalapeno and scallions.', 'Top with Macadamia nuts and sesame seeds and serve with lime wedges and extra sauce on the side, if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/08/AHI-TUNA-POKE-BOWLS-9.jpg",
    "ingredients": "['12 pound sushi grade tuna (cut into 34-inch cubes)', '2 tablespoons thinly sliced white onion', '14 cup chopped scallions', '1 tablespoon reduced sodium soy sauce or gluten-free tamari', '12 teaspoon sesame oil', '14 teaspoon sriracha', '1 medium mango', '1 small Hass avocado (4 ounces)', '12 medium cucumber', '12-1 small jalapeno (to taste)', '2 scallions', '1 cup cooked brown rice', '2 tablespoons chopped roasted Macadamia nuts', '1 teaspoon toasted sesame seeds', 'Lime wedges (for serving)', 'Reduced sodium soy or gluten-free tamari (for serving (optional))', 'Sriracha (for serving (optional))']",
    "recipe_name": "Ahi Poke Bowl"
  },
  {
    "cooking_method": "['Place the lettuce in a large platter, top with tomatoes, crumbled bacon, blue cheese and serve with blue cheese dressing.', 'Top with chopped chives.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/08/CHOPPED-WEDGE-SALAD-8.jpg",
    "ingredients": "['6 cups chopped Romaine (Butter or Iceberg lettuce)', '2 small tomatoes (diced (or 1 cup halved cherry tomatoes))', '5 slices cooked center cut bacon', '1/4 cup crumbled blue cheese', '1/2 cup Homemade Blue Cheese Dressing', 'chopped chives (for garnish)']",
    "recipe_name": "Chopped Wedge Salad"
  },
  {
    "cooking_method": "['In each of 4 (4-cup) containers or bowls, arrange 1/3 cup chickpeas, 1/2 cup cucumber, 1/4 green pepper, 1/3 cup tomato, olives and red onion, top with Feta cheese.', 'In a small bowl whisk the lemon juice, olive oil, oregano, salt and pepper.', 'Serve about 1 1/2 tablespoons dressing with each salad.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/08/Meal-Prep-Greek-Chickpea-Salad-1.jpg",
    "ingredients": "['15 ounce can chickpeas (rinsed and drained (Goya))', '2 cups diced Persian cucumber', '1 green bell pepper (sliced)', '1 1/3 cups grape tomatoes (halved)', '20 kalamata or gaeta olives', '1/4 cup red onion (sliced lengthwise)', '4 ounces fresh feta (sliced thick)', 'Dressing:', 'juice of 2 fresh lemons', '2 tablespoons extra virgin olive oil', '2 teaspoons fresh oregano leaves (minced)', '1/4 teaspoon kosher salt', 'freshly ground black pepper (to taste)']",
    "recipe_name": "Greek Chickpea Salad"
  },
  {
    "cooking_method": "['Saute the onion in a small skillet with 1 teaspoon of the oil until soft, 3 to 4 minutes.', 'Transfer to the blender then add the remaining oil, mayo, vinegar, mustard, salt and pepper.', 'Then add the chopped jalapeno, cilantro and garlic and blend on high speed until the sauce is smooth and creamy, about 30 seconds.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/05/peruvian-green-sauce-1-7.jpg",
    "ingredients": "['2 tablespoons olive oil', '1/4 cup chopped red onion', '1/2 cup light Hellmans mayonnaise (use compliant mayo for whole30)', '2 tablespoons white vinegar', '4 teaspoons yellow mustard (Guldens)', '1/2 teaspoon kosher salt', '1/4 teaspoon freshly ground black pepper', '3 jalapenos (roughly chopped seeded but keeping the ribs (about 1 cup/3 oz))', '2 cups chopped fresh cilantro leaves and stems (2 oz rinsed well)', '3 medium cloves garlic (crushed through a press)']",
    "recipe_name": "Peruvian Green Sauce"
  },
  {
    "cooking_method": "['Preheat the oven to 400 degrees.', 'In a food processor, add the cabbage and pulse until finely minced. Set aside on a large, thin kitchen towel in the sink.', 'Sprinkle with salt and let stand for 10 to 15 minutes.', 'Wrap the cabbage up in the towel and wring out excess moisture over the sink (should eliminate about 13 cup of moisture). Set the cabbage aside.', 'Meanwhile, wipe out the food processor and add in the pork, ginger, green onions, pepper, soy sauce, rice wine, and sesame oil and pulse to mix the ingredients well, being careful not to over-pulse. (You dont want the mixture to become paste-like.)', 'Transfer to a large bowl and add the cabbage. Mix together with your hands to combine thoroughly. Set aside.', 'Using a mandoline, slice the zucchini into 1/16-inch-thick strips. Set 1 strip down and then set another one down on top of it to create a cross shape. Repeat with 2 more zucchini strips on an angle to create an 8-cornered star shape.', 'Spoon about 2 tablespoons of filling onto the center of the zucchini star. Bring the ends of the zucchini together, laying them over the filling.', 'Flip the dumpling over so the seam side is down.', 'Arrange on a baking sheet and repeat with remaining zucchini strips and dumpling filling, lining them up on the baking sheets as you go.', 'You should create 18 to 20 total dumplings.', 'Bake for 15 minutes, or until dumplings are firm and edges start to brown and crisp up.', 'Transfer the zucchini dumplings to serving platters, and sprinkle with green onions and red pepper flakes.', 'Serve with soy sauce.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/04/pork-dumplings-1-13.jpg",
    "ingredients": "['12 ounces napa cabbage leaves (roughly chopped)', '1 teaspoon salt', '2/3 pound ground pork', '1 tablespoon grated fresh ginger (using a zester)', '1/4 cup minced green onions (white and green parts, plus 14 cup finely minced, green parts only, for serving)', '1/4 teaspoon ground white pepper', '112 tablespoons reduced sodium soy sauce (plus more for serving (or coconut aminos for gf, whole30, paleo))', '1 tablespoon rice wine', '2 teaspoons sesame oil', '5 to 6 medium zucchini (about 112 inches in diameter)', 'Crushed red pepper flakes (for serving)']",
    "recipe_name": "Zucchini Pork Dumplings"
  },
  {
    "cooking_method": "['Preheat the oven to 325F. Spray a nonstick 9 x 9-inch baking pan with cooking spray and line with two strips of parchment 8 inches wide and long enough to leave a 2-inch overhang on all sides.', 'In a medium bowl, whisk 1 large whole egg with 1 egg yolk (separate the whites and reserve, set aside).', 'Add 14 cup water, the honey, and 1 teaspoon of the vanilla and stir with the spatula until combined.', 'In a large bowl, whisk together the almond meal, cocoa powder, salt, and baking soda.', 'Pour the egg mixture into the bowl with the dry mixture and mix well with a spatula. Fold in the chocolate chips.', 'Pour the batter into the prepared baking pan.', 'Soften the package of cream cheese in the microwave, mix in sugar, reserved egg white and remaining 1 teaspoon vanilla.', 'Pour over the brownie mix and spread over the top with a spatula, marbelize the with a toothpick.', 'Bake until a toothpick inserted into the center comes out clean, about 30 minutes.', 'Let cool for at least 30 minutes before cutting into 12 bars.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/05/cheesecake-brownies-1-8.jpg",
    "ingredients": "['Nonstick cooking spray', '2 large eggs', '3/4 cup finely ground almond meal or flour (such as Bobs Red Mill)', '1/3 cup unsweetened cocoa powder', '1/8 teaspoon kosher salt', '3/4 teaspoon baking soda', '1/2 cup raw honey', '2 teaspoons vanilla extract (divided)', '1/2 cup semisweet chocolate chips', '6 ounces 1/3 less fat cream cheese (softened in the microwave)', '2 tablespoons sugar']",
    "recipe_name": "Flourless Cheesecake Brownies"
  },
  {
    "cooking_method": "['To make the chicken:', 'Cut the chicken thighs into 1-inch (2.5-cm) pieces.', 'In a large bowl, whisk together the yogurt, oil, vinegar, garlic, oregano, turmeric, salt, and red pepper flakes.', 'Add the chicken and stir to coat. Cover and marinate in the refrigerator for at least 1 hour and up to 8 hours.', 'Preheat an outdoor grill or grill pan to medium-low heat.', 'Thread the chicken pieces among 4 wooden or metal skewers, discarding the marinade in the bowl.', 'Sprinkle with salt and pepper.', 'Grill the chicken, turning the skewers occasionally, until golden brown and cooked through in the center, about 15 minutes.', 'To make the salad:', 'In a medium bowl, whisk together the oil and vinegar and season with salt and pepper.', 'Add the cucumbers, cherry tomatoes, and red onion and toss to combine.', 'To make the bowls:', 'Divide the quinoa among 4 bowls, 1/2 cup each.', 'Top with the cucumber salad, followed by a spoonful of tzatziki, 1 tablespoon crumbled feta, and 3 olives.', 'Top with 1 chicken skewer and serve immediately.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/05/tzatziki-bowls-1.jpg",
    "ingredients": "['1 pound boneless (skinless chicken thighs)', '1/4 cup 1% plain Greek yogurt', '1 teaspoon olive oil', '1/2 tablespoon red wine vinegar', '2 cloves garlic (finely chopped)', '1/2 teaspoon dried oregano', '1/2 teaspoon ground turmeric', '3/4 teaspoon kosher salt (plus more for sprinkling)', '1/8 teaspoon red pepper flakes (optional)', 'Freshly cracked black pepper', '1 tablespoon olive oil', '1 tablespoon red wine vinegar', 'Kosher salt and freshly cracked black pepper', '3 Persian cucumbers (thinly sliced)', '1 cup 145 g cherry tomatoes, halved', '14 red onion (thinly sliced)', '2 cups cooked quinoa', '1 cup Skinny Tzatziki (from my blog)', '1/4 cup authentic feta (the kind that comes in brine, crumbled)', '12 smashed castelvetrano olives']",
    "recipe_name": "Chicken Tzatziki Bowl"
  },
  {
    "cooking_method": "['In a medium-size bowl, drizzle chicken with 1 teaspoon of the oil and season with 1 tablespoon of the Mexican Seasoning and salt.', 'Heat a large skillet over high heat. Add remaining teaspoon oil to the skillet.', 'Add the chicken and toss to coat. Cook 4 minutes, constantly stirring, until the chicken has browned and is cooked through. Transfer the cooked chicken to a plate and tent with foil to keep warm.', 'Add bell pepper, corn, and garlic to the empty skillet. Sprinkle with the Mexican seasoning. Continue cooking over medium-high heat, stirring frequently, until the peppers soften slightly, about 5 to 8 minutes.', 'Add the zucchini, season with remaining salt and cook, stirring often until the zucchini softens slightly, about 4 minutes.', 'Return the chicken back to the skillet, add the lime juice and scrape all the browned bits off the bottom of the skillet, stirring and mixing the juices over the chicken and vegetables.', 'Remove from the heat. Sprinkle cilantro and Cotija if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/04/Southwest-Chicken-Skillet-1-5.jpg",
    "ingredients": "['1 1/2 lb boneless (skinless chicken thighs cut into 1-inch thin strips (for breasts see notes)*)', '2 teaspoons olive oil', '1 tablespoon Mexican Seasoning Mix (see below)', '1/2 teaspoon kosher salt', '1 large red bell pepper sliced into thin matchsticks (about 1 cup)', '1 cup frozen or fresh corn kernels', '2 cloves garlic (minced)', '1 1/2 teaspoons Mexican Seasoning Mix', '14 ounces zucchini or summer squash (sliced 1/8-inch-thick (2 medium))', '1/2 teaspoon kosher salt', '2 tablespoons fresh lime juice (about 2 small limes)', '2 tablespoons fresh cilantro (chopped)', 'Cotija cheese (crumbled (optional))', '2 tablespoons of chili powder', '1/2 teaspoon red pepper flakes', '1/8 teaspoon cayenne pepper', '1/2 teaspoon oregano', '1 teaspoons smoked paprika', '1 tablespoons ground cumin', '1/2 teaspoon garlic powder', '1/2 teaspoon onion powder', '1/2 tablespoon kosher salt', '1/2 tablespoon freshly ground black pepper']",
    "recipe_name": "Southwest Chicken Skillet"
  },
  {
    "cooking_method": "['Use the Stove Top Hard Boiled Egg cooking method or the Instant Pot Hard Boiled Egg method to cook your eggs.', 'Cut eggs in half lengthwise. Remove yolks and put them in a bowl.', 'Add mayonnaise, mustard, salt and pepper to the yolks and mash.', 'Transfer them to a plastic bag, snip the corner and pipe them into the egg whites.', 'Top with chopped chives and paprika.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/11/Instant-Pot-Hard-Boiled-Eggs-Finals-6.jpg",
    "ingredients": "['4 large hard boiled eggs (cooled and peeled)', '2 tablespoon light mayonnaise (regular for Keto)', '1 teaspoon Dijon mustard', 'paprika (for garnish)', 'Kosher salt and fresh black pepper (to taste)', '2 tablespoons chopped fresh chives']",
    "recipe_name": "Classic Deviled Eggs"
  },
  {
    "cooking_method": "['Slow Cooker Directions:', 'Place the onions in a bowl and microwave about 2 minutes to sweat them out (or you can saute on the stove).', 'Add all sauce ingredients to the slow cooker. Stir to combine.', 'In a large bowl, combine all meatball ingredients, leaving 2 tablespoons of cilantro for garnish.', 'Gently form into 20 small meatballs. (Please note: Form the meatballs with gentle hands, if you pack them tight they will get tough while cooking.)', 'Place the meatballs on top of the sauce, cover and cook low 4 to 6 hours or high 2 to 3 hours.', 'Top with remaining 2 tablespoons of cilantro and serve over brown rice or cauliflower rice, if desired.', 'Instant Pot Directions:', 'Press saute and spray the cooking insert with oil, add the onions and saute 3 to 5 minutes, until softened.', 'Add the remaining sauce ingredients and stir to combine.', 'In a large bowl, combine all meatball ingredients, leaving 2 tablespoons of cilantro for garnish.', 'Gently form into 20 small meatballs. (Please note: Form the meatballs with gentle hands, if you pack them tight they will get tough while cooking.)', 'Place the meatballs on top of the sauce, cover and cook high pressure 15 minutes, natural release.', 'Top with remaining 2 tablespoons of cilantro and serve over brown rice or cauliflower rice, if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/04/Moroccan-Meatballs-1-6.jpg",
    "ingredients": "['For the sauce', '1 onion (chopped)', '2 14-ounce cans no salt added diced tomatoes', '112 teaspoons sweet paprika', '112 teaspoons cumin', '1 teaspoons kosher salt', '12 teaspoons hot paprika', '14 teaspoons freshly ground black pepper', '12 cup green olives (chopped)', 'For the meatballs:', '1 pound 93% lean ground beef', '12 cup finely diced onion', '2 teaspoons paprika', '1 12 teaspoons cumin', '12 teaspoons cinnamon', '1 teaspoons kosher salt', '14 teaspoons freshly ground black pepper', '14 teaspoons hot paprika', '2 tablespoons chopped fresh parsley', '14 cup chopped fresh cilantro (divided)', 'Cooked brown rice or cauliflower rice (for serving (optional))']",
    "recipe_name": "Moroccan Meatballs"
  },
  {
    "cooking_method": "['Preheat oven to 400F.', 'Wash and trim hard ends off asparagus. Place in a single layer in roasting pan.', 'Spray all over with olive oil and season with salt and pepper.', 'Roast in oven approximately 10 minutes, or until render crisp.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2008/05/roasted-asparagus-1.jpg",
    "ingredients": "['1 bunch fresh asparagus (about 18 ounces)', 'olive oil spray', 'kosher salt (to taste)', 'fresh black pepper']",
    "recipe_name": "Roasted Asparagus"
  },
  {
    "cooking_method": "['Stove Directions:', 'In a large pot or Dutch oven, melt butter over medium heat; add onions and cook, stirring often, until onions are soft, about 5-6 minutes.', 'Add broth, carrots, and ginger. Cover and bring to a boil. Reduce heat and simmer until carrots are soft, about 30 minutes.', 'Add sour cream, using an immersion blender (or in batches in a regular blender), carefully blend until smooth. Bring soup back to a boil, adjust salt and pepper to your taste.', 'Ladle into 4 bowls and garnish with a little more sour cream and fresh chives if desired. Makes 5 cups.', 'Instant Pot Directions:', 'Press saute in the pot and melt butter, add onions and cook, stirring often, until onions are soft, about 5 minutes.', 'Add broth, carrots, and ginger. Cover and cook high pressure 15 minutes, until the carrots are tender. Natural release.', 'Add sour cream, using an immersion blender (or in batches in a regular blender), carefully blend until smooth. Adjust salt and pepper to taste.', 'Ladle into 4 bowls and garnish with a little more sour cream and fresh chives if desired. Makes 5 cups.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2012/02/Carrot-Ginger-Soup-1.jpg",
    "ingredients": "['1 tablespoons unsalted butter (use oil for DF)', '1 large white onion (chopped)', '3 cups reduced-sodium vegetable broth', '1 lb peeled baby carrots', '1 tablespoon grated fresh ginger', '1/4 cup reduced fat sour cream (tofutti sour cream or coconut milk for dairy free)', 'kosher salt and white pepper to taste', '2 tablespoons fresh micro greens or chives (for garnish)']",
    "recipe_name": "Carrot Ginger Soup"
  },
  {
    "cooking_method": "['In a medium bowl, combine the chicken, 2 tablespoons soy sauce, 3 tablespoons cornstarch and egg white. Toss to combine and set aside while you chop the vegetables.', 'Mince the garlic and ginger and chop the scallions. Separate the scallion whites from the greens and set aside greens for garnish.', 'Heat a small sauce pot over medium heat. Add 1 teaspoon of sesame oil, ginger, garlic and scallion whites. Saute for 1 minute. Add the chicken broth, remaining 2 tablespoons soy sauce, sriracha, and hoisin and whisk to combine. Add the remaining 1 tablespoon cornstarch and whisk sauce until starting to thicken, about 2 minutes. Once thickened, turn heat to low and keep warm while you make the chicken.', 'Heat a large wok or non-stick skillet over medium-high heat. In two batches to prevent sticking, add 1/2 tablespoon of sesame oil then half of the chicken pieces. Cook chicken for 3-4 minutes, or until browned on the edges. Flip chicken and cook an additional 2-3 minutes, or until cooked through. Set aside on a plate and add the remaining oil and chicken as directed.', 'Return the chicken back to the skillet or wok, add the sauce to the skillet and toss to coat. Sprinkle with scallion greens and sesame seeds. Serve immediately with extra sriracha, if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/04/General-Tsos-Chicken-1-4.jpg",
    "ingredients": "['1 pound boneless (skinless chicken breast, cut into bite-size pieces)', '14 cup reduced sodium soy sauce (divided*)', '14 cup cornstarch (divided)', '1 large egg white', '1 1-inch piece peeled fresh ginger', '2 cloves garlic', '2 medium scallions (whites and greens separated)', '1 cup reduced sodium chicken broth', '1 teaspoon sriracha sauce (plus more for serving)', '3 tablespoons hoisin*', '1 tablespoon plus 1 teaspoon toasted sesame oil', 'sesame seeds (for garnish)']",
    "recipe_name": "General Tso's Chicken"
  },
  {
    "cooking_method": "['In a small saucepan, bring chicken broth to a simmer.', 'Add the couscous and cook gently until the broth is absorbed, approximately 3 minutes.', 'Remove from heat, fluff with a fork and transfer to large bowl.', 'To the bowl, add the radishes, scallions, parsley, raisins, tomatoes, almonds, mint, lemon juice and olive oil and toss to coat.', 'Season with salt and pepper, gently toss again, taste and adjust the flavorings and seasonings as desired, and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/12/Houstons-Couscous-1-2.jpg",
    "ingredients": "['1 12 cups reduced sodium chicken or vegetable broth', '1 cup dry whole wheat couscous (Lundberg brown rice couscous for GF)', '34 cup roughly chopped radishes', '2 scallions (chopped)', '3 tablespoons chopped fresh Italian parsley', '12 cup raisins', '12 grape tomatoes (halved )', '1/3 cup sliced almonds', '3 tablespoons chopped fresh mint', '1 tablespoon fresh lemon juice', '1 tablespoon extra-virgin olive oil', '12 teaspoon Kosher salt', 'Freshly ground black pepper (to taste)']",
    "recipe_name": "Houston's Couscous"
  },
  {
    "cooking_method": "['Preheat oven to 350F. Ladle about 1 cup sauce on the bottom of a 9 x 12 baking dish.', 'Cook noodles according to package directions, then drain.', 'Combine spinach, ricotta, Parmesan, egg, 1/2 teaspoon salt and black pepper in a medium bowl and mix.', 'Place a piece of wax paper on the counter and lay out lasagna noodles. Make sure noodles are dry. Take 1/3 cup of ricotta mixture and spread evenly over noodle. Roll carefully and place seam side down onto the baking dish. Repeat with remaining noodles.', 'Ladle remaining sauce over the noodles and top each one with 1 tbsp mozzarella cheese. Put foil over baking dish and bake for 40 minutes, or until cheese melts. Makes 9 rolls.', 'To serve, ladle a little sauce on the plate and top with lasagna roll.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2010/02/Spinach-Lasagna-Rolls-1-7.jpg",
    "ingredients": "['2 cups homemade marinara sauce (plus more for serving)', '9 uncooked lasagna noodles (wheat or gluten-free)', '10 oz package frozen chopped spinach (thawed and squeezed well)', '15 oz part skim ricotta cheese (I like Polly-o)', '1/2 cup grated Parmesan cheese', '1 large egg', 'kosher salt and fresh pepper', '9 tbsp about 3 oz part skim mozzarella cheese, shredded']",
    "recipe_name": "Spinach Lasagna Rolls"
  },
  {
    "cooking_method": "['Stove Top:', 'In a large pot or dutch oven, brown ground meat on high heat and season with salt.', 'Drain fat if any, reduce heat to medium-low, then add peppers, onions and garlic.', 'Cook about 5 minutes on low heat.', 'Add tomatoes, tomato sauce, chicken broth, marjoram and season with salt and pepper to taste. Cover and simmer on low heat for 30 minutes.', 'Serve about 1 1/2 cups of soup in each bowl and top with 1/2 cup cooked brown rice.', 'Instant Pot:', 'Press saute button on Instant Pot, spray the pot with nonstick spray, add the ground meat and salt and cook until no longer pink, 5 to 8 minutes.', 'Drain fat if any, then add peppers, onions and garlic and cook 4 to 5 minutes.', 'Add tomatoes, tomato sauce, chicken broth, marjoram and season with salt and pepper to taste. Cover and cook high pressure 15 minutes. Natural release.', 'Serve about 1 1/2 cups of soup in each bowl and top with 1/2 cup cooked brown rice.', 'Note: since there is no evaporation in the pressure cooker, you can reduce the broth by 1/2 cup.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/10/Stuffed-Pepper-Soup-1-3.jpg",
    "ingredients": "['3 cups cooked brown rice (omit for paleo diet)', '1 lb 95% lean ground beef', '1/2 cup chopped green bell pepper', '1/2 cup chopped red bell pepper', '1 cup finely diced onion', '3 cloves garlic (chopped)', '2 cans (14.5 oz each cans petite diced tomatoes)', '1 3/4 cups tomato sauce', '2 cups reduced sodium (fat-free chicken broth)', '1/2 tsp dried marjoram', 'salt and fresh pepper to taste']",
    "recipe_name": "Stuffed Pepper Soup"
  },
  {
    "cooking_method": "['Start by making the crespelles.', 'Preheat oven to 375F.', 'In a large bowl, combine ricotta, 1-1/2 cups of the mozzarella, egg, spinach, parmesan cheese, 1/2 teaspoon salt and pepper.', 'Fill each crespelle with 1/4 cup spinach filling and roll.', 'In a large baking dish, (or two smaller dishes) pour 1 cup of sauce on the bottom of the dish. Place rolled manicotti seem side down onto baking dish. Top with 1 1/2 cups more sauce and remaining mozzarella cheese.', 'Cover with foil and bake about about 25 minutes, until hot and bubbling, and the cheese is melted.', '*Use substitute for vegetarian parmesan.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2010/04/spinach-manicotti-1-14.jpg",
    "ingredients": "['16 homemade crespelles', '15 oz part skim ricotta cheese (I use Polly-O)', '2 cups shredded part-skim mozzarella cheese (reserve 1/2 cup Polly-O)', '1 large egg', '10 oz package frozen spinach (thawed and squeezed really well)', '1/4 cup grated Parmesan Regianno*', '1/2 teaspoon kosher salt', 'black pepper (to taste)', '2 1/2 cups jarred marinara or homemade marinara sauce']",
    "recipe_name": "Homemade Spinach Manicotti"
  },
  {
    "cooking_method": "['Soak the beans overnight in water. Discard the water the next day.', 'Set pressure cooker to saute, add the oil and chopped onion and cook until soft. Add the garlic, 1/4 cup cilantro and cook 1 minute. Set aside in a bowl.', 'In the pressure cooker combine the soaked beans, green chilies, jalapeno, half onion, bouillon, bay leaves and 6 cups water. Cover and cook high pressure 45 minutes.', 'Natural release. Discard bay leaves, half onion and jalapeno and stir in the reserved sauteed onion and season with salt.', 'Press saute and cook uncovered until thickened, about 30 minutes, stirring occasionally.', 'Meanwhile, combine the tomato, red onion, scallion and cilantro in a small bowl.', 'Ladle beans into serving bowls, add the cheese and top with tomato mixture and avocado. Serve with lime wedges and tortillas if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/11/mexican-pinto-beans-1.jpg",
    "ingredients": "['1 pound dried pinto beans', '1 teaspoon olive oil', '1 small yellow onion (chopped)', '1/4 cup minced cilantro', '3 clove garlic (minced)', '1/2 medium yellow onion (left whole)', '1 4.24 ounce can chopped green chilies', '1 whole jalapeno', '2 tablespoons chicken or vegetable bouillon (Better than Bouillon)', '2 bay leaves', '1 teaspoon Kosher salt', '2 medium vine tomatoes (cored, seeded, and chopped)', '1/4 medium red onion (chopped)', '2 scallions (chopped)', '1/4 cup minced cilantro', '3 ounces queso Oaxaca or mozzarella (diced 1/4-inch)', '8 ounces sliced avocado', 'lime wedges (for serving)', 'tortillas (optional for serving)']",
    "recipe_name": "Mexican Pinto Beans"
  },
  {
    "cooking_method": "['If using, prepare Skinny Garlic Mashed Potatoes according to directions.', 'In a large saute pan, heat the butter and oil. Add the mushrooms and 12 teaspoon salt, cook for 10 minutes, stirring occasionally.', 'Add the onion, carrots, parsley, thyme, 12 teaspoon salt and pepper and saute 10 minutes.', 'Stir in garlic, cook for 30 seconds, then add the tomato paste, Worcestershire, remaining 14 teaspoon salt and pepper.', 'Sprinkle vegetables with the flour, stir to coat and cook, scraping brown bits from the pan, 3-4 minutes.', 'Add the broth, peas and corn, cook, stirring often, until sauce has thickened (about 5 minutes).', 'To assemble: Preheat broiler to high.', 'Transfer vegetables to an 8 x 11 casserole dish.', 'Spread mashed potatoes in an even layer over the vegetables, top with parmesan and broil 5 minutes, or until top is golden.', 'Garnish with parsley.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/11/Mushroom-Shepards-Pie-8.jpg",
    "ingredients": "['For potatoes:', 'Skinny Garlic Mashed Potatoes or roughly 4 cups leftover mashed potatoes', '1 ounce freshly grated parmesan cheese', 'For vegetables:', '1 tablespoon butter', '1 tablespoon olive oil', '1 12 pounds Portobella mushrooms (cut into 1-inch cubes)', '1 14 teaspoon Kosher salt (divided)', '1 medium onion (diced)', '7 ounces 3 medium carrots, peeled and diced', '14 cup chopped fresh parsley (plus more for garnish)', '2 tablespoons chopped fresh thyme or rosemary', '2 cloves garlic (minced)', '1 tablespoon tomato paste', '2 teaspoons Worcestershire sauce', 'Freshly ground black pepper (to taste)', '2 tablespoons all-purpose or gluten-free flour', '1 12 cups low sodium vegetable or chicken broth', '1 cup frozen green peas', '1 cup frozen corn kernels']",
    "recipe_name": "Portobello Shepherd's Pie"
  },
  {
    "cooking_method": "['Rub garlic all over meat then season with salt, cumin and black pepper.', \"To broil, place steak on rack in broiler pan so surface of beef is 3 to 4 inches from heat. Broil about 3 minutes on each side for medium rare to medium. To grill, heat the grill and oil the grates. When hot, grill over medium-high heat about 3 minutes on each side for medium rare to medium. To cook in a skillet, Heat a skillet over high heat and let the skillet get very hot. When it's hot, spray with oil and cook the steaks about 3 minutes on each side for medium rare to medium.\", 'Squeeze juice from 1 lime wedge over each steak. Slice Steaks into thin slices.', 'To serve, divide the lettuce, pico de gallo, cheese and guacamole between two plates.', 'Serve with steak; garnish with lime wedges and jalapeno, if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/10/Carne-Asada-Salad-1-6.jpg",
    "ingredients": "['1 beef Strip Steak Boneless (1 inch thick, trimmed (about 10 ounces))', '1 large clove garlic (minced)', '1 teaspoon ground cumin', '1/2 teaspoon kosher salt', 'black pepper (to taste)', '3 cups mixed greens', '1/2 cup pico de gallo ((store bought or recipe here))', '1/4 cup shredded Monterrey Jack', '2 lime wedges', '1/2 cup prepared or my homemade guacamole', 'Additional lime wedges ( optional)', 'jalapeno slices (optional)']",
    "recipe_name": "Carne Asada Salad"
  },
  {
    "cooking_method": "['Slice beef into thin slices with the grain. Cut each strip across the grain about 1\" long so you have small thin slices. Place in a bowl and add 4 tsp of soy sauce, 1 tbsp of rice wine, 1 tsp cornstarch and black pepper.', 'In a small bowl, mix 3 tbsp soy sauce, 1 tbsp water and 2 tsp cornstarch. Set aside.', 'Heat the wok on high heat. Swirl in 2 teaspoons of the oil and add the beef spreading evenly in the wok. Cook undisturbed for 20 seconds letting the beef brown. Using a spatula, stir meat, cooking another 2 minutes. Transfer to a plate.', 'Add remaining teaspoon of oil to wok, add peppers and onions and cook about 4 to 5 minutes. Return beef to the wok, add the sauce and red pepper flakes and stir fry about 30 seconds until slightly thickened.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2009/07/Pepper-Steak-4-5.jpg",
    "ingredients": "['12 oz top round beef (trimmed)', '4 teaspoons plus 3 tablespoons soy sauce (liquid aminos for paleo or whole30*)', '1 tbsp rice wine', '3 tsp cornstarch (or arrowroot for paleo or whole30)', '1 tbsp vegetable oil', '1 large onion (sliced into thin strips)', '1 bell pepper (sliced into thin strips)', '1/2 tsp black pepper', 'crushed red pepper flakes (optional)']",
    "recipe_name": "Pepper Steak"
  },
  {
    "cooking_method": "['Preheat the oven to 400F. Spread 1/4 cup marinara sauce on the bottom of a 13 x 9-inch baking dish.', 'Cut the zucchini lengthwise, into 1/4-inch thick slices until you have a total of 12 slices about the same size. Its easiest to do this with a mandolin. My mandolin is from OXO.', 'Season both sides of the zucchini with 1/2 tsp salt and pepper, then grill on a grill pan over high heat to help dry out the zucchini, until pliable and grill marks form, but not fully cooked, about 2 minutes on each side.', 'In a medium bowl, beat the egg then mix together with ricotta, Pecorino Romano, basil, garlic, 1/8 tsp salt and 1/8 tsp pepper.', 'Spread the ricotta mixture (about 1 1/2 tablespoons each) evenly onto each zucchini slice, spreading to cover.', 'Roll up slices and arrange them each seam side down in the prepared dish. Top each with 1 tbsp marinara sauce and 1 tbsp mozzarella cheese and tightly cover with foil.', 'Bake 20 minutes, or until the cheese is hot and melted.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/07/noodle-less-zucchini-rollatini-1.jpg",
    "ingredients": "['2 large (14 oz each zucchini, cut lengthwise into 12 (1/4-inch thick) slices)', '1/2 teaspoon kosher salt', 'fresh black pepper (to taste)', '1 cup quick marinara sauce', '1 large egg', '2/3 cup part skim ricotta cheese (I like Polly-O)', '1/2 cup grated Pecorino Romano cheese (plus more for serving)', '1/4 cup chopped basil', '1 garlic clove (minced)', '3/4 cup 3 oz shredded mozzarella (I like Polly-O)']",
    "recipe_name": "Zucchini Rollatini"
  },
  {
    "cooking_method": "['Preheat the oven to 400F.', 'Arrange the tomatoes on a baking tray and top each with 1/2 teaspoon pesto and 1/2 tablespoon of Parmesan cheese.', 'Roast the tomatoes until the Parmesan cheese is slightly browned and melted, about 18-20 minutes.', 'Remove from the oven and serve immediately.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/08/BakedPesto-ParmesanTomatoes.jpg",
    "ingredients": "['4 medium tomatoes (halved)', '4 teaspoons basil pesto (store bought or homemade)', '5 tbsp shredded Parmesan cheese']",
    "recipe_name": "Pesto-Parmesan Baked Tomatoes"
  },
  {
    "cooking_method": "['Heat the grill on medium heat and spray the grates with oil.', 'Mix oregano, sesame seeds, cumin, and red pepper flakes in a small bowl to combine; set spice mixture aside.', 'Beginning and ending with salmon, thread salmon and folded lemon slices onto 8 pairs of parallel skewers to make 8 kebabs total.', 'Spray the fish lightly with oil and season kosher salt and the reserved spice mixture.', 'Grill the fish, turning occasionally, until fish is opaque throughout, about 8 to 10 minutes total.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/06/grilled-salmon-kabobs.jpg",
    "ingredients": "['2 tbsp chopped fresh oregano', '2 tsp sesame seeds', '1 tsp ground cumin', '1/4 tsp crushed red pepper flakes', '1-1/2 pounds skinless wild salmon fillet (cut into 1-inch pieces)', '2 lemons (very thinly sliced into rounds)', 'olive oil cooking spray', '1 tsp kosher salt', '16 bamboo skewers soaked in water 1 hour']",
    "recipe_name": "Grilled Salmon Kebabs"
  },
  {
    "cooking_method": "['Carefully remove 2 large outer leaves of a head of lettuce. If you rip or tear one, just save it for the 3rd leaf you need to shred. Shred the 3rd leaf and set aside.', 'Dice tomato and set aside in a bowl.', 'Combine diced tomato with mayonnaise and fresh black pepper.', 'Place lettuce cups on a plate, top with shredded lettuce. Add tomato then bacon and roll it like a wrap and dig in!']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2011/05/BLT-Lettuce-Wraps-1-2.jpg",
    "ingredients": "['4 slices center cut bacon (cooked and chopped)', '1 medium tomato (diced)', '1 tbsp light mayonnaise (or whole30 approved mayo)', '3 large iceberg lettuce leaves', 'fresh cracked pepper', '1 ounce avocado optional (add 1 point)']",
    "recipe_name": "BLT Lettuce Wraps"
  },
  {
    "cooking_method": "['In a medium bowl combine the flour, baking powder and salt and whisk well.', 'Add the yogurt and mix with a fork or spatula until well combined, it will look like small crumbles.', 'Lightly dust flour on a work surface and remove dough from the bowl, knead the dough a few times until dough is tacky, but not sticky, about 20 turns (it should not leave dough on your hand when you pull away).', 'Clean and preheat the grill on high heat, covered.', 'Working one at a time, divide into 4 equal balls about 3-3/8 oz each.', 'Sprinkle a work surface and rolling pin with a little flour roll the dough out into thin ovals.', 'Oil the grates of the grill then add the pizza dough directly to the grill.', 'Cook, covered 1 to 1 1/2 minutes on each side until grill marks appear on both sides.', 'Spread 1 tablespoon pizza sauce over each crust. Top each with 1 ounce of cheese.', 'Put it back on the grill covered until the cheese is melted and bubbling, about 1 minute.', 'Top with fresh arugula, salt and pepper and eat right away.', 'To make this in the oven, bake the dough 450F 10 to 12 minutes turning halfway before adding the sauce and cheese.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/07/Grilled-Pizza-1-9.jpg",
    "ingredients": "['1 cup all purpose or white whole wheat flour* ((5 oz ))', '1 1/2 teaspoons baking powder', '1/2 teaspoon kosher salt', \"1 cup 0% Stonyfield Greek yogurt (not regular, drained if there's any liquid)\", 'Pizza:', '1/4 cup pizza sauce', '4 ounces fresh mozzarella cheese (sliced thin)', '1 1/2 cups baby arugula', 'kosher salt and black pepper to taste']",
    "recipe_name": "Grilled Pizza"
  },
  {
    "cooking_method": "['Place the chicken breasts, 1 at a time, in a Ziploc bag. Pound the chicken breast to an even thickness, being careful not to puncture the bag. Put breasts in the bag.', 'In a medium bowl, combine the soy sauce, apple sauce, onion, ginger, garlic, oil, bourbon, BBQ sauce, vinegar, brown sugar and red pepper flakes. Reserve and refrigerate 1/3 cup of the marinade and transfer the remainder to the Ziploc bag with the chicken. Refrigerate and marinate for at least 30 minutes or as long as overnight (the longer the better!! I marinated mine 12 hours).', 'Preheat outdoor grill over medium high heat. Discard the marinade in the bag and grill the chicken for 4 minutes per side, or until chicken is cooked through. Transfer chicken to a plate, tent with foil and allow to rest while you make the sauce.', 'Put reserved 1/3 cup marinade in a small sauce pan. Add chicken broth and bring to a boil over medium high heat. Once boiling, reduced heat to medium-low until sauce has thickened slightly, 5 to 6 minutes.', 'Slice chicken breast, top with sauce, scallions and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/07/BBQ-Bourbon-Chicken-1.jpg",
    "ingredients": "['2 pounds 4 boneless, skinless chicken breasts', '1/2 cup low sodium or gluten-free soy sauce', '1/2 cup unsweetened apple sauce', '1/2 cup finely chopped yellow onion', '2 teaspoon grated ginger', '4 garlic cloves (minced)', '1 tablespoon canola oil', '1/4 cup bourbon', '1/4 cup BBQ sauce', '2 tablespoons apple cider vinegar (I like Braggs)', '2 tablespoons brown sugar', 'Pinch red pepper flakes', '1/2 cup low sodium chicken broth', 'sliced scallions (for garnish)']",
    "recipe_name": "Grilled Bourbon Chicken"
  },
  {
    "cooking_method": "['For dressing:', 'In a small blender or food processor, combine dressing ingredients.', 'Refrigerate and set aside until ready to use.', 'For shrimp:', 'Pat shrimp dry with a paper towel.', 'In a medium bowl, combine all spices from garlic powder to pepper.', 'Add the shrimp and sesame oil and toss gently to evenly coat.', 'Heat a medium non-stick skillet over medium heat. Cook shrimp 2 minutes per side or until cooked through.', 'Transfer to a plate or cutting board and allow to cool and rest while you assemble the salad.', 'For salad:', 'In a large bowl, toss together the cabbage, arugula and romaine. Transfer mixture to 2 salad bowls or plates.', 'Top each with half the shrimp, corn, cucumber, carrots, basil and cilantro.', 'Evenly drizzle the dressing over both salads and serve with lime wedges.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/07/Spicy-Thai-Shrimp-Salad-1-2.jpg",
    "ingredients": "['1 tablespoon olive oil', '3 tablespoons lime juice', '14 cup whole roasted (salted cashews)', '14 teaspoon red pepper flakes', '2 teaspoons honey', '1 2-inch piece fresh ginger, roughly chopped', '1 tablespoon unseasoned rice vinegar', '14 cup cilantro', '1 clove garlic (roughly chopped)', '14 cup roughly chopped white onion', '12 teaspoon garlic powder', '12 teaspoon kosher salt', 'Freshly ground black pepper (to taste)', '12 pound large peeled (deveined tail-off shrimp)', '1 teaspoon garlic powder', '14 teaspoon ground ginger', '14 teaspoon kosher salt', '1/8 teaspoon turmeric', '1/8 teaspoon chili powder', 'Freshly ground black pepper (to taste)', '1 teaspoon toasted sesame oil', '1 cup shredded purple cabbage', '1 12 cups packed baby arugula', '1 12 cups packed chopped romaine lettuce', '1 small corn cob (kernels removed)', '12 medium cucumber (peeled, seeded and diced)', '12 cup shredded carrots', '2 tablespoons chopped basil', '2 tablespoons chopped cilantro', 'Lime wedges (for serving)']",
    "recipe_name": "Spicy Thai Salad"
  },
  {
    "cooking_method": "['Toss the lettuce, cucumbers, tomatoes, red onion with oil and vinegar, season with salt and pepper to taste.', 'Top with roasted red pepper, salami and mozzarella.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/07/Italian-Chopped-Salad-1-2.jpg",
    "ingredients": "['4 cups chopped romaine', '1/2 cup peeled English cucumber (cubed)', '1/2 cup halved cherry tomato', 'sliced red onion', '2 tablespoons olive oil', '1 tablespoon red wine vinegar', 'kosher salt and black pepper', '1/2 roasted red pepper (in water, chopped)', '1 ounce genoa salami (sliced)', '6 tablespoons shredded part-skim mozzarella']",
    "recipe_name": "Italian Chopped Salad"
  },
  {
    "cooking_method": "['Toss all the ingredients together and serve right away.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/07/Feta-Chopped-Salad-1-2.jpg",
    "ingredients": "['8 cups chopped romaine lettuce', '1/2 English cucumber (peeled and diced in large chunks)', '1/3 cup Feta cheese (crumbled)', '1/8 small red onion (sliced lengthwise)', '1/4 cup olive oil', '2 tablespoon red wine vinegar', '1 1/2 tablespoons fresh chopped dill', '1/2 teaspoon kosher salt', 'fresh black pepper (to taste)']",
    "recipe_name": "Chopped Feta Salad"
  },
  {
    "cooking_method": "['Grill or Broil Method:', 'Rub the lamb chops with oil and garlic.', 'Squeeze the lemon over both sides, than season with salt, zatar and black pepper.', 'Grill on an outdoor grill or indoor grill pan over medium-high heat to desired liking, about 4 to 5 minutes on each side or broil in the oven on the top rack, 4 to 5 minutes on each side.', 'Air Fryer Method:', 'Rub the lamb chops with oil and garlic.', 'Squeeze the lemon over both sides, than season with salt, zatar and black pepper.', 'Preheat the air fryer to 400F. In batches in an even layer, cook to desired liking, about 4 to 5 minutes on each side.', '*My chops had 2 1/2 oz raw meat on each bone, nutritional info is based off of that.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/07/Zatar-Lamb-Chops-1-2.jpg",
    "ingredients": "['8 lamb loin chops (trimmed (about 3.5 oz each bone-in))', '3 cloves garlic (crushed)', '1 teaspoon extra-virgin olive oil', '1/2 fresh lemon', '1 1/4 teaspoon kosher salt', '1 tbsp Zaatar', 'fresh ground pepper (to taste)']",
    "recipe_name": "Za’atar Lamb Chops"
  },
  {
    "cooking_method": "[\"To poach chicken breast: Cover chicken breast in broth in a small pot, add water if it doesn't cover the chicken.\", \"Add salt and pepper, a piece of celery and it's leaves (you could add herbs like parsley, garlic, onion, or whatever you want) and bring to a boil.\", 'Reduce to a simmer and cook 5 minutes.', 'Remove from heat, cover tight and let it sit for 15-20 minutes or until thickest part of the breast registers 160 degrees. Chicken will be cooked through.', 'Drain, let it cool and cut into small cubes.', 'Combine mayo, yogurt, salt, pepper and mix well.', 'Add chicken, grapes, apples, celery, and let it chill in the refrigerator until you are ready to eat it.', 'Mix in pecans right before serving.', 'Serve over baby greens.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2010/05/Chicken-Waldorf-Salad-1-5.jpg",
    "ingredients": "['7 oz 1 breast poached chicken breast (recipe follows)', '2 cups low sodium chicken broth', '1 medium apple (peeled and cut into small cubes (I used Granny Smith))', '1 cup red seedless grapes (cut in half)', '1/2 cup celery (chopped)', \"1/4 cup light Hellman's mayonnaise\", '2 tbsp 0% Greek yogurt (I like Stonyfield)', 'Kosher salt and pepper', '2 tbsp pecans or walnuts', '6 cups mixed baby greens like spinach and arugula']",
    "recipe_name": "Chicken Waldorf Salad"
  },
  {
    "cooking_method": "['Shred the potatoes in a food processor or with a box grater. Rinse shredded potatoes until water is clear, then drain and squeeze dry with a towel. Place shreds to a plate lined with 2 layers of paper towels. Cook in a microwave on high for 2 minutes.', 'Transfer to a bowl, let it cool a few minutes then mix in the scallion whites, flour, egg, salt, garlic powder, onion powder, chili powder, paprika and black pepper until evenly distributed.', 'Heat a cast iron skillet on medium to medium-low heat. When hot generously spray with oil, then add the potatoes in an even layer.', 'Cook until nicely browned on the bottom, about 7 to 8 minutes. Slide onto a plate, spray the skillet again then place the other side into the skillet, cook until brown on the other side, about 7 to 8 minutes more. Garnish with scallion greens.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/10/hashbrown-recipe-1-4.jpg",
    "ingredients": "['2 medium russet potatoes (skin on, 7 ounces each)', '3 medium scallions (green and white separated, finely chopped)', '1/4 cup all-purpose or gluten-free flour', '1 large egg (beaten)', '1 teaspoon kosher salt', '1 teaspoon garlic powder', '1/2 teaspoon onion powder', '1/2 teaspoon chili powder', '1/2 teaspoon paprika', '1/8 teaspoon black pepper', 'olive oil spray']",
    "recipe_name": "Hash Brown Recipe"
  },
  {
    "cooking_method": "['Instant Pot', 'Press the saute button on an electric pressure cooker. Add the turkey and brown the meat, using a wooden spoon to break it into small pieces as it cooks, 4 to 5 minutes. Drain the meat and transfer it to a small bowl.', 'In the pressure cooker (still on saute), melt the butter. Add the onion, carrots, celery, and garlic. Cook, stirring, until softened, about 5 minutes. Add the flour, salt, and pepper to taste and cook, stirring, for 1 minute to cook the flour. Return the turkey to the pressure cooker and add the chicken broth, potatoes, and cauliflower and stir.', 'Seal and cook on high pressure for 10 minutes, until the potatoes are soft. Quick release, then open when the pressure subsides.', 'Transfer the cauliflower and 1 cup of the liquid to a blender and blend until smooth. Pour the puree into the soup and stir well. Add the cheddar and stir until melted. Serve topped with the scallions.', 'Stove Method', 'To make this in a large pot or Dutch oven, saute over medium-high heat in steps 1 and 2. For step 3, bring to a boil, then cook, covered, over low heat until the potatoes and cauliflower are tender, 25 to 30 minutes. Transfer 1 cup of the liquid and the whole cauliflower to the blender, and blend until smooth. Stir the puree into the soup, add the cheddar, and serve topped with the scallions.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/10/Cheeseburger-Soup-1.jpg",
    "ingredients": "['1/2 pound Fit &amp; Active 93% Lean Ground Turkey', '1 tablespoon unsalted butter', '1 medium onion (chopped)', '2 medium carrots (chopped)', '2 celery stalks (chopped)', '2 garlic cloves (minced)', '2 tablespoons all-purpose flour (wheat or gluten-free*)', '1/2 teaspoon kosher salt', 'Freshly ground black pepper', '3 1/2 cups SimplyNature Organic Low Sodium Free Range Chicken Broth*', '10 ounces Yukon Gold potatoes (2 medium, peeled and finely diced)', '1 12-ounce wedge cauliflower (1/4 of a large head), stem attached', '1 3/4 cups shredded Fit &amp; Active 2% Milk Sharp Cheddar Cheese*', '2 tablespoons chopped scallions (for garnish)']",
    "recipe_name": "Cheeseburger Soup"
  },
  {
    "cooking_method": "['Preheat oven to 400 degrees F.', 'In a large bowl, whisk together the shrimp ingredients from olive oil through pepper.', 'Add the shrimp and toss to evenly coat.', 'Set aside and allow to marinate while you make the veggies.', 'Combine all veggie ingredients in a large bowl. Use your hands to toss and evenly coat veggies with oil and seasoning.', 'Transfer to a sheet pan and roast 20 minutes, tossing halfway through.', 'Meanwhile, prepare the rice and salsa. In a medium bowl, combine rice with cilantro, salt and lime juice.', 'In small bowl, make the salsa by combining the tomatoes, onion, cilantro, salt and pepper.', 'Remove veggies from oven and place marinated shrimp (leaving excess marinade in the bowl) evenly among the veggies.', 'Return to the oven and roast 8 minutes.', 'Place 34 cup rice in each of 4 bowls. Evenly divide the shrimp, veggies, salsa and sliced avocado among each bowl and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/11/Shrimp-Fajitas-Bowls-Finals-5.jpg",
    "ingredients": "['1 tablespoon olive oil', 'Juice of 1 lime', '1 teaspoon chili powder', '1 teaspoon cumin', '1 teaspoon oregano', '12 teaspoon smoked paprika', '12 teaspoon kosher salt', '12 teaspoon garlic powder', '12 teaspoon onion powder', 'Freshly ground black pepper (to taste)', '1 pound large peeled (deveined, tail-off shrimp)', '2 medium red bell peppers (sliced)', '1 large red onion (sliced)', '1 tablespoon olive oil', '12 teaspoon kosher salt', 'Freshly ground black pepper (to taste)', '3 cups cooked brown rice', '2 tablespoons chopped cilantro', '14 teaspoon salt', 'Juice of 12 lime', '1 cup diced tomatoes', '1/3 cup chopped white onion', '14 cup chopped cilantro', 'Pinch kosher salt', 'Freshly ground black pepper (to taste)', '1 small (4-ounce Hass avocado, thinly sliced)']",
    "recipe_name": "Shrimp Fajita Bowls"
  },
  {
    "cooking_method": "['Liberally coat a large pot or Dutch oven with oil spray and warm over medium-high heat.', 'Add the onion and bell pepper and saute, stirring occasionally, for about 7 minutes, or until the onion softens.', 'Add the garlic, stir everything together, and cook until fragrant, about 30 seconds.', 'Add the ground turkey or chicken. Use a spatula or large spoon to break up the meat as it cooks. Continue to cook about 6 to 7 minutes, until fully cooked.', 'Add the beans, diced tomatoes, tomato paste, pumpkin puree, broth, chili powder, cocoa powder, cinnamon (or pumpkin pie spice), cumin, black pepper, and optional cayenne pepper, and stir.', 'Reduce heat and simmer for 20 to 30 minutes, stirring occasionally.', 'Right before serving, add the spinach and mix throughout.', 'Enjoy the chili with desired toppings, such as avocado, nonfat plain Greek yogurt, cilantro, and salsa.', 'Press saute on the instant pot, then follow the steps 1 to 5, cook 15 min high pressure, natural release. Add the spinach just before serving.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/10/Turkey-Pumpkin-Chili-1-2.jpg",
    "ingredients": "['1 large yellow onion (diced (about 2 cups))', '1 medium bell pepper (red, yellow, or orange, diced)', '6 garlic cloves (minced (or 3/4 teaspoon garlic powder))', '113 pounds ground turkey or chicken (90 to 93 percent lean)', 'One 15-ounce can white beans (drained and rinsed)', 'One 28-ounce can diced tomatoes with liquid', '14 cup tomato paste (no salt added)', 'One 14-ounce can pumpkin puree', '1 cup reduced-sodium chicken or vegetable broth', '2 tablespoons chili powder', '1 tablespoon cocoa powder', '112 teaspoons ground cinnamon (or 1 tablespoon pumpkin pie spice)', '212 teaspoons ground cumin', '1 teaspoon kosher salt', '12 teaspoon ground black pepper', '12 teaspoon cayenne pepper (optional)', '4 cups baby spinach leaves', 'Avocado (optional)', 'Sour cream or Nonfat plain Greek yogurt (optional)', 'Cilantro (optional)']",
    "recipe_name": "Pumpkin Turkey Chili"
  },
  {
    "cooking_method": "['Combine the drained beans, water, onion, and garlic in the Instant Pot.', 'Stir well, making sure the beans are submerged. Secure the lid and move the steam release valve to Sealing. Select', 'Manual/Pressure Cook to cook at high pressure for 20 minutes.', 'When the cooking cycle is complete, let the pressure naturally release for 10 minutes, then move the steam release valve to Venting to release any remaining pressure. When the floating valve drops, remove the lid and drain the beans, reserving the liquid.', 'Return the cooked beans to the Instant Pot, and stir in 12 cup of the reserved cooking liquid, along with the cumin, chili powder, black pepper, cayenne, and 12 teaspoon salt. Use a potato masher to mash the cooked beans until smooth, leaving some texture if you like. (You can use an immersion blender for pureed beans, if you prefer.)', 'Taste and adjust the seasoning, adding more salt as needed, and serve warm with a garnish of cilantro and a squeeze of lime juice.', 'Store leftover beans in an airtight container in the fridge for 1 week.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/10/Instant-Pot-Not-Fried-Pinto-Beans-Finals-9.jpg",
    "ingredients": "['1 cup dried pinto beans (soaked for 8 hours and drained)', '3 cups water', '12 yellow onion (chopped)', '2 cloves garlic (minced)', '1 teaspoon ground cumin', '1 teaspoon chili powder', '14 teaspoon freshly ground black pepper', 'Pinch of cayenne pepper (optional)', '12 to 34 teaspoon fine sea salt', 'Optional garnish: Chopped fresh cilantro (Lime wedges, diced tomato, sliced jalapeno, diced avocado, crumbled queso)']",
    "recipe_name": "Not-Fried Pinto Beans"
  },
  {
    "cooking_method": "['In a blender, blend flour, milk, eggs and oil until smooth.', 'Heat a nonstick crepe pan on medium-low flame. When hot, spray with cooking spray to coat bottom of skillet.', 'Pour 1/4 cup crepe mixture into pan, swirling pan slightly to make crepe thin and smooth.', 'Cook for 1 minute or until bottom of crepe is light golden brown.', 'Flip; cook 30 seconds to 1 minute or until light golden brown.', 'Set aside on a plate and repeat with remaining crepe mixture until you have 6.', 'For the bananas, melt the butter over low heat in a large non-stick skillet.', 'Add the brown sugar, cinnamon, and vanilla extract, stir until the sugar is dissolved.', 'Add 2 tablespoons of water, cover and let the sauce simmer about 2 minutes.', 'Add the sliced bananas, gently spooning the sauce over each piece and cook for about 2 to 3 minutes, or until the bananas are glossy and coated with the sauce.', 'Remove from heat.', 'To serve, spoon a generous 1/3 cup of the bananas in the center of each crepe and fold the left and right side of the crepes to cover.', 'Top each crepe with 2 tablespoons ice cream, and any pan juices from the bananas on top, sprinkle with cinnamon and serve right away.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/02/BANANAS-FOSTER-DESSERT-CREPES-8.jpg",
    "ingredients": "['1/2 cup all purpose or white whole wheat flour', '3/4 cups 1% milk (or milk of your choice)', '1 large egg', '1/2 teaspoon oil (olive or grapeseed)', 'nonstick spray', '1 1/2 teaspoons salted butter (coconut oil for dairy-free)', '3 tablespoons brown sugar', '1/8 teaspoon cinnamon', '1 1/2 teaspoons vanilla extract', '3 medium ripe bananas (sliced into 1/4-inch thick slices on the bias)', '3/4 cup vanilla ice cream (or dairy-free ice cream)']",
    "recipe_name": "Banana Foster Crepes"
  },
  {
    "cooking_method": "['Finely grate the zest from 1 orange, about 2 teaspoons.', 'Juice both oranges into a bowl (you should have about 3/4 cup).', 'Whisk in the honey, soy sauce, and vinegar with 1 tablespoon of water.', 'In a small bowl, combine the cornstarch with 1 tablespoon of the orange-soy mixture to form a paste, then stir that back into the bowl with the rest of the orange-soy mixture.', 'Pat the shrimp dry with paper towels and season both sides with salt and pepper.', 'In the largest skillet (or wok) you have, heat 1 teaspoon of the oil over medium high heat until shimmering-hot, almost smoking.', 'Add half of the shrimp, spread it out in one layer, and cook until the underside is bright pink, 1 to 112 minutes. Flip and cook 1 minute more, then transfer the shrimp to a plate.', 'Repeat with another 1 teaspoon oil and shrimp. Set aside.', 'Add the remaining teaspoon of oil to the skillet. Add the garlic, ginger, scallion whites, and red pepper flakes and cook until fragrant, 30 seconds to 1 minute. Add the orange-soy liquid and the orange zest and cook, stirring, until thickened, 1 to 2 minutes.', 'Return the shrimp to the skillet, add the scallion greens, and toss to coat with the sauce.', 'Divide the shrimp among 4 bowls and serve with rice.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/02/HONEY-GARLIC-SHRIMP-6.jpg",
    "ingredients": "['2 large oranges', '1 tablespoon honey', '2 tablespoons reduced or gluten-free sodium soy sauce', '1 tablespoon unseasoned rice vinegar', '1 tablespoon cornstarch', '32 jumbo shrimp (peeled and deveined (18 ounces total))', '1/4 teaspoon Kosher salt', 'freshly ground black pepper', '1 tablespoon canola oil (divided)', '6 cloves garlic (minced)', '1 tablespoon finely minced fresh ginger', '2 scallions (whites thinly sliced, greens cut into 2-inch lengths)', '1/4 to 1/2 teaspoon red pepper flakes', 'Cooked rice (for serving)']",
    "recipe_name": "Honey Garlic Shrimp"
  },
  {
    "cooking_method": "['Preheat oven to 400F and line a large baking sheet with nonstick aluminum foil.', 'Heat a medium nonstick skillet over medium heat and spray with oil. Add onion, cilantro and garlic and saute about 2 minutes, until soft. Add ground turkey, salt, garlic powder, cumin and cook meat for 4 to 5 minutes until meat is completely cooked through breaking it up with a spoon. Add the tomato paste and water, mix well and simmer on medium for about 2 to 3 minutes, remove from heat.', 'Meanwhile, combine cream cheese, cheddar and scallions in a medium bowl. Using a small spoon or a spatula, spoon about 1 teaspoon of the cream cheese filling into the peppers.', 'Arrange in a single layer, cut-side up close together. Bake until soft, about 12 to 15 minutes.', 'Top with meat and cheese and bake until melted, about 3 minutes more.', 'Remove from oven and top with pico de gallo, olives and drizzle with sour cream. Garnish with cilantro and scallions and serve immediately.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/01/Jalapeno-Popper-Nachos-13.jpg",
    "ingredients": "['Reynolds Wrap Non-Stick Foil', 'olive oil spray', '1/2 pound 99% lean ground turkey', '1 clove garlic (minced)', '2 tablespoons chopped onion (minced)', '1 tbsp chopped fresh cilantro', '1/2 teaspoon garlic powder', '1/2 teaspoon cumin powder', '1/2 teaspoon kosher salt', '1/2 tablespoon tomato paste', '2 tablespoons water', '8 jalapeno peppers (halved and seeded and membranes removed (use gloves))', '3 ounces 1/3 less fat cream cheese', '1 large scallions (green part only, sliced)', '1/2 ounce shredded sharp cheddar cheese', '1/2 cup shredded sharp cheddar cheese', 'chopped scallions and cilantro (for garnish)', '2 tablespoons sour cream plus 2 teaspoons water (for drizzling)', '1/2 cup pico de gallo', '2 tablespoons sliced black olives']",
    "recipe_name": "Jalapeno Popper \"Nachos\""
  },
  {
    "cooking_method": "['To make the shredded chicken, place chicken in the slow cooker and add enough water or chicken broth to cover. Cook high 4 hours. Remove and shred with two forks, discard the liquid.', 'Meanwhile, combine the cream cheese, sour cream, vinegar and hot sauce together until smooth. Add half of the blue cheese.', 'Transfer to the slow cooker with the chicken, mixing well and return to the slow cooker, cook low 2 to 3 hours.', 'Transfer to a serving dish and top with the remaining blue cheese, garnish with scallions. Serve hot.', 'To bake this in the oven, you can use cooked shredded chicken breast from a rotisserie chicken, then mix all the ingredients and place them in a baking dish. Bake 350F until hot, about 20 to 25 minutes.', 'Cook chicken covered in water or broth 15 min high pressure. Once you shred and drain set the instant pot to the slow cooker mode, combine ingredients and proceed.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2010/02/Slow-Cooker-Buffalo-Chicken-Dip-5.jpg",
    "ingredients": "['2 boneless skinless chicken breasts (16 ounces)', '4 oz 1/3 less fat cream cheese (softened (Philadelphia))', '1 cup fat-free sour cream or Greek yogurt (I prefer sour cream)', '1/2 cup Franks red hot sauce (or whatever hot sauce you like)', '1/2 cup crumbled blue cheese', '1 teaspoon white vinegar', 'scallions (optional for garnish)', 'cut up celery sticks and carrot sticks (for dipping)']",
    "recipe_name": "Buffalo Chicken Dip"
  },
  {
    "cooking_method": "['In a large skillet over medium heat add 1/2 tablespoon of olive oil and 1/2 tablespoon of butter, red bell pepper and garlic and cook for about 4 minutes.', 'Add spinach season with a pinch of salt and pepper mix until the spinach wilts down.', 'Add cream cheese, half  half and parmesan cheese mix well until cream cheese is melted and resembles creamed spinach.', 'Heat a separate skillet on medium high heat, add remaining oil and butter.', 'Season fish on both sides with salt and pepper and place on the hot pan.', 'Cook 6 minutes on first side and flip fish over and cook other side an additional 5 minutes, until cooked through and browned.', 'Divide the spinach mixture on the bottom of each plate and top with piece of fish.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/01/Fish-Florentine-10.jpg",
    "ingredients": "['4 5 oz thick pieces of skinless white firm fish fillet (such as grouper, bass or halibut)', '1 tablespoons extra virgin olive oil', '1 tablespoon salted butter', '1 cup red bell pepper chopped', '2 cloves garlic minced', '9 ounces fresh baby spinach (from two bags)', '2 ounces 1/3 less fat cream cheese (I like Philadelphia)', '14 cup half &amp; half cream', '3 tablespoons grated Parmesan cheese', 'kosher salt', 'fresh black pepper']",
    "recipe_name": "Fish Florentine"
  },
  {
    "cooking_method": "['Stove Directions:', 'Heat the oil in a large pot or Dutch oven over medium heat, add the onions and carrots and saute until soft, about 5 to 6 minutes, stirring.', 'Add the chopped garlic, turmeric and cumin and continue cooking for 2 - 3 minutes more.', 'Stir in the lentils, add the broth and bring to a boil, reduce heat and cook covered on low for about 30 minutes, stirring occasionally until thickened. Remove from heat.', 'Toss in parsley, spinach and stir in lemon juice and serve.', 'Instant Pot Directions:', 'Press saute and add the oil to the insert, add the onions and carrots and saute until soft, about 5 minutes, stirring.', 'Add the chopped garlic, turmeric and cumin and continue cooking for 2 - 3 minutes. Press cancel.', 'Add the lentils and broth, cover and cook on high pressure 15 minutes. Natural or quick release.', 'Toss in parsley, spinach and stir in lemon juice and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/01/Lentil-Turmeric-Soup-4.jpg",
    "ingredients": "['1 tablespoon olive oil', '1 medium onion (diced)', '2 medium carrots (diced)', '2 cloves of garlic (finely chopped)', '16 ounces 2 1/3 cups red or yellow lentils (I used red)', '8 cups of chicken or vegetable broth', '1 teaspoon turmeric', '1 1/2 teaspoons ground cumin', '1/4 cup fresh chopped flat-leaf parsley', '2 cups 2 oz baby spinach', 'Juice of half a lemon']",
    "recipe_name": "Red Lentil Soup"
  },
  {
    "cooking_method": "['Combine all the ingredients and refrigerate until ready to eat.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2019/01/egg-salad-4.jpg",
    "ingredients": "['6 hard boiled eggs (peeled and chopped)', '3 tablespoons mayonnaise', '1 teaspoon finely chopped red onion', '1/4 teaspoon kosher salt', 'fresh black pepper (to taste)', '1/8 teaspoon sweet paprika (for garnish)', 'chopped chives (for garnish)']",
    "recipe_name": "Classic Egg Salad"
  },
  {
    "cooking_method": "['Combine the first 4 ingredients for the vinaigrette in a small bowl and whisk well, add onions and set aside.', 'Cut the lobster into large chunks. Place 1 cup greens in each bowl and top with lobster, avocado, eggs, bacon, tomatoes and corn. Drizzle 2 1/2 tbsp vinaigrette over each salad and enjoy.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/06/Lobster-Cobb-3.jpg",
    "ingredients": "['10 oz cooked (chilled lobster meat (yield from 2 1-1/2 lb lobsters))', '2 cups baby greens', '2 ounces avocado (diced)', '2 hard boiled eggs (sliced)', '4 slices center cut bacon (cooked and crumbled)', '1/2 cup quartered grape tomatoes', '1/2 cup *cooked corn kernels (from 1 fresh cobb)', ';', '1 tsp dijon mustard', '4 tsp olive oil', '2 tbsp plus 1 tsp red wine vinegar', '1/4 teaspoon kosher salt', '2 tablespoons chopped red onion']",
    "recipe_name": "Lobster Cobb Salad"
  },
  {
    "cooking_method": "['Combine onion, olive oil, balsamic, 1/4 tsp kosher salt and pepper. Set aside a few minutes.', 'Chop tomatoes and place in a large bowl. Combine with garlic, basil, onion-balsamic combo and additional 1/8 tsp salt and pepper to taste. Set aside and let it sit at least 10 minutes or as long as overnight.', 'Toss in the cheese when ready to serve.', 'Season chicken with salt and fresh pepper.', 'Preheat the grill to medium-high, clean and oil the grates to prevent sticking.', 'Grill the chicken 2 minutes on each side, set aside on a platter and top with bruschetta and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/05/bruscetta-chicken-1-4.jpg",
    "ingredients": "['3 medium vine ripe tomatoes', '2 small cloves garlic (minced)', '1/4 cup chopped red onion', '2 tbsp fresh basil leaves (chopped)', '1 tbsp extra virgin oil', '1 tbsp balsamic vinegar', 'kosher salt and fresh cracked pepper to taste', '3 oz part skim mozzarella (diced (omit for whole30, paleo))', '1.25 lbs 8 thin sliced chicken cutlets']",
    "recipe_name": "Grilled Bruschetta Chicken"
  },
  {
    "cooking_method": "['Preheat oven to 375 degrees.', 'In a small bowl, combine the cumin, oregano, garlic powder, chili powder, salt and pepper. Rub on both sides of each chicken piece.', 'Spray a small (8x6-ish) oval or rectangular baking dish with cooking spray and pour a thin layer of enchilada sauce on the bottom of the dish.', 'Lay chicken, cut side up on a work surface. Top each piece, in the center, with about 2 teaspoons chilis and 1 1/2 tablespoons cheese.', 'Roll each one up and set them seam side down in the baking dish. Top with remaining sauce, cheese and chilis.', 'Cover with foil and bake for 30 minutes. Remove foil and continue to bake 10-15 minutes more, or until chicken is cooked through.', 'Top each chicken roll-up with a few avocado pieces and cilantro and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/05/Danielle-Chicken-Enchilada-Roll-Ups.jpg",
    "ingredients": "['1 teaspoon cumin', '2 teaspoon dried oregano', '1 teaspoon garlic powder', '1/2 teaspoon chili powder', '1 teaspoon Kosher salt', 'Freshly ground black pepper (to taste)', 'Cooking spray', '1 10-ounce can mild red enchilada sauce (I used my homemade enchilada sauce)', '1 12 pounds 3 boneless, skinless chicken breasts, cut in half lengthwise', '1 4-ounce can mild green chilis', '1 cup reduced fat shredded Mexican cheese blend', '1 large (6-ounce avocado, cubed)', 'Chopped cilantro (for garnish)']",
    "recipe_name": "Enchilada Chicken Roll-Ups"
  },
  {
    "cooking_method": "['Wash chicken and dry with a paper towel. Slice chicken breast horizontally to create 4 thinner cutlets. Season lightly with salt and fresh pepper.', 'Preheat the oven to 400 F. Line baking sheet with foil or parchment if desired for easy clean-up.', 'Place the chicken on prepared baking sheet. Spread about 1 teaspoon of pesto over each piece of chicken.', 'Bake for 15 minutes or until chicken is no longer pink in center. Remove from oven; top with tomatoes, mozzarella and parmesan cheese. Bake for an additional 3 to 5 minutes or until cheese is melted.', 'To Grill: Grill chicken over medium flame on both sides until cooked through in the center. Lower flame, top chicken with pesto, tomatoes and cheese, and close grill until cheese melts.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2012/09/Chicken-Pesto-Bake-1-2.jpg",
    "ingredients": "['2 16 oz total boneless, skinless chicken breasts', 'kosher salt and fresh pepper to taste', '4 teaspoons Skinny Basil Pesto', '1 medium tomatoes (sliced thin)', '6 tbsp 1.5 oz shredded mozzarella cheese', '2 teaspoons grated parmesan cheese']",
    "recipe_name": "Chicken Pesto Bake"
  },
  {
    "cooking_method": "['In a large bowl, combine the panko crumbs, egg, mayonnaise, dijon, chives, parsley, lemon juice, Old Bay, paprika, tabasco, salt and pepper. Mix well, then fold in crab meat, careful not to over mix.', 'Gently shape into round, flattened patties with your hands, about 1/2 cup each. Makes 4 patties.', 'Heat the waffle iron on high, spray with oil.', 'Place one in the center and close gently, cook until the edges are golden, about 2 1/2 to 3 minutes.', 'Serve with lemon wedges.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/05/Waffled-Crab-Cake-1.jpg",
    "ingredients": "['9 ounces lump crab meat (shell pieces removed)', '1/2 cup panko crumbs (plain or gluten-free*)', '1 large egg (beaten)', '1 large egg white', '1 tablespoon mayonnaise', '1 teaspoon Dijon mustard', '2 tablespoons chopped chives', '2 tablespoons minced fresh parsley', '1 tablespoon fresh lemon juice', '1/2 teaspoon Old Bay Seasoning', '1/8 teaspoon paprika', 'few dashes tabasco (optional)', '1/8 teaspoon kosher salt', 'black pepper (to taste)', 'cooking spray (I use a mister)', '4 lemon wedges (for serving)']",
    "recipe_name": "Waffled Crab Cakes"
  },
  {
    "cooking_method": "['Divide the lettuce, chickpeas, cucumbers, tomatoes and avocado in two bowls.', 'Season with salt and pepper to taste and drizzle each with olive oil and vinegar or lemon juice.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/09/Chickpea-Avocado-Salad-1-2.jpg",
    "ingredients": "['2 cups chopped greens such as romaine', '1 cup canned chickpeas (rinsed and drained)', '2/3 cup diced cucumbers', '2/3 cup halved cherry tomatoes', '2 ounces sliced avocado (from 1/2 small)', '2 tsp extra virgin olive oil', '3 tsp unfiltered apple cider vinegar (I use Braggs or fresh lemon juice)', 'kosher salt', 'fresh black pepper (to taste)']",
    "recipe_name": "Chickpea Avocado Salad"
  },
  {
    "cooking_method": "['Preheat oven to 350°F.', 'Cut apples in half and remove core and seeds with a small pairing knife or spoon.', 'In a small bowl combine butter, brown sugar, flour, oats and cinnamon. Spoon on top of the apple halves and sprinkle with cinnamon.', 'Place on a cookie sheet and bake in the oven for 30 minutes.', 'Serve warm with a scoop of ice cream if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2010/09/Delightfully-Baked-Apples-1.jpg",
    "ingredients": "['2 large apples (cut in half)', '2 tbsp butter (melted)', '2 tbsp brown sugar (unpacked)', '2 tbsp all purpose or gluten-free flour', '4 tbsp quick oats*', 'pinch of cinnamon']",
    "recipe_name": "Delightfully Baked Apples"
  },
  {
    "cooking_method": "['Using a small spoon or melon baller, hollow out the center of the zucchini halves, leaving 1/4-inch thick shell on each half.', 'Chop the scooped out flesh of the zucchini in small pieces and set aside 2/3 of a cup to use in the meat filling, saving the rest to use in another recipe.', 'Drop the zucchini in boiling water for 1 minute, remove and drain.', 'Heat a large non-stick skillet over medium-high heat and cook the ground beef with 1/2 teaspoon salt and 1/4 teaspoon cumin until browned and cooked through, breaking up into smaller pieces with a wooden spoon as it cooks, about 3-4 minutes. Transfer the cooked meat to a bowl.', 'Add the oil to the skillet and cook the onions and garlic over medium heat until golden, about 3 minutes.', 'Add the tomatoes, a pinch of salt and simmer about 4 to 5 minutes, until it creates a sauce.', 'To the skillet, add 2/3 cup of the reserved chopped zucchini and season with salt and pepper, to taste. Cook until soft, about 4 minutes.', 'Return the cooked meat to the skillet and simmer covered for about 8 minutes until tender. Add the chopped hard boiled eggs and cook 2 to 3 minutes, adjusting salt and pepper to taste as needed.', 'On a clean working surface, fill the hollowed out zucchinis with the meat filling, dividing equally between each one.', 'Place the broth in large deep 6-quart saucepan with a fitted lid. Heat over medium heat and add the stuffed zucchini halves into the saucepan, cover and reduce heat to low, cook for about 10 minutes, or until the zucchini is soft and cooked through.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/08/Colombian-Style-Zucchini-Relleno-1-3.jpg",
    "ingredients": "['4 medium (7 ounce each zucchinis, cut in half lengthwise)', '8 oz 90% lean ground beef', 'kosher salt', '1/4 teaspoon cumin', '3 garlic cloves', '2/3 diced cup onion', '2 cups plum tomatoes (chopped fine)', '1 teaspoon olive oil', 'black pepper (to taste)', '1/4 cup low sodium chicken broth', '2 hard boiled eggs (chopped)']",
    "recipe_name": "Colombian-Style Zucchini Rellenos"
  },
  {
    "cooking_method": "['Oven Method:', 'Preheat oven to 375F. Place parchment paper or a silpat on a baking sheet. If using parchment paper, spray with oil to avoid sticking.', 'In a medium bowl combine the flour, baking powder and salt and whisk well.', 'Add the yogurt and mix with a fork or spatula until well combined, it will look like small crumbles.', 'Lightly dust flour on a work surface and remove dough from the bowl, knead the dough a few times until dough is tacky, but not sticky, about 15 turns (it should not leave dough on your hand when you pull away).', 'Divide dough into 8 equal balls. Flatten each ball into circles, then place 1/2 tablespoon cream cheese on each. Cover the dough well and roll into a ball. Repeat with the remaining dough.', 'Top with egg wash and sprinkle with seasoning of your choice if desired.', 'Bake on the top rack of the oven for 25 minutes. Let cool at least 10 minutes before eating.', 'Air Fryer Method:', 'Spray the basket to avoid sticking.', 'Preheat the air fryer 325F degrees and set for 11 to 12 minutes. Transfer in batches without overcrowding and bake 11 to 12 minutes, or until golden.', 'No need to turn. Let cool at least 10 minutes before eating.', ' ']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/02/bagel-balls-1.jpg",
    "ingredients": "['1 cup 5 oz unbleached all purpose flour, whole wheat or gluten-free mix*', '2 teaspoons baking powder (make sure its not expired or it wont rise)', '3/4 teaspoon kosher salt (use less if using table salt)', '1 cup non-fat Greek yogurt (not regular yogurt, it will be too sticky)', '4 tablespoons 4 ounces, or half package 1/3 less fat cream cheese, cut into 8 cubes', '1 egg white (beaten (whole egg works fine too))', 'optional toppings: everything bagel seasoning, sesame seeds, poppy seeds, dried garlic flakes, dried onion flakes**', ';']",
    "recipe_name": "Stuffed Bagel Balls"
  },
  {
    "cooking_method": "['Preheat the oven to 375F.', 'In a large bowl, whisk the sugar, cornstarch and salt. Toss in berries and gently mix to coat.', 'Add lemon juice and lemon zest, then divide evenly into 4 (6 oz) ramekins.', 'Cut the pie crust into 4 circles about 4 inches round. Roll to elongate slightly.', 'Cut a heart out of the center and place the crust over the fruit in the ramekins. Brush with egg wash.', 'Place the ramekins on a rimmed baking baking sheet and place in the center of the oven.', 'Bake until the berries are hot and bubbling and the crust is golden, about 40 minutes.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/02/berry-pie-1-7.jpg",
    "ingredients": "['4 tablespoons raw sugar', '1 1/2 tablespoons cornstarch', 'pinch of salt', '1 1/4 cups fresh strawberries (stemmed and sliced)', '1 1/4 cups fresh raspberries', '1 1/4 cups fresh blackberries', '1 teaspoon fresh lemon juice', 'plus 1/4 teaspoon lemon zest', 'refrigerated pie crust*', '1 egg (beaten)', '*once cut each crust will weigh about 3/4 ounce.']",
    "recipe_name": "Mixed Berry Pie"
  },
  {
    "cooking_method": "['Add 2 teaspoons of the canola oil on high heat in a large skillet.', 'Add the shrimp and cook for 1 minute on each side then remove the shrimp from the pan.', 'Add the remaining teaspoon of the canola oil to the skillet with the onions.', 'Cook the onions for 5 minutes on medium heat, stirring occasionally.', 'Add in the ginger, cumin, coriander, turmeric, paprika, curry powder, chili powder, salt and garlic.', 'Stir well, letting cook for 30 seconds then add in the tomato sauce and combine.', 'Add in the coconut milk and shrimp to the pan and stir well.', 'Garnish with cilantro and chili peppers if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/01/Indian-Shrimp-Curry-5.jpg",
    "ingredients": "['1 tablespoon canola oil (divided)', '1 pound shrimp (peeled and deveined)', '1/2 yellow onion (finely chopped)', '1 teaspoon ground ginger', '1 teaspoon ground cumin', '1 teaspoon ground coriander', '1 1/2 teaspoons ground turmeric', '1 teaspoon curry powder', '1 teaspoon paprika', '1/2 teaspoon chili powder', '2 cloves garlic (minced)', '1 15 ounce can tomato sauce', '3/4 cup lite canned coconut milk', '1/2 teaspoon Kosher salt', 'cilantro and chili peppers for garnish']",
    "recipe_name": "Indian Shrimp Curry"
  },
  {
    "cooking_method": "['Season the shrimp with cumin, and salt and pepper to taste.', 'Heat a large nonstick skillet over medium-high heat.', 'Add 1 teaspoon of the oil to the pan, then add half of the shrimp. Cook them undisturbed for about 2 minutes. Turn the shrimp over and cook until opaque throughout, about 1 minute. Transfer to a plate.', 'Add the remaining 1 teaspoon oil and the remaining shrimp to the pan and cook, undisturbed, for about 2 minutes. Turn the shrimp over, add the garlic, and cook until the shrimp is opaque throughout, about 1 minute.', 'Return the first batch of shrimp to the skillet, mix well so that the garlic is evenly incorporated and remove the pan from the heat.', 'Squeeze the lime juice over all the shrimp. Add the cilantro, toss well, and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/01/shrimp-cilantro-and-lime-recipe.jpg",
    "ingredients": "['1 1/2 pounds peeled and deveined jumbo shrimp', '1/4 teaspoon plus 1/8 teaspoon ground cumin', 'Kosher Salt and freshly ground black pepper', '2 teaspoons extra-virgin olive oil', '5 garlic cloves (crushed)', '2 tablespoons lime juice (from 1 medium lime)', '3 to 4 tablespoons chopped fresh cilantro']",
    "recipe_name": "Cilantro Lime Shrimp"
  },
  {
    "cooking_method": "['Preheat oven to 375F. Line a rimmed baking sheet with a silicone liner or Silpat.', \"In a large bowl combine the flour, baking powder and salt and whisk well. Add the yogurt and mix with a spoon until incorporated. Then use your dry hands and knead about 15 times. If it's too sticky you can add a little more flour. Roll into a ball.\", 'Divide the dough into 8 equal pieces then roll each piece into worm like strips, about 9 inches long.', 'Tie each breadstick into a knot-like ball; place on the prepared baking sheet. Spray the top with olive oil.', 'Bake on the top third of the oven until golden about 18 minutes. Let them cool 5 minutes.', 'Meanwhile, in medium nonstick skillet melt the butter, add the garlic and cook until golden, 2 minutes.', 'Toss the knots in the skillet with the melted butter and garlic or use a brush to cover the knots with the garlic.', 'If the knots are too dry, give them another mist of olive oil. Sprinkle with parmesan cheese and chopped parsley.', 'Preheat the air fryer 325F degrees and set for 11 to 12 minutes. Cook in batches without overcrowding and bake 11 to 12 minutes, or until golden. No need to turn.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/01/easy-garlic-knots-1-3.jpg",
    "ingredients": "['olive oil spray', '1 cup all purpose or white whole wheat flour (see notes above for gluten-free)', '3/4 teaspoon kosher salt (less for table salt)', '2 teaspoons baking powder', '1 cup fat free Greek Yogurt (drained of any excess liquid (I like Fage))', '2 teaspoons butter', '3 cloves garlic (chopped)', '1 tbsp grated parmesan cheese', '1 tablespoon finely chopped fresh parsley']",
    "recipe_name": "Easy Garlic Knots"
  },
  {
    "cooking_method": "['Heat a medium skillet over medium-high heat. Add the sausage and cook, breaking the meat up with spoon as it cooks as small as you can, about 4 to 5 minutes.', 'Add the cauliflower, salt and marinara and cook 6 minutes on medium heat, stirring until the cauliflower is tender and heated through.', 'Remove from heat and add the mozzarella cheese to the skillet and stir well to mix. Let it cool 3 to 4 minutes, until its easy to handle.', 'Spray a 1/4 cup measuring cup with cooking spray and fill with cauliflower mixture, leveling the top. Use a small spoon to scoop out into your palm and roll into a ball. Set aside on a dish.', 'Repeat with the remaining cauliflower, you should have 6 balls.', 'Place the egg in one bowl and the breadcrumbs in another.', 'Add the parmesan to the crumbs and mix.', 'Dip the ball in the egg, then in the crumbs and transfer to a baking sheet. Spray the top with cooking spray.', 'If baking in the oven, bake 425F 25 minutes, until golden. If making in the air fryer, bake 400F for 9 minutes turning halfway until golden.', 'Serve with marinara sauce, for dipping.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/01/cauliflower-rice-balls-low-carb-arancini-1-11.jpg",
    "ingredients": "['1 Italian chicken sausage link (casing removed (2 3/4 oz))', '2 1/4 cups riced cauliflower (frozen works great)', '1/4 teaspoon kosher salt', '2 tablespoons homemade marinara (plus optional more for serving)', '1/2 cup part skim shredded mozzarella', '1 large egg (beaten)', '1/4 cup bread crumbs* (or gluten-free crumbs)', '1 tablespoon grated Pecorino Romano or parmesan*', 'cooking spray']",
    "recipe_name": "Cauliflower Rice Arancini"
  },
  {
    "cooking_method": "['Oven Method:', 'Preheat oven to 375F. Place parchment paper or a silpat on a baking sheet. If using parchment paper, spray with oil to avoid sticking.', 'In a medium bowl combine the flour, baking powder and salt and whisk well. Add the yogurt and mix with a fork or spatula until well combined, it will look like small crumbles.', 'Lightly dust flour on a work surface and remove dough from the bowl, knead the dough a few times until dough is tacky, but not sticky, about 15 turns (it should not leave dough on your hand when you pull away).', 'Divide into 4 equal balls. Roll each ball into 3/4-inch thick ropes and join the ends to form bagels. (or you can make a ball and poke a hole in the center then stretch it slightly)', 'Top with egg wash and sprinkle both sides with seasoning of your choice. Bake on the top rack of the oven for 25 minutes. Let cool at least 15 minutes before cutting.', 'Air Fryer Method:', 'In a medium bowl combine the flour, baking powder and salt and whisk well. Add the yogurt and mix with a fork or spatula until well combined, it will look like small crumbles.', 'Lightly dust flour on a work surface and remove dough from the bowl, knead the dough a few times until dough is tacky, but not sticky, about 20 turns (it should not leave dough on your hand when you pull away).', 'Divide into 4 equal balls. Roll each ball into 3/4-inch thick ropes and join the ends to form bagels.', 'Top with egg wash and sprinkle both sides with seasoning of your choice.', 'Preheat the air fryer 280F degrees. Transfer in batches without overcrowding and bake 15 to 16 minutes, or until golden. No need to turn. Let cool at least 15 minutes before cutting.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/01/Easy-Bagel-Recipe-1.jpg",
    "ingredients": "['1 cup 5 oz unbleached all purpose flour, whole wheat or gluten-free mix*', \"2 teaspoons baking powder (make sure it's not expired or it won't rise)\", '3/4 teaspoon kosher salt (use less if using table salt)', '1 cup non-fat Greek yogurt (not regular yogurt, it will be too sticky)', '1 egg white (beaten (whole egg works fine too))', 'optional toppings: everything bagel seasoning, sesame seeds, poppy seeds, dried garlic flakes, dried onion flakes**']",
    "recipe_name": "Easy Bagel Recipe"
  },
  {
    "cooking_method": "['Lay a large piece of plastic wrap on a work surface.', 'Arrange the slices of salmon in an overlapping fashion to create a rectangle about 6 inches wide by 12 inches long, with one of the longest sides facing you.', 'Gently spread the cream cheese over the salmon trying not to dislodge any of the pieces. Lay the cucumber along one side of the rectangle about 1/2 inch from the edge.', 'Using the plastic wrap to guide you, roll the salmon up tightly around the cucumber sticks. Refrigerate until firm at least 30 minutes.', 'Using a sharp knife, cut the roll into 16 1/2-inch thick slices.', 'Sprinkle with red onion and capers and serve with lemon slices.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/03/smoked-salmon-pinwheels-1-2.jpg",
    "ingredients": "['8 ounces thinly sliced cold smoked salmon (I like Nova Lox)', '4 ounces 1/3 less fat cream cheese', '1/4 medium cucumber (cut into matchsticks)', '2 tablespoons finely chopped red onion', '2 tablespoons capers (drained)', '1/2 lemon (sliced thin)']",
    "recipe_name": "Smoked Salmon Pinwheels"
  },
  {
    "cooking_method": "['Oven Method:', 'Preheat oven to 375F.', 'Place parchment paper or a silpat on a baking sheet. If using parchment paper, spray with oil to avoid sticking.', 'In a medium bowl combine the flour, baking powder, sugar, cinnamon and salt and whisk well.', 'Add the yogurt and raisins, mix with a fork or spatula until well combined, it will look like small crumbles.', 'Lightly dust flour on a work surface and remove dough from the bowl, knead the dough a few times until dough is tacky, but not sticky, about 10 to 15 turns (it should not leave dough on your hand when you pull away).', 'Divide into 8 equal balls. Place on the prepared baking sheet.', 'Top with egg wash. Bake on the top rack of the oven for 25 minutes. Let cool at least 30 minutes before icing.', 'For the icing:', 'In a small bowl, whisk the powdered sugar with milk until smooth. Transfer to a small ziplock bag and cut the tip. Ice the tops of the rolls in a cross pattern.', 'Air Fryer Method:', 'Preheat the air fryer 325F degrees and set for 11 to 12 minutes.', 'Transfer in batches without overcrowding and bake 11 to 12 minutes, or until golden. No need to turn.', 'Let cool at least 30 minutes before icing.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/03/hot-cross-buns-1-5.jpg",
    "ingredients": "['1 cup 5 oz unbleached all purpose flour, whole wheat or gluten-free mix*', '2 teaspoons baking powder (make sure its not expired or it wont rise)', '2 tablespoons raw sugar', '3/4 teaspoon cinnamon', '1/2 teaspoon kosher salt (use less if using table salt)', '1 cup 0% Greek yogurt (not regular yogurt, it will be too sticky)', '3 tablespoon raisins', '1 egg white (beaten (whole egg works fine too))', '1/4 cup powdered sugar', '1 teaspoon milk or water']",
    "recipe_name": "Hot Cross Buns"
  },
  {
    "cooking_method": "['Preheat oven to 350F. Spray (8) eight 4-inch ramekins with oil.', 'In a large bowl combine the strawberries, honey and orange juice in large bowl, sprinkle with cornstarch and toss until fruit is coated.', 'Transfer to the ramekins.', 'Combine the remaining nut topping ingredients in a medium bowl with a fork and sprinkle over the fruit.', 'Bake 40 minutes or until the top is golden and the berries are soft and bubbly.', 'Serve warm, with 1 tablespoon of ice cream or whipped cream, if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/03/strrawberry-crisp-1-3.jpg",
    "ingredients": "['cooking spray', '5 cups fresh strawberries (stemmed and quartered)', '1/4 cup honey', '1 tablespoon fresh orange juice', '1 tablespoon cornstarch (or arrowroot for Paleo)', '1/2 cup sliced almonds', '1/4 cup chopped pecans', '1/4 cup walnuts', '1/4 cup almond flour', '2 tablespoons honey', '1/8 teaspoon kosher salt']",
    "recipe_name": "Strawberry Crisp"
  },
  {
    "cooking_method": "['Toss all the ingredients in a medium bowl.', 'Serve or store in refrigerator for the week.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/02/Chickpea-Egg-Salad-1-5.jpg",
    "ingredients": "['2 15 ounce cans chickpeas (I use Goya rinsed and drained)', '6 large hard boiled eggs (sliced crosswise)', 'kosher salt and black pepper (to taste)', '2 tablespoons chopped red onion', '2 tablespoons extra virgin olive oil', '2 tablespoons apple cider vinegar (I use Braggs)', '1 tablespoon chopped fresh cilantro or parsley']",
    "recipe_name": "Chickpea Egg Salad"
  },
  {
    "cooking_method": "['Preheat the oven to 450F. Place a silicone liner on a large baking sheet or spray with oil if using parchment.', 'In a medium bowl combine the flour, baking powder and salt and whisk well.', 'Add the yogurt and mix with a fork or spatula until well combined, it will look like small crumbles.', 'Lightly dust flour on a work surface and remove dough from the bowl, knead the dough a few times until dough is tacky, but not sticky, about 20 turns (it should not leave dough on your hand when you pull away).', 'Divide into 4 equal balls about 3-3/8 oz each.', 'Sprinkle a work surface and rolling pin with a little flour roll the dough out into thin ovals 7 to 8 inches in diameter and place on the prepared baking sheet.', 'Top with spinach, mozzarella and tomatoes, leaving the center open for the egg. Gently break an egg the center of each dough and finish with bacon.', 'Bake 10 to 12 minutes, until the crust is golden and the egg is set. Season with salt and pepper.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/02/breakfast-pizza-1-6.jpg",
    "ingredients": "['1 cup 5 oz all purpose or white whole wheat flour*', '1 1/2 teaspoons baking powder', '1/2 teaspoon kosher salt', '1 cup non-fat Greek yogurt (not regular, drained if theres any liquid)', 'handful baby spinach', '2 ounces 1/2 cup shredded mozzarella cheese', '8 cherry tomatoes (sliced)', '4 large eggs', '2 strips cooked center cut bacon (chopped)']",
    "recipe_name": "Breakfast Pizza Recipe"
  },
  {
    "cooking_method": "['Combine all the ingredients, adjust the vinegar and brine to your taste.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2018/02/Chickpea-Tuna-Salad-1.jpg",
    "ingredients": "['15 ounce can chickpeas (rinsed and drained)', '6 ounce can wild albacore tuna (drained (I like American Tuna))', '1 to 2 tablespoons chopped red onion', '2 tablespoons capers (plus 2 tablespoons of the brine)', '2 tablespoons red wine vinegar', 'chopped lettuce (optional)']",
    "recipe_name": "Chickpea Tuna Salad"
  },
  {
    "cooking_method": "['In a medium bowl, combine mayonnaise, Thai sweet chili sauce and Sriracha. Set aside.', 'Combine lettuce and cabbage and divide between four plates. Set aside.', 'Coat shrimp with cornstarch, mixing well with your hands.', 'Heat a large skillet or wok on high heat, when hot add oil. When oil is hot add the shrimp to hot pan and cook tossing a few times until cooked through, about 3 minutes.', 'Remove from pan and combine with the sauce coating well.', 'Place shrimp on lettuce and top with scallions.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2011/05/Banging-Good-Shrimp-1-4.jpg",
    "ingredients": "['5 tbsp light mayonnaise', '3 tbsp Thai Sweet Chili Sauce', '1 tsp Sriracha (to taste)', '1 lb large shrimp (shelled and deveined (weight after peeled))', '2 tsp cornstarch', '1 tsp canola oil', '3 cups shredded iceberg lettuce', '1 cup shredded purple cabbage', '4 tbsp scallions (chopped)']",
    "recipe_name": "Bangin Good Shrimp"
  },
  {
    "cooking_method": "['Preheat the oven to 425.', 'In a heavy-bottomed saute pan melt the butter over medium heat. Add the onions and saute until translucent, about 10 - 12 minutes.', 'Add the flour and nutmeg; cook 2 more minutes, stirring occasionally.', 'Add the milk and cook until thickened, about 5 - 7 minutes.', 'Squeeze as much liquid as possible from the spinach and add the spinach to the sauce.', 'Add 1/2 cup of the Parmesan cheese and mix well. Season to taste, with salt and pepper.', 'Transfer the spinach to a large baking dish and sprinkle the remaining 1/4 cup Parmesan and the Swiss cheese on top. Bake for 20 minutes until hot and bubbly. Serve hot.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2011/10/Makeover-Spinach-Gratin-1-4.jpg",
    "ingredients": "['3 tbsp whipped butter (I used Land O Lakes)', '1 cup finely chopped onion', '1/4 cup flour (use Gluten free AP flour for GF)', '1/4 tsp fresh grated nutmeg', '3 cups 2% milk', '3 lbs 3 16-oz packages frozen chopped spinach, defrosted', '3/4 cup freshly grated Parmesan cheese', '1 tbsp kosher salt', '1/2 tsp freshly ground black pepper', '1/2 cup shredded Swiss or Gruyere cheese']",
    "recipe_name": "Makeover Spinach Gratin"
  },
  {
    "cooking_method": "['Press saute on the Instant Pot, saute the pancetta over low heat until the fat melts, about 4-5 minutes.', 'Add the butter, onion, celery and carrots and cook until soft, about 6 to 8 minutes.', 'Add the meat and season it with 3/4 teaspoons salt and black pepper to taste and saute until browned, about 4 to 5 minutes, breaking the meat up into smaller pieces with a wooden spoon as it cooks.', 'Add the wine and cook until it reduces down, about 3-4 minutes.', 'Add crushed tomatoes, bay leaves, 3/4 teaspoon salt and fresh cracked black pepper; cover and cook high pressure 15 minutes.', 'Natural release, stir in the half  half and garnish with parsley; serve over your favorite pasta, zucchini noodles or spaghetti squash.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/11/instant-pot-bolognese-1-8.jpg",
    "ingredients": "['4 ounces pancetta (or center cut bacon, chopped)', '1 tablespoon unsalted butter', '1 large white onion (minced)', '2 celery stalks (about 3/4 cup, minced)', '2 carrots (about 3/4 cup, minced)', '2 lb lean ground beef', '1/4 cup dry white wine (such as Pinot Grigio)', '2 28 oz cans crushed tomatoes (I love Tuttorosso)', '3 bay leaves', '1/2 teaspoon kosher salt and fresh black pepper (to taste)', '1/2 cup half &amp; half cream', '1/4 cup chopped fresh parsley']",
    "recipe_name": "Instant Pot Bolognese"
  },
  {
    "cooking_method": "['Preheat oven to 400F. Spray an 8\"x12\" gratin dish or casserole with olive oil. Add the brussels sprouts and season with salt and pepper. Spray more olive oil over the brussels and place in the lower third of the oven. Bake 15 minutes, toss and bake an additional 10 minutes.', 'Meanwhile, heat a medium nonstick pan over medium heat. Add butter and let it melt, add the shallots and cook until softened, about 4 to 5 minutes. Sprinkle the flour over the shallots to make a roux, whisking for 1 to 2 minutes. Add the milk and stir with a wooden spoon until the roux is incorporated into the milk. Cook over medium-low heat for about 4 minutes, stirring, until the sauce thickens. Add fresh thyme, parmesan and half of the grated Gruyere cheese into the white sauce and stir until the cheese is melted and incorporated into the sauce.', 'Pour over the brussels sprouts, and top with the remaining cheese. Bake for 15 minutes until top is lightly browned and bubbly.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/11/brusselssproutsgratin.jpg",
    "ingredients": "['16 oz brussels sprouts (trimmed of outer leaves and sliced in half)', '1/4 tsp kosher salt', 'black pepper (to taste)', 'olive oil spray', '1/2 tbsp butter', '1/3 cup chopped shallots', '2 tsp all purpose flour (or gluten free flour for GF)', '3/4 cup fat free milk', '1/4 tsp kosher salt', '1 tsp fresh thyme', '1 tbsp grated parmesan cheese', '2 oz grated Gruyere cheese (divided)']",
    "recipe_name": "Brussels Sprouts Gratin"
  },
  {
    "cooking_method": "['Preheat the oven to 400F.', 'Finely chop half of the Cremini mushrooms and transfer to a medium bowl with the ground chicken, breadcrumbs, Pecorino, egg, 1 clove of the minced garlic, parsley, 1 teaspoon kosher salt and black pepper, to taste.', 'Gently shape into 25 small meatballs, bake 15 to 18 minutes, until golden.', 'In a small bowl whisk the flour with the Marsala wine and broth.', 'Heat a large skillet on medium heat.', 'Add the butter, garlic and shallots and cook until soft and golden, about 2 minutes.', 'Add the mushrooms, season with 1/8 teaspoon salt and a pinch of black pepper, and cook, stirring occasionally, until golden, about 5 minutes.', 'Return the meatballs to the pot, pour the Marsala wine mixture over the meatballs, cover and cook 10 minutes.', 'Garnish with parsley.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/10/Chicken-Marsala-Meatballs-1-3.jpg",
    "ingredients": "['8 ounces sliced cremini mushrooms (divided)', '1 pound 93% lean ground chicken', '1/3 cup whole wheat seasoned or gluten-free bread crumbs', '1/4 cup grated Pecorino cheese', '1 large egg (beaten)', '3 garlic cloves (minced)', '2 tablespoons chopped fresh parsley (plus more for garnish)', '1 teaspoon Kosher salt', 'Freshly ground black pepper', '1/2 tablespoon all-purpose flour', '1/2 tablespoon unsalted butter', '1/4 cup finely chopped shallots', '3 ounces sliced shiitake mushrooms', '1/3 cup Marsala wine', '3/4 cup reduced sodium chicken broth']",
    "recipe_name": "Chicken Marsala Meatballs"
  },
  {
    "cooking_method": "['In a large skillet over medium heat, saute the onion, garlic and jalapeno in oil until soft. Add the tomatoes and cook until thickened 3 to 4 minutes. Add the shrimp and 1/4 teaspoon salt and cilantro and cook medium high heat 1 minute.', 'Preheat the oven to 400F. Line 2 large nonstick baking sheets with foil and spray with oil.', 'Working in batches, place 3 to 4 tortillas between two paper towels and microwave 30 seconds until they are warm and pliable. Place a tortilla on a clean, dry work surface and then spread about 3 tablespoons of shrimp filling onto the bottom third of the tortilla and top with 1 tablespoon of cheese. Roll the tortilla up from the bottom to surround the filling and once its rolled into a tube, place it on the prepared baking sheet, seam side down. Repeat with the remaining shrimp, spray the tops with oil a pinch of salt then bake until tortillas start to get golden and crispy, about 15 minutes.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/05/Shrimp-Taquitos-1-3.jpg",
    "ingredients": "['1/2 onion (finely chopped)', '2 cloves garlic (minced)', '1 jalapeno (minced)', '1 teaspoon olive oil', '1 vine tomato (diced)', '12 ounces raw (peeled and deviened shrimp, chopped)', 'kosher salt', '2 tablespoons finely chopped cilantro', '3/4 cup shredded pepperjack cheese', '12 6-inch corn tortillas', 'olive oil spray (I use my Misto)', 'jarred or homemade salsa verde (optional for dipping)', 'guacamole (optional for dipping)']",
    "recipe_name": "Baked Shrimp Taquitos"
  },
  {
    "cooking_method": "['Preheat the broiler. Rinse and dry the tomatillos. Line a broiler pan with foil and arrange the tomatillos on the foil along with the poblano and serrano chill peppers. Broil until they are charred on top, about 3 minutes. Use tongs to turn and broil the other sides until charred, 3 to 4 minutes.', 'Wrap the tomatillos and chillies in foil and let them rest for 10 minutes. Unwrap the tomatillos and chillies and peel the skin off the poblano chilli and remove the seeds. The tomatillos and serrano chilli dont need to be peeled or seeded.', 'Place the tomatillos and chillies into the bowl of a food processor. Add the garlic, sugar and salt. Pulse the mixture until the ingredients are coarsely chopped.', 'Add 5 to 6 tablespoons of water, the onion, and cilantro. Pulse quickly until a coarse puree forms then transfer the salsa to a serving dish. Makes about 1 3/4 cup.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/01/Salsa-Verde-1-4.jpg",
    "ingredients": "['3/4 lb tomatillos (husks removed)', '1 poblano chilli', '1 serrano chili (or jalapeno for milder)', '1 clove garlic (crushed)', '2 tbsp chopped onion', '2 tbsp chopped cilantro', '1/4 teaspoon sugar', '1 tsp kosher salt']",
    "recipe_name": "Salsa Verde"
  },
  {
    "cooking_method": "['In a bowl combine the kale, olive oil, vinegar and 1/4 teaspoon salt. Massage with your hands for about 3 minutes, until the kale softens.', 'Cook eggs to desired likeness, I prefer them soft boiled. How to Make Perfect Eggs in the Instant Pot.', 'Divide the kale between two bowls, top with bacon, tomatoes, avocado and egg.', 'Finish with pinch of salt and pepper.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/04/Breakfast-BLT-Salad-1-2.jpg",
    "ingredients": "['3 cups shredded Lacinto kale (no stems)', '1 teaspoon red wine vinegar', '2 teaspoons extra virgin olive oil', 'kosher salt', 'black pepper (to taste)', '2 large eggs', '4 strips cooked center cut bacon (chopped)', '2 ounces sliced avocado', '10 grape tomatoes (halved)']",
    "recipe_name": "Breakfast BLT Salad"
  },
  {
    "cooking_method": "['In a medium bowl combine all the ingredients and gently fold until mixed well.', 'Serve immediately or cover tight and refrigerate for up to a day.', 'If you let it marinate, you may need to add another splash of soy sauce to taste.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/03/poke-1-3.jpg",
    "ingredients": "['1 lb sushi grade tuna (cut into 3/4 inch cubes)', '1/4 cup thin sliced onions', '1/2 cup sliced scallions (green parts only)', '2 tbsp reduced sodium soy sauce* (use coconut aminos for Whole30/Paleo)', '1 teaspoon sesame oil', '1/2 teaspoon sambal oelek or sriracha']",
    "recipe_name": "Shoyu Ahi Poke"
  },
  {
    "cooking_method": "['Pat shrimp dry with a paper towel and place in a food processor fitted with a metal blade. Pulse until shrimp are finely chopped. Transfer shrimp to a medium bowl and add 3 tablespoons of panko, red onion, red pepper, celery, parsley, mayo, mustard, egg, lemon juice, old bay, garlic powder and pepper. Mix gently.', 'On a small plate, combine 1 cup panko with 14 teaspoon of salt and pepper. Using a 1/3 cup measuring cup, scoop shrimp mixture and using your hands, for mixture into a 1-inch patty. Place patty on the plate with panko and evenly coat with panko mixture. With a large spatula, carefully transfer shrimp cake to a plate (you may have to re-form the cake a bit). Repeat with remaining mixture. You should end up with 8 patties.', 'In a large skillet over medium-high heat, add 1 tablespoon of oil. When oil is hot, add 4 patties, evenly spacing them apart. Cook for 3 minutes, carefully flip with the spatula and cook an additional 2-3 minutes. Place cooked cakes on a plate, add remaining tablespoon of oil and repeat the process with the last 4 cakes.', 'Place 2 shrimp cakes on 4 plates, sprinkle with parsley and serve with lemon wedges and hot sauce (if using).']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/03/Shrimp-Cakes-1-2.jpg",
    "ingredients": "['1 pound peeled and deveined jumbo shrimp (tails removed)', '1 cup plus 3 tablespoons whole wheat plain panko (or gluten-free)', '14 cup red onion (finely diced)', '1/4 cup finely diced red bell pepper', '1/4 cup finely diced celery', '2 tablespoons chopped fresh parsley', '1 tablespoons light mayonnaise', '1 teaspoon Dijon mustard', '1 large egg', '2 tablespoon fresh lemon juice', '3/4 teaspoon Old Bay seasoning', '12 teaspoon garlic powder', 'Freshly ground black pepper (to taste)', '14 teaspoon kosher salt', '2 tablespoons olive oil', 'lemon wedges (for serving)', 'hot sauce (for serving (optional))']",
    "recipe_name": "Shrimp Cakes"
  },
  {
    "cooking_method": "['Mash the avocado in a small bowl with the tomato, red onion, cilantro, lime juice, salt, pepper to taste.', 'Season scallops with salt and black pepper. Add the butter and oil to a 12-inch skillet on high heat. Once the butter begins to smoke, gently add the scallops, making sure they are not touching each other. Sear the scallops for 1 1/2 minutes on each side. The scallops should have a 1/4-inch golden crust on each side while still being translucent in the center.', 'Spoon the guacamole onto the tostada, top with scallops and drizzle with sour cream.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/02/Scallop-Tostadas-1-2.jpg",
    "ingredients": "['4 oz 1 small haas avocado', '1/4 cup diced tomato', '2 tablespoon diced red onion', '2 teaspoon lime juice', '2 teaspoon chopped cilantro', '1/2 teaspoon kosher salt', 'fresh black pepper (to taste)', '2 tablespoons light sour cream (thinned with 1 teaspoon fat-free milk)', '6 large sea scallops ((8 ounces total) side muscle removed, rinsed and pat dry)', '1/4 teaspoon kosher salt', 'black pepper (to taste)', '1 teaspoon unsalted butter', '1 teaspoon olive oil', '2 large corn tostada shells*', '*Read labels for gluten-free.']",
    "recipe_name": "Scallop Tostadas"
  },
  {
    "cooking_method": "['Marinate chicken in vinegar, soy sauce, garlic, jalapeno and pepper, for at least an hour (overnight is ideal).', 'Put chicken, 1/2 cup water, bay leaves and marinade into a deep nonstick skillet and cook on medium-low heat. Cover and cook until the meat is tender, about 45 minutes.', 'Remove the cover and cook an additional 15 minutes, until the sauce reduces.', 'Discard bay leaves and serve over rice if you wish.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2010/11/Filipino-Adobo-Chicken-1-3.jpg",
    "ingredients": "['8 skinless chicken drumsticks (on the bone)', '1/3 cup low sodium soy sauce (use gluten-free soy sauce for GF and coconut aminos for Paleo)', '1/3 cup apple cider vinegar', '1 small head of garlic (crushed)', '6 ground peppercorns', '4 bay leaves', '1 jalapeno (chopped (optional))']",
    "recipe_name": "Filipino Adobo Chicken"
  },
  {
    "cooking_method": "['In a medium saucepan, spray oil and saute garlic. Add chipotle chiles, chili powder, cumin, chicken broth, tomato sauce, salt and pepper. Bring to a boil. Reduce the heat to low and simmer for 5-10 minutes. Set aside until ready to use.', 'Preheat oven to 400 degrees.', 'Heat the vegetable oil in a medium skillet over medium-high heat. Saute onions and garlic on low until soft, about 2 minutes. Add chicken, salt, cilantro, cumin, oregano, chili powder, tomato sauce, chicken broth, and cook 4 to 5 minutes. Remove from heat.', 'Spray a 13 by 9-inch glass baking dish with non-stick spray. Put 1/3 cup chicken mixture into each tortilla and roll it.', 'Place on baking dish seam side down, top with sauce. Then top with cheese.', 'Cover with aluminum foil and bake in the oven on the middle rack for 20-25 minutes. Top with low fat sour cream or scallions if you wish. (Extra points) Makes 8 enchiladas.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2011/08/Gina-Skinny-Chicken-Enchiladas-4-3.jpg",
    "ingredients": "['2 garlic cloves (minced)', '1-2 tbsp chipotle chilis in adobo sauce', '1-1/2 cups tomato sauce', '1/2 tsp chipotle chili powder', '1/2 tsp ground cumin', '3/4 cup reduced sodium chicken broth', 'kosher salt and fresh pepper to taste', '1 tsp vegetable oil', '8.5 oz 2 breast halves cooked shredded chicken breast', '1 cup diced onion', '2 large clove garlic (minced)', '1/4 cup cilantro', 'kosher salt', '1 tsp cumin', '1/2 tsp dried oregano', '1 tsp chipotle chili powder', '1/3 cup chicken broth', '1/2 cup tomato sauce', '8 7-inch low-carb whole wheat flour tortillas ((la tortilla factory))', '1 cup shredded low fat Mexican cheese', 'non-stick cooking spray', '2 tbsp chopped scallions or cilantro for topping']",
    "recipe_name": "Chicken Enchiladas"
  },
  {
    "cooking_method": "['In a small bowl combine red onion, lime juice, olive oil, pinch of salt and pepper.', 'Let them marinate at least 5 minutes to mellow the flavor of the onion.', 'In a large bowl combine shrimp, avocado, tomato, cucumber, serrano pepper.', 'Combine all the ingredients together, add cilantro and gently toss.', 'Adjust salt and pepper to taste.', 'Fill nine martini glasses with shredded lettuce.', 'Top each with 1/2 cup shrimp salad and garnish with a sprig of cilantro.', 'Serve with a wedge of lime.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2012/12/Shrimp-Ceviche-Cocktail.jpg",
    "ingredients": "['1/4 cup chopped red onion', '2 small limes (squeezed)', '1 tsp olive oil', '1 lb large cooked, peeled shrimp', '1 medium hass avocado (diced into chunks)', '1 medium tomato (diced)', '1 cup diced English cucumber (not peeled)', '1 serrano pepper (seeds removed and minced)', '2 tbsp chopped cilantro (plus more for garnish)', 'salt and fresh black pepper to taste', '1 lime cut into wedges for serving', '2 1/4 cups shredded iceberg lettuce']",
    "recipe_name": "Shrimp Ceviche Cocktail"
  },
  {
    "cooking_method": "['LONGER METHOD: Preheat oven to 400°F.', 'Cut spaghetti squash in half lengthwise and scoop out seeds and membrane. Season lightly with salt and black pepper; bake about 1 hour, or longer if needed on a baking sheet, cut side down.', 'FASTER METHOD: If you prefer the microwave, stab the squash with a knife all around and place on a microwave safe dish. Microwave 7-9 minutes or the skin gives when cut with a knife.', 'Once cooked, use a fork to scrape the strands out into a bowl.', 'In a medium saute pan heat the oil over medium-low heat. Add the shallots, garlic, red onion, celery and carrots and cook 5 minutes, stirring.', 'Add the broccoli and zucchini and season with salt and pepper to taste.', 'Add the marinara sauce, increase heat to medium and simmer until the vegetables are tender crisp, about 3 to 4 minutes.', 'Add 2 cups of the spaghetti squash, Pecorino Romano and stir, adjust the salt and pepper to taste and cook 1 minute.', 'Divide the vegetables in two small casserole dishes, or you can use the shells of the spaghetti squash to make boats, then place under the broiler or in a hot oven until the cheese melts.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/12/spaghetti-squash-primavera.jpg",
    "ingredients": "[\"1 small spaghetti squash (you'll need 2 cups cooked)\", '1 tsp olive oil', '1 tbsp minced shallots', '1 clove garlic (crushed)', '1/4 cup red onion (diced)', '1/4 cup celery (diced)', '1/4 cup carrots (diced)', '1 cup broccoli florets', '1/2 cup diced zucchini', '2 cups homemade marinara sauce', '1/2 tbsp grated Pecorino Romano (or any good quality cheese)', '3 oz fresh mozzarella']",
    "recipe_name": "Spaghetti Squash Primavera"
  },
  {
    "cooking_method": "['Bring all the ingredients to a boil on high heat in a medium saucepan.', 'When boiling, reduce heat and simmer for about 15 minutes, or until the cranberries burst and the sauce thickens. Remove from heat and let it cool before refrigerating. Serve chilled or room temperature. Makes 3 1/4 cups.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2011/11/Cranberry-Pear-Sauce-2-copy.jpg",
    "ingredients": "['12 oz fresh or frozen cranberries', '2 ripe pears (peeled and cored, cubed small)', '1/2 cup honey or agave', '1 cup water']",
    "recipe_name": "Cranberry Pear Sauce"
  },
  {
    "cooking_method": "['Combine oil and lemon juice. Place a layer of zucchini to cover the bottom of a platter. Season with salt and pepper and drizzle with a little olive oil and lemon juice.', 'Repeat layering zucchini, salt, pepper, olive oil and lemon juice until all zucchini is used up. Let marinade for at least 10 minutes.', 'Right before serving, top with fresh arugula, shaved Parmesan and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2009/07/zucchini-carpaccio-3.jpg",
    "ingredients": "['2 medium zucchini (ends cut off and sliced 1/16th with mandolin)', '1/2 lemon', '4 tsp extra virgin olive oil', 'kosher salt (to taste and fresh black pepper)', '1 cup baby arugula', '1/4 cup shaved Parmesan']",
    "recipe_name": "Zucchini Carpaccio"
  },
  {
    "cooking_method": "['Heat the oil in a large skillet over medium-high heat. When hot, add the onions, tomatoes and jalapeno and saute until just tender, about 2-3 minutes. Add the garlic and cauliflower, saute until the cauliflower is just tender, 2 minutes.', 'Add the tomato paste, cumin, paprika, cayenne, salt and pepper. Stir to evenly coat the vegetables and cook for 1 minute or until heated through. Add chopped cilantro and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/06/Mexican-Cauliflower-Rice-6.jpg",
    "ingredients": "['4 cups cauliflower crumbles (the sell this in stop and shop now)', '1 teaspoon olive oil', '1/2 medium onion (finely diced)', '2 medium plum tomatoes (small dice)', '1 jalapeno (seeds and membrane removed, minced)', '2 garlic cloves (minced)', '2 tablespoons tomato paste', '12 teaspoon cumin', '14 smoked paprika', '14 teaspoon cayenne pepper', '1 teaspoon kosher salt', 'Freshly ground black pepper (to taste)', 'chopped cilantro']",
    "recipe_name": "Mexican Cauliflower \"Rice\""
  },
  {
    "cooking_method": "['Spread the toast with hummus, top with cucumber, radish and avocado, sprinkle crushed red pepper flakes, salt and black pepper. Top with arugula and lemon juice.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/06/Hummus-Avocado-Toast.jpg",
    "ingredients": "['2 oz these were 1 oz each sliced whole grain bread, toasted', '2 tbsp hummus', '6 thin cucumber slices', '1 small radish (sliced thin)', '1 oz avocado (sliced thin (from 1/4 small haas))', 'crushed red pepper flakes (to taste)', '1/8 tsp kosher salt', 'black pepper (to taste)', '1/4 cup baby arugula', '1 wedge fresh lemon']",
    "recipe_name": "Hummus Avocado Toast"
  },
  {
    "cooking_method": "['In a large bowl, combine the beans, tomatoes, garlic, onion, parsley, and mint.', 'For the dressing, in a small bowl, whisk the olive oil and lemon juice until smooth and emulsified.', 'Pour the dressing over the beans and veggies, add 12 teaspoon salt and black pepper to taste and carefully toss with a large metal spoon. Allow to sit at room temperature for 30 minutes so flavors combine.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/05/Mediterranean-Bean-Salad-6.jpg",
    "ingredients": "['1 15.5-ounce can garbanzo beans, drained and rinsed', '1 15-ounce can black beans, drained and rinsed', '1 cup chopped grape tomatoes', '1 large garlic clove (finely minced)', '12 cup chopped red onion', '14 cup chopped fresh parsley', '14 cup chopped fresh mint', '1 1/2 tablespoons olive oil', 'Juice from 1 medium lemon', '12 teaspoon kosher salt', 'Freshly ground black pepper']",
    "recipe_name": "Mediterranean Bean Salad"
  },
  {
    "cooking_method": "['Combine glaze ingredients together in a small bowl.', 'Preheat the broiler on high and position the rack 4 to 5 inches from the heat. Line the broiler pan with foil and spray lightly with oil.', 'Put the salmon on the prepared sheet and season with salt. Broil 2 minutes.', 'Brush the salmon with glaze and broil until desired doneness, 3 to 5 minutes depending on the thickness. Transfer to a platter and top with sesame seeds and scallions. Serve with rice if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/05/Gochujang-Glazed-Salmon-4.jpg",
    "ingredients": "['cooking spray', '1 lb 4- 4oz wild salmon filets', '1 tbsp gochujang', '2 tsp mirin', '2 tsp soy sauce', '2 tsp sugar', '1/2 tsp toasted sesame oil', '1 small cloves garlic (minced)', '1/2 tsp fresh ginger', 'scallions (sliced thin on an angle)', 'black sesame seeds']",
    "recipe_name": "Gochujang-Glazed Salmon"
  },
  {
    "cooking_method": "['Heat oven to 400F.', 'Lightly spray olive oil spray in a medium nonstick skillet and heat on a medium heat.', 'Add onion, garlic and cilantro and saute about 2 minutes, add ground turkey, salt, garlic powder, cumin and cook meat for 4 to 5 minutes until meat is completely cooked through.', 'Add 1/4 cup of tomato sauce and 1/2 cup of chicken broth, mix well and simmer on low for about 5 minutes.', 'Combine cooked rice and meat together.', 'Cut the bell peppers in half lengthwise, and remove all seeds. Spoon 2/3 cup meat mixture into each pepper half and place in a 9 x 13-inch baking dish. Top each with 1 tbsp cheese.', 'Pour the remainder of the chicken broth on the bottom of the pan. Cover tightly with aluminum foil and bake for about 45 minutes.', 'Carefully remove the foil and serve right away.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2008/11/turkey-stuffed-peppers-3.jpg",
    "ingredients": "['1 lb 93% lean ground turkey', '1 garlic (minced)', '1/4 onion (minced)', '1 tbsp chopped fresh cilantro or parsley', '1 tsp garlic powder', '1 tsp cumin powder', '1 tsp kosher salt', '3 large sweet red bell peppers (washed)', '1 cup reduced sodium chicken broth (divided)', '1/4 cup tomato sauce', '1 1/2 cups cooked brown rice', 'Olive oil spray', '6 tbsp part skim shredded cheddar cheese*']",
    "recipe_name": "Turkey Stuffed Peppers"
  },
  {
    "cooking_method": "['*If frozen, place edamame in a microwave-safe bowl and heat edamame for 2-3 minutes, or until defrosted.', 'In a small bowl, combine orange zest, cayenne, sesame seeds and black pepper. Set aside.', 'In a small sauce pot, bring soy sauce, chicken broth and honey to a slow boil over medium heat.', 'Continue to gently boil until sauce is reduced by half, about 5 to 6 minutes.', 'Meanwhile, heat a large non-stick skillet or wok over medium-high heat.', 'Add the oil, garlic and ginger and saute for 30 to 60 seconds.', 'Add edamame and orange peel/spice mixture and toss to evenly coat.', 'Add sauce to the edamame, toss and cook for an additional 2-3 minutes, or until sauce is slightly thickened and edamame is heated through.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/09/SpicyGarlicEdamame.jpg",
    "ingredients": "['1/2 tsp orange zest', '1/4 tsp cayenne pepper', '1 tbsp sesame seeds (toasted)', 'freshly ground pepper (to taste)', '1/4 cup reduced-sodium soy sauce (or gluten-free soy sauce)', '1/4 cup reduced-sodium chicken or vegetable broth', '1 tbsp honey', '2 tsp canola or vegetable oil', '4 cloves garlic (chopped)', '1 tsp grated ginger', '5 cups edamame (in pod*)']",
    "recipe_name": "Spicy Garlic Edamame"
  },
  {
    "cooking_method": "['In a large nonstick skillet, heat 1 teaspoon of oil over medium heat and saute the garlic until golden, about 1 minute.', 'Add the salt, black pepper, red pepper flakes, and parsley and stir. Add the tomatoes, chicken broth and bring to a boil.', 'Reduce heat, add the basil and simmer 5 minutes.', 'Gently drop in the eggs keeping the yolks in tact, top with 2 tbsp of the Parmigiano Reggiano and 1 tbsp of the Pecorino Romano.', 'Cover and simmer on medium-low 10 to 15 minutes, or until the eggs whites are cooked through and no longer runny.', 'Finish with the remainder of the cheese and drizzle with olive oil. Serve with crusty bread (optional)']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/09/EggsPizzaiola.jpg",
    "ingredients": "['1 1/2 tsp olive oil', '4 cloves garlic (chopped)', '1/4 tsp kosher salt', '1/4 tsp crushed red pepper', 'fresh black pepper (to taste)', '1 tbsp chopped fresh parsley', '1/4 cup reduced sodium chicken or vegetable broth', '2 cups crushed tomatoes (I used Tutorrosso)', '4 basil leaves (torn)', '6 large eggs', '4 tbsp shredded Parmigiano Reggiano', '2 tbsp grated Pecorino Romano']",
    "recipe_name": "Eggs Pizzaiola"
  },
  {
    "cooking_method": "['Place the apples in a slow cooker. Top with sugar, brown sugar, cinnamon, allspice and nutmeg and mix well.', 'Cover and cook high 5 hours, or low 10 hours, stirring once halfway, until the apples are tender and dark brown.', 'Uncover and puree with an immersion blender.', 'Cook on high uncovered 2 hours, stirring occasionally, until thickened.', 'Spoon into jars or containers, cover and refrigerate.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/09/SlowCookerAppleButter.jpg",
    "ingredients": "['6 large apples (peeled, cored, finely chopped (honeycrisp, gala, ambrosia))', '1/3 cup raw sugar', '1/2 cup light brown sugar (not packed)', '1 tsp ground cinnamon', '1/8 tsp allspice', '1/8 tsp nutmeg']",
    "recipe_name": "Crockpot Apple Butter"
  },
  {
    "cooking_method": "['Place a can of coconut milk in the refrigerator without shaking or moving it overnight.', 'Open the can without shaking and spoon out the thick cream at the top of the can, transfer to a medium mixing bowl and discard the liquid left behind.', 'Add the sugar and whip using a hand mixer until creamy and thick, about 1 minute on high.', 'Refrigerate until ready to use, best if used within 2 hours.', 'If it stays longer and hardens, whip it once again.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/08/WhippedCoconutCream.jpg",
    "ingredients": "['1 13.6 ounce can unsweetened coconut milk', '3 tablespoons powdered sugar']",
    "recipe_name": "Whipped Coconut Cream"
  },
  {
    "cooking_method": "['Instant Pot:', 'Press the saute button on the Instant Pot. Spray with oil then add the beef and salt, cook breaking the meat up until browned, about 5 minutes. Add the onion, garlic, marjoram and black pepper and stir. Add the tomato sauce, paprika, beef broth and raisins, cover and cook high pressure 15 minutes.', 'Quick release, add the rice and cabbage and cook 3 minutes high pressure. Quick release and serve with additional rice if desired.', 'Stove Top Directions:', 'Heat a large pot or Dutch oven over medium-high heat, spray with oil then add the beef and salt, cook breaking the meat up until browned, about 5 minutes. Add the onion, garlic, marjoram and black pepper and stir. Add the tomato sauce, 1/4 cup water, paprika, beef broth and raisins, cover and cook medium-low 25 minutes.', 'Add the cooked rice and cabbage and cook 8 to 10 minutes, or until the cabbage is tender. Serve with additional rice if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/02/UnStuffed-Cabbage-Bowls-1.jpg",
    "ingredients": "['cooking spray', '1 lb 93% lean ground beef', '1 1/4 teaspoon kosher salt', '1 cup chopped onion', '1 clove garlic (minced)', '1 tablespoon dried marjoram', 'black pepper (to taste)', '8 ounce can tomato sauce', '1/2 teaspoon Hungarian paprika', '1 cup less sodium beef broth', '2 tablespoons raisins', '1 cup cooked brown rice', '1 medium head cabbage (cored and chopped (9 cups))']",
    "recipe_name": "Un-stuffed Cabbage Bowls"
  },
  {
    "cooking_method": "['Using your hands, gently mix together the beef, bacon, mustard, salt, onion powder and pepper.', 'Form into 30 (golf ball size) meatballs.', 'Heat a grill or grill pan to high heat and grill 3 minutes on each side, or until your desired doneness.', 'Place on skewers with lettuce, pickles and tomatoes and serve with ketchup and mustard for dipping.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/02/burger-bites-4.jpg",
    "ingredients": "['2 lbs 93% beef', '4 oz center cut raw bacon (minced)', '2 tbsp prepared mustard', '1/2 tsp kosher salt', '1/2 tsp onion powder', '1/4 tsp black pepper', '1 head butter lettuce', '30 cherry tomatoes', '30 dill pickle chips or slices', 'ketchup (mayo and/or mustard optional for serving)']",
    "recipe_name": "Burger Bites"
  },
  {
    "cooking_method": "['Preheat the oven to 375F.', 'Combine all the ingredients in a medium bowl.', 'Place in an oven-proof dish and bake at 375 for 20-25 minutes, until hot and cheese is melted.', 'Serve right away.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2010/12/Hot-Spinach-Dip-1.jpg",
    "ingredients": "['10 oz frozen chopped spinach (thawed and excess liquid squeezed out)', '1/2 cup light sour cream', '5 tbsp light mayonnaise', '1/3 cup Parmigiano Reggiano', '1/4 cup scallion (chopped)', '1 clove garlic (crushed)', '1 cup 4 oz shredded part-skim mozzarella cheese', 'fresh pepper to taste']",
    "recipe_name": "Hot Spinach Dip"
  },
  {
    "cooking_method": "[\"Mix all dry ingredients in a bowl. Add wet ingredients to the mixing bowl and mix well with a spoon until there are no more dry spots; don't over-mix.\", 'Heat a large skillet on medium heat. Lightly spray oil to coat and pour 1/4 cup of pancake batter. When the pancake starts to bubble, you may add your fruit if you wish. When the bubbles settle and the edges begin to set, flip the pancakes. Repeat with the remainder of the batter. Makes 14 pancakes.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2011/08/Gina-Whole-Wheat-Pancakes-2.jpg",
    "ingredients": "['2 cups white whole wheat flour (I use King Arthur)', '4 1/2 tsp baking powder', '1/2 tsp kosher salt', '2 tsp ground cinnamon', '2 tsp sugar', '2 large eggs', '2 cups + 2 tbsp fat free milk', '2 tsp vanilla extract', 'cooking spray']",
    "recipe_name": "Whole Wheat Pancakes"
  },
  {
    "cooking_method": "['Bring a large pot of salted water to a rolling boil.', 'Add broccoli and boil for 1 minutes.', 'Drain and immediately place broccoli in a large bowl of ice water to stop it from cooking.', 'In a small bowl add orange juice, soy sauce, orange zest and cornstarch, whisking until cornstarch is dissolved.', 'Heat a non-stick wok or large deep skillet over high heat.', 'Add sesame oil, scallions, garlic and ginger and saute for 30 seconds.', 'Add the sauce and broccoli and saute 1 to 2 minutes, until the broccoli is crisp tender. Sprinkle with sesame seeds and red pepper flakes (if using).', 'Serve immediately.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/01/sesameorangebroccoli-4.jpg",
    "ingredients": "['kosher salt', '12 oz broccoli (cut into florets)', '1/2 tablespoon corn starch', '1/4 cup fresh orange juice', '1/4 teaspoon orange zest', '2 tbsp reduced sodium soy sauce', '1/2 teaspoon grated ginger', '1 garlic clove (finely minced)', '1/2 teaspoon sesame oil', '1 scallion (chopped)', '1/2 teaspoon sesame seeds', 'Red pepper flakes (to taste (optional))']",
    "recipe_name": "Sesame Orange Broccoli"
  },
  {
    "cooking_method": "['Press saute button, when hot brown meat and season with salt and pepper. Use a wooden spoon to break the meat up into small pieces until no longer pink.', 'Add onion, garlic, tomato, salt, pepper and cilantro and stir 1 minute, add alcaparrado or olives and about 2 tbsp of the brine (the juice from the olives, this adds great flavor) cumin, and bay leaf. Add tomato sauce and 3 tablespoons of water and mix well. Cover and cook high pressure 15 minutes. Natural or quick release and enjoy!']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2017/01/Instant-Pot-Picadillo-2.jpg",
    "ingredients": "['1-1/2 lb 93% lean ground beef', '1/2 large chopped onion', '2 cloves garlic (minced)', '1 to mato (chopped)', '1 teaspoon kosher salt', '1/2 red bell pepper (finely chopped)', '2 tbsp cilantro', '4 oz 1/2 can tomato sauce (I like Goya)', '1 tsp ground cumin', '1-2 bay leaf', '2 tbsp alcaparrado (capers or green olives would work too)']",
    "recipe_name": "Instant Pot Picadillo"
  },
  {
    "cooking_method": "['Preheat the oven to 450F. Spray the large rimmed baking sheet with olive oil.', 'In a shallow bowl, beat the eggs. In another shallow bowl, combine the breadcrumbs, Parmesan, salt, and pepper. Set half the breadcrumb mixture aside in a separate bowl.', 'Designate one hand as your wet hand (for the eggs) and one as your dry hand (for the breadcrumbs). Using your wet hand, drop some cauliflower pieces into the egg mixture and coat them evenly. Shake off any excess egg, then drop the coated pieces into the breadcrumb mixture. Using your dry hand, sprinkle some breadcrumbs on top and roll them around until evenly coated. Transfer the coated pieces to the prepared baking sheet and repeat with the rest of the cauliflower (when you run out of breadcrumbs, use the second bowlthis keeps the crumbs from getting too soggy).', 'Spray the top of the cauliflower pieces with a light coating of oil. Bake until the pieces can easily be pierced with a fork, about 20 minutes, flipping the pieces over halfway through. Serve warm.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/11/Cauliflower-Nuggets-2.jpg",
    "ingredients": "['olive oil spray', '30 cauliflower florets (24 oz)', '3 large eggs', '1 1/4 cups finely ground whole wheat bread crumbs', '1/3 cup fresh grated parmesan cheese', '1/2 tsp kosher salt', 'black pepper (to taste)']",
    "recipe_name": "Cauliflower Nuggets"
  },
  {
    "cooking_method": "['Preheat oven to 400 degrees.', 'Slice butternut squash into 1/4-inch thick slices. You can do this with a knife, I did this with my spiralizer which is much easier, click here for directions.', 'In a large bowl, combine the milk, garlic, shallot, thyme, 12 of the parmesan, 12 teaspoon salt and pepper. Add the squash and toss to coat. Spray a medium oven-safe casserole dish with cooking spray. Transfer squash mixture to casserole dish and set aside.', 'In a medium microwave safe bowl, melt butter. Add breadcrumbs, remaining parmesan, 14 teaspoon salt, and pepper. Evenly spread breadcrumb mixture over squash, cover with foil and bake for 45 minutes. Uncover and broil 2-3 minutes to brown top (watch carefully because it browns quickly!)']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/10/Butternut-Squash-Gratin-5.jpg",
    "ingredients": "['2 pound 1 medium butternut squash, peeled', '12 cup 2% reduced fat milk', '2 garlic cloves (minced)', '1 small shallot (minced)', '1 tablespoon chopped fresh thyme', '1/3 cup fresh grated parmesan cheese', '34 teaspoons kosher salt (divided)', 'Freshly ground black pepper (to taste)', 'Cooking spray', '2 tablespoons unsalted butter', '12 cup whole wheat or gluten-free panko']",
    "recipe_name": "Butternut Squash Gratin"
  },
  {
    "cooking_method": "['To melt chocolate, in a small bowl microwave 30 seconds, stir, repeat until melted. To melt peanut butter, microwave in a small bowl 30 seconds. Transfer to ziplock bags if you wish for easier piping, or you can use a spatula or spoon to drizzle it over the apples.', 'Slice the apples into 12 1/4-inch thick slices. Using a 1-inch round cookie cutter, core the apple slices (or you can use a knife).', 'Place the apple slices on wax paper and drizzle with your favorite toppings. Eat right away.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/09/Apple-Dounuts-6.jpg",
    "ingredients": "['3 to 4 tart green apples', '1/4 cup melted milk chocolate*', '1/4 cup melted peanut butter or 1/4 cup melted white chocolate*', 'optional toppings: sprinkles (mini chocolate chips, toasted coconut, craisins, nuts, granola)']",
    "recipe_name": "Donut-Shaped Apple Snacks"
  },
  {
    "cooking_method": "['In a large deep nonstick skillet, brown the sausage breaking the meat up with a wooden spoon until cooked, about 5 minutes. Add onions and garlic and cook until soft, about 2 minutes. Add tomatoes, basil, and black pepper. Simmer on low, covered 15 to 20 minutes.', 'Meanwhile, slice butternut into 1/8 thick rounds with a good quality spiralizer such as the Inspiralizer with Blade A. To do this, you have to slice the butternut lengthwise halfway through to the center, careful not to cut deeper than that. You can also use a mandolin (be careful) or a sharp knife.', 'Preheat oven to 375F.', 'In a medium bowl combine ricotta cheese, parmesan cheese, parsley and egg, mix.', 'In a deep 912 casserole dish spread 3/4 cup of sauce on the bottom and layer 12 rounds of butternut slices to cover. Spread 3/4 cup of the ricotta cheese mixture, then top with 1 cup of the mozzarella cheese and 1 cup sauce. Second Layer: Lay 12 more rounds of butternut, 3/4 cup ricotta mixture, 1 cup mozzarella and 1 cup sauce. Third Layer: 12 slices butternut, 1 1/2 cups sauce and cover with foil.', 'Bake covered 30 minutes.', 'Remove foil, cook uncovered 30 minutes (this helps dry out excess moisture). Top with remaining cheese and bake until the cheese is melted and bubbling, 5 minutes.', 'Let stand about 5 10 minutes before serving.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/09/Noodles-less-Butternut-Squash-Lasagna-7.jpg",
    "ingredients": "['14 oz Italian chicken sausage (casing removed (Al Fresco))', '1 tsp olive oil', '1/2 large onion (chopped)', '3 cloves garlic (minced)', '1 28 oz can crushed tomatoes (tuttorosso)', '2 tbsp chopped fresh basil', 'black pepper (to taste)', '1 large butternut (peeled (3 lbs))', '1 cup part-skim ricotta', '1/4 cup Parmigiano Reggiano', '2 tbsp chopped parsley', '1 large egg', '16 oz 4 cups shredded part-skim mozzarella cheese']",
    "recipe_name": "Noodle-less Butternut-Sausage Lasagna"
  },
  {
    "cooking_method": "['Pierce potatoes with a fork; microwave on high for 5 minutes turn over and microwave another 3 - 5 minutes, until tender. Or if you prefer to use your oven, bake at 400F for 1 hour or until tender. Cool. Peel potatoes.', 'Meanwhile, steam cauliflower with water in a large covered pot until tender. Drain and return to pot.', 'On medium heat, add chicken broth, milk, potatoes and bring to a boil.', 'Use an immersion blender to puree until smooth. Add sour cream, half the chives, salt and pepper and cook on low another 5-10 minutes, stirring occasionally.', 'Remove from heat. Ladle 1 cup soup into each bowl.', 'Top each serving with 2 tbsp cheese, remaining chives, and bacon.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2011/02/Baked-Potato-Soup-2.jpg",
    "ingredients": "['2 medium russet potatoes (washed and dried)', '1 small head of cauliflower (3 1/2 cups or 16 ounces, stem removed cut into florets)', '1 1/2 cups fat free chicken broth', '1 1/2 cups 1% reduced-fat milk', 'salt and freshly cracked black pepper', '1/2 cup light sour cream', '10 tbsp reduced-fat shredded sharp cheddar cheese', '6 tbsp chopped chives (divided)', '3 slices bacon (cooked and crumbled (you can use turkey bacon if you prefer))']",
    "recipe_name": "Baked Potato Soup"
  },
  {
    "cooking_method": "['Preheat the broiler to high and adjust the rack second from the top. Arrange the tomatoes on a baking tray, season with salt and pepper.', 'Combine the tuna salad ingredients in a small bowl.', 'Top each with 1/4 cup tuna salad and a slice of cheese. Broil the tomatoes until the cheese is melted, about 1 to 2 minutes. Remove from the oven and eat immediately.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/08/Tomato-Tuna-Melts-9.jpg",
    "ingredients": "['1 can (5 oz solid white tuna in water, slightly drained)', '2 tbsp light mayo', '3 tbsp finely chopped celery', '1 tbsp finely chopped red onion', '1 tsp red wine vinegar', '2 ripe tomatoes (halved)', '4 slices Cheddar cheese (2 1/2 oz total)']",
    "recipe_name": "Tomato Tuna Melts"
  },
  {
    "cooking_method": "['Preheat oven to 350 degrees.', 'Slice off the bottom of the stems; then, use a moist paper towel to gently remove any dirt from mushrooms.', 'Quarter or halve the mushrooms, depending on the size.', 'Sprinkle water in the bottom of a 13 x 9 baking dish then place mushrooms in a single layer on top of the water.', 'In a small bowl combine next six ingredients: breadcrumbs through salt/pepper. Sprinkle mixture evenly on top of the mushrooms.', \"Drizzle evenly with olive oil then spray the top with olive oil spray so it's evenly coated. Bake uncovered until the mushrooms are golden, about 20 minutes. Serve hot or warm.\"]",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/08/Unstuffed-Mushrooms.jpg",
    "ingredients": "['1 pound white button mushrooms', '2 tablespoons water', '1 4 cup dried Italian-style breadcrumbs', '2 tablespoons Parmigiano Reggiano cheese (grated)', '2 tablespoons Italian parsley (minced)', '1 4 teaspoon thyme (fresh or dried)', '1 clove garlic (minced)', '1/4 teaspoon kosher salt', 'black pepper to taste', '2 tbsp olive oil to drizzle', 'olive oil spray']",
    "recipe_name": "Dina's Tossed Mushrooms"
  },
  {
    "cooking_method": "['Place potatoes in a large pot of salted water and bring to a boil. Boil for 10-15 minutes, or until fork tender. Drain and set aside to cool.', 'Meanwhile, in a small bowl, combine the yogurt, mayonnaise, mustard, 1 teaspoon dill, pinch of salt and pepper. Set aside.', 'When potatoes are cool enough to handle, set aside half. Peel the other half by gently pinching the skin and pulling it away. Place peeled potatoes in a medium bowl and mash with a potato masher. Dice the remaining potatoes into 1-inch cubes and add to the bowl with the mashed potatoes.', 'Add pickle, celery, 1/4 teaspoon salt, pepper, and all but 1 tablespoon of the green onion. Add the yogurt mixture and pickle juice to the potatoes and toss gently to evenly coat. Garnish with remaining dill and green onion.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/07/Rainbow-Potato-Salad-2.jpg",
    "ingredients": "['1 12 pounds multi-color baby potatoes', 'Kosher salt', '1/3 cup 2% Greek yogurt', '1/3 cup olive oil mayonnaise (or light mayonnaise)', '1 teaspoon yellow mustard', '1 12 teaspoon fresh dill', 'Freshly ground black pepper (to taste)', '1 dill pickle spear (finely chopped)', '1 medium celery stalk (finely chopped)', '2 small green onions (chopped)', '1 tablespoon pickle juice']",
    "recipe_name": "Rainbow Potato Salad"
  },
  {
    "cooking_method": "['In a large bowl, combine beef, salt and pepper. With wet hand, gently form into 4 equal patties. Set aside.', 'In another large bowl, whisk together dressing ingredients. Set aside.', 'Cook hamburger patties on a grill to medium doneness, around 4-5 minutes per side. After flipping the patties, add the onion rings to the grill. Cook onion for the remaining 4-5 minutes, flipping halfway through. Allow patties to rest for 5-10 minutes then cut each patty into 16 bite-size pieces.', 'Add the lettuce, pickles, onion, avocado and tomato to the bowl. Divide the salad among 4 plates, top each with grilled onions, cheese, and 1 chopped patty. Drizzle with 14 of the dressing.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/07/Cheeseburger-salad-0020-s.jpg",
    "ingredients": "['1 pound 93% lean ground beef', '14 teaspoon kosher salt', 'Freshly ground black pepper (to taste)', '4 cups chopped romaine lettuce', '4 dill pickle spears (chopped)', '1/2 small red onion (sliced into rings)', '4 ounce avocado (cubed (from 1 small haas))', '1 cup cherry tomatoes (halved)', '1/4 cup reduced-fat shredded cheddar cheese', '1/4 cup light mayonnaise', '1 teaspoon mustard', '1 teaspoon dill pickle juice', '4 teaspoons ketchup (sugar free for Keto)', '1/4 teaspoon onion powder', '1/4 teaspoon garlic powder', '1/4 teaspoon paprika']",
    "recipe_name": "Cheeseburger Salad"
  },
  {
    "cooking_method": "['Skillet Directions:', 'Combine soy sauce, rice wine, honey, garlic, ginger and sriracha in a skillet and cook medium-low, stirring for about 2 minutes.', \"Add the chicken and cook 5 minutes, covered. Turn chicken, cover and cook 20 minutes over medium-low. Turn again, cover and cook 15 minutes, until the chicken is very tender. Remove the cover, if the sauce isn't thick simmer uncovered until sauce thickens, about 2 minutes.\", 'Finish with scallions and sesame seeds.', ' ', 'Instant Pot Directions:', 'Use saute button, when hot add soy sauce, rice wine, honey, garlic, ginger and sriracha and cook 2 minutes, stirring. Add the chicken, cover and lock the lid. Cook on high pressure 15 to 20 minutes until the chicken is tender.', 'When pressure releases, finish with scallions and sesame seeds.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/07/Honey-Teriyaki-Drumsticks-2-1.jpg",
    "ingredients": "['1/4 cup low sodium soy sauce (or gluten free)', '3 tbsp rice wine', '2 tbsp honey', '2 cloves garlic (minced)', '1 teaspoon fresh grated ginger', '1 teaspoon sriracha (optional)', '8 drumsticks (28 oz, skin removed)', '1 tbsp sesame seeds', 'chopped scallions']",
    "recipe_name": "Honey Teriyaki Drumsticks"
  },
  {
    "cooking_method": "['In a small bowl, beat egg whites and season with salt and pepper. In a ziplock bag, place breadcrumbs, garlic powder and cheese and shake well. Spray cookie sheet with cooking spray and set aside.', 'Dip zucchini sticks into eggs then into bread crumb and cheese mixture, a few at a time and shake to coat. Place the breaded zucchini in a single layer and spray more cooking spray on top. Bake at 425 for about 20-25 minutes, or until golden brown. Serve with 1/2 cup marinara sauce for dipping.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2009/01/Baked-Zucchini-Sticks-2.jpg",
    "ingredients": "['cooking spray', '4 medium (7 oz each zucchinis, ends trimmed)', '3 large egg whites (beaten)', '1/4 tsp kosher salt', 'fresh black pepper (to taste)', '1 cup seasoned whole wheat bread crumbs', '2 tbsp grated Pecorino Romano cheese', '1/4 tsp garlic powder', '1/2 cups quick marinara sauce for dipping (optional)', ';']",
    "recipe_name": "Baked Zucchini Sticks"
  },
  {
    "cooking_method": "['In a small bowl, combine miso, mirin, garlic and ginger.', 'Pour 1/4 of the marinade in a shallow dish or glass pie plate, place fish flesh-side down, and top with remaining marinade. Place in refrigerator and allow to marinade at least 6 hours or up to overnight.', 'Remove from refrigerator 30 minutes before cooking. Preheat oven to broil high.', 'Transfer fish to a sheet pan lined with foil. Discard excess marinade.', 'Place fish on the second rack from the top and broil 6-7 minutes, or until fish flakes easily with a fork.', 'If you wish to serve the fish without the skin, carefully slide a fish spatula between the skin and flesh.', 'Top with scallions and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/01/MisoSalmon-3.jpg",
    "ingredients": "['1 pound wild salmon (skin-on, cut into 4 equal portions)', '1/4 cup white miso (available at amazon, or Asian, gourmet markets)', '1/2 cup mirin', '2 garlic cloves (crushed)', '1 teaspoon grated ginger', '1 scallion (green parts only, thinly sliced)']",
    "recipe_name": "Broiled Miso Salmon"
  },
  {
    "cooking_method": "['Preheat oven to 350F. Spray 8 (4 oz) ramekins with cooking spray. Place on a large baking tray.', 'Melt chocolate in medium microwaveable bowl for 45 second intervals, mixing until melted and set aside to cool a few minutes.', 'Add the pumpkin puree to the melted chocolate along with vanilla, 1 whole egg, and maple syrup; mix well.', 'In a separate bowl, with a hand mixer beat the egg whites until soft peaks form.', 'Fold the egg whites into the chocolate mixture, add salt.', 'Spoon 1/4 cup mixture into ramekins and bake about 15 minutes, until the cakes rise. Serve right away.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/11/FlourlessChocolateCake.jpg",
    "ingredients": "['cooking spray', '6 oz 60% Ghirardelli Chocolate', '1/4 cup pumpkin puree', '1 1/2 tbsp pure maple syrup', '1 tsp vanilla extract', '1 whole egg', '3 egg whites', '1/8 tsp kosher salt']",
    "recipe_name": "Flourless Chocolate Cake"
  },
  {
    "cooking_method": "['Mix pumpkin with brown sugar, vanilla and spices, blend well.', 'Mix in yogurt.', 'Fold in Truwhip and chill in refrigerator until ready to eat.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/11/PumpkinPieDip.jpg",
    "ingredients": "['15 oz can pumpkin', '3/4 cup brown sugar (not packed)', '1 tsp vanilla', '1/8 tsp cinnamon', '1/8 tsp pumpkin pie spice (or more to taste)', '6 oz 0% Greek yogurt (Fage)', '8 oz Truwhip', 'cut up apples (for dipping)']",
    "recipe_name": "Pumpkin Pie Dip"
  },
  {
    "cooking_method": "['For sauce:', 'Soak almonds in 1 cup of water for 2 hours.', 'Drain and discard water.', 'In a blender or Vitamix, combine almonds, 1 cup (fresh) water, lemon juice, garlic, honey, turmeric, salt and basil and blend until completely smooth.', 'Put the sauce in a squeeze bottle. (Note: you will only use 12 the sauce.)', 'Assembly:', 'Put the sauce in a squeeze bottle.', 'In 4 bowls, evenly distribute the quinoa, chicken, veggies (broccoli, peppers and carrots), and beans.', 'In between layers, squeeze in 2 tablespoons of sauce.', 'Top each with 1 tbsp each pumpkin seeds, green onions, feta and drizzle with remaining 1 tablespoon of sauce. (Each bowl gets about 3 tablespoons of sauce.)', 'Refrigerate extra sauce for up to 5 daysits great as a salad dressing or drizzled over meat, poultry or fish.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/10/sunshinebowl-0016-550.jpg",
    "ingredients": "['1 1/3 cup cooked quinoa', '2 cups diced grilled chicken breast', '1 1/3 cup finely chopped broccoli heads', '1 1/3 cup finely diced red peppers', '1 1/3 cup shredded carrots', '12 cup cannellini beans', '14 cup hulled pumpkin seeds', '14 cup chopped green onions', '14 cup crumbled feta cheese', '12 cup whole raw almonds', '2 cups water (divided)', 'Juice from 3 lemons', '1 garlic clove', '1 teaspoon honey', '1 teaspoon turmeric', '2 teaspoons Kosher salt', '10 basil leaves']",
    "recipe_name": "Seattle Sunshine Bowl"
  },
  {
    "cooking_method": "['Preheat oven to 350F.', 'Lightly dust a large cutting board or flat surface with flour. Roll out a room temperature pie crust sheet, so that it becomes thin enough to cut off about 30%, so that your final crust is 5 oz.', 'Place into a 9-inch pie dish, cutting off excess dough.', 'Place pumpkin puree in a large bowl. Add butter, and mix well.', 'Using an electric mixer, mix in brown sugar, milk, eggs, egg whites, pumpkin pie spice, cinnamon, nutmeg and vanilla. Beat on medium speed until mixture is smooth.', 'Pour filling into unbaked pie crust. Bake about 70 to 75 minutes, or until knife inserted in center comes out clean.', 'Cut into 10 slices and serve with whipped coconut cream or whipped cream if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/10/PumpkinPie.jpg",
    "ingredients": "['15 oz canned pumpkin (or homemade pumpkin puree*)', '2 tbsp whipped butter (softened)', '3/4 cup light brown sugar (unpacked)', '1/2 cup fat free milk', '1 large egg', '2 large egg whites', '1/2 teaspoon pumpkin pie spice', '1/2 teaspoon ground cinnamon', '1/4 teaspoon ground nutmeg', '1 tsp vanilla extract', '1 frozen pie crust sheet (Pillsbury (thawed to room temperature)*)']",
    "recipe_name": "Skinny Pumpkin Pie"
  },
  {
    "cooking_method": "['Heat a large nonstick or cast iron skillet over medium heat. Spray with cooking spray, add the pancetta and cook until golden; about 3 to 4 minutes. Using a slotted spoon, set aside on paper towels leaving the oil in the skillet.', 'Add the potatoes and 1/2 teaspoon salt and pepper, and leave without stirring, 3 to 4 minutes until browned. Turn, add the shallots and cook until the potatoes are golden brown, and shallots are caramelized, stirring about 2 to 3 minutes.', 'Add the asparagus, cover the skillet with lid or foil and cook for 8 to 10 minutes, or until tender crisp. Remove the lid, taste for salt and adjust if needed. Return pancetta to the skillet.', 'Meanwhile, cook the eggs as desired. Serve right away topped with egg.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/04/Asparagus-Hash-3.jpg",
    "ingredients": "['cooking spray', '2 oz diced pancetta', '16 oz Yukon gold potatoes (peeled and cut into a 1/2-inch dice)', '1 large shallot (chopped)', 'kosher salt and pepper to taste', '1/2 pound asparagus (tough ends trimmed and cut into 1/2-inch pieces)', '4 large eggs']",
    "recipe_name": "Asparagus-Pancetta Potato Hash"
  },
  {
    "cooking_method": "['Season the chicken with Montreal chicken seasoning (or any seasoned salt). Cook chicken on a grill or grill pan sprayed with oil over medium heat for about 5 minutes on each side, or until the chicken is cooked through in the center. Transfer to a cutting board and slice thin.', 'Place the corn in the microwave for 4 minutes (or you can peel and boil in water for 5 minutes). Peel the husk off the corn, then cut the corn off the cobb. Divide the lettuce, tomatoes, corn and chicken on two plates, then drizzle with BBQ Sauce and dressing.', ' ']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/08/BBQChickenSalad.jpg",
    "ingredients": "['8 oz boneless skinless chicken breast', '1/2 tsp reduced sodium Montreal Chicken Seasoning', 'cooking spray', '2 cups chopped Romaine lettuce', '2 small tomatoes (diced)', '1 corn on the cobb with the husk', '2 tbsp Skinny Ranch Dressing (homemade or store bought)', '1 tbsp BBQ Sauce (I used Harry &amp; David Raspberry Chipotle)']",
    "recipe_name": "BBQ Chicken Salad"
  },
  {
    "cooking_method": "['Whisk eggs, 1/2 cup of the cheese, basil and crushed red pepper if using; set aside.', 'Bring a large pot of salted water to a boil for the pasta.', 'In a large deep nonstick skillet, saute pancetta and shallots about 3 minutes, add the garlic and saute another minute.', 'Add the shredded brussels sprouts, and black pepper and saute another 8 -10 minutes, until slightly caramelized. Remove from heat.', 'Meanwhile cook pasta al dente according to package directions.', 'Reserve 1 cup of the pasta water just before draining, then drain and add to the skillet and mix well with brussels sprouts.', 'Slowly, a tablespoon at a time, add 1/4 cup of the water to the egg mixture and mix well, slowly add to pasta stirring well, add additional reserved pasta water 1/4 cup at a time as needed, stirring and finish with the remaining 1/4 cup cheese. Serve right away.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/08/BrusselsSproutsCarbonara-3.jpg",
    "ingredients": "['2 large eggs', '3/4 cups parmesan cheese', '1/4 cup loosely packed basil (chopped)', '1/4 tsp crushed red pepper flakes (optional)', '12 oz Delallo fusilli (gluten-free or wheat)', '3 oz diced pancetta', '2 cloves crushed garlic', '1/4 cup chopped shallots', '10 oz brussels sprouts (shredded)', 'kosher salt', 'fresh black pepper (to taste)']",
    "recipe_name": "Brussels Sprouts Carbonara"
  },
  {
    "cooking_method": "['In a bowl marinate the chicken with oyster sauce and soy sauce 10 minutes.', 'Heat a large nonstick skillet or wok over medium-high heat, when hot add the oil, garlic and chili and cook until fragrant, about 30 seconds.', 'Increase the heat to high and add the chicken and cook, stirring until just cooked through, about 4 minutes. Add the basil and cook until wilted, about 1 minute.', 'Serve over rice.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2016/03/thaibasilchicken.jpg",
    "ingredients": "['1 1/4 lbs boneless (skinless chicken breasts, sliced into thin strips)', '2 tbsp oyster sauce (Substitute for GF oyster sauce)', '2 tbsp light soy sauce (Substitute for GF soy sauce)', '5 cloves garlic (minced)', '1 serrano chile (seeded and minced (keep seeds for extra hot))', '2 teaspoons vegetable or canola oil', '3 cups fresh Thai or regular basil leaves', 'cooked jasmine rice (optional for serving)']",
    "recipe_name": "Thai Basil Chicken"
  },
  {
    "cooking_method": "['Combine strawberries, onions, cucumbers, mint, basil, lime juice, salt and pepper.', 'Lightly drizzle with balsamic glaze and finish with slivered almonds.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/07/StrawberryCucumberSalad-2.jpg",
    "ingredients": "['1 1/3 cup sliced strawberries', '1/4 cup slivered red onion', '1 1/3 cup diced cucumber (about 12 large)', '1 tsp chopped fresh mint', '1 tsp chopped fresh basil', '1 teaspoon fresh lime juice', 'pinch kosher salt', 'freshly ground black pepper', '1 tbsp balsamic glaze', '2 tbsp sliced almonds (toasted)']",
    "recipe_name": "Strawberry Cucumber Salad"
  },
  {
    "cooking_method": "['Preheat oven to 350F.', 'Line a mini muffin pan with 24 liners and set aside.', 'Crush the cookies (using blender or rolling pin) and put the crumbs in a bowl; stir in butter and brown sugar, I used my fingers to combine well until it resembles coarse crumbs.', 'Divide about 1 tbsp of crumbs into muffin liners and press down. Bake for about 10 min then lower oven temp to 325F.', 'Place the chopped chocolate in a large bowl. In a sauce pan heat the milk for the chocolate filling until its just about to boil, remove from heat before it boils.', 'Pour the milk over the chocolate and let stand for a moment to let the chocolate melt, then whisk to combine well.', 'In a separate bowl, beat the eggs well. Slowly add a small amount of the chocolate mixture to the eggs (about 14 cup at a time) in 3 additions, you want to make sure you dont scramble the eggs so whisk vigorously after each addition until all of the eggs and chocolate are mixed together.', 'Fill the muffin liners almost to the top.', 'Bake for 10-12 minutes until it sets. Let cool and start your meringue.', 'Stir together the sugar and water in a small sauce pan and heat on high heat until boiling and and it starts to turn a nice amber color, 5 min, turn off the heat and swirl in the pan for another minute', 'Meanwhile, while you are caramelizing the sugar using a hand mixer with a whip attachment, whip the egg whites and cream of tarter on medium high until soft peaks form, turn to medium low and very slowly pour in the hot sugar syrup turn to high and whip until very thick and glossy, about 2 to 3 minutes. Blend in vanilla.', 'Transfer to a piping bag and dollop the merengue on top of each tartlet.', 'Use a torch or broil in the oven for 2 minutes until it golden, careful not to burn. Eat within 4 hours.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/08/smorestartlettes.jpg",
    "ingredients": "['4 oz gluten free or reduced fat Graham crackers', '2 tbsp dark brown sugar', '3 tbsp whipped unsalted butter', '8 oz 60% chocolate (chopped)', '3/4 cup canned fat free evaporated milk', '2 large eggs', '1/4 cup sugar', '2 tbsp water', '1/4 cup egg whites (from 2 large eggs)', '1/8 tsp cream of tarter', '1/2 tsp vanilla extract']",
    "recipe_name": "Gluten-Free S'mores Tartlets"
  },
  {
    "cooking_method": "['Heat the oven to 375F. Spray a large rimmed baking sheet with cooking spray.', 'Place the olive oil in a large nonstick skillet over medium heat. When hot add the garlic and saute until golden, about 30 seconds.', 'Add the zucchini, season with salt and pepper and cook on high heat until all the water evaporates from the skillet, 5 to 7 minutes.', 'Transfer to a colander to get rid of any excess water, then to a large bowl along with the bread crumbs, beaten egg, Romano cheese and chopped basil.', 'Form the zucchini mixture into 16 balls about 1 oz each, rolling tightly and transfer to the prepared baking sheet. Spray the top and bake until firm and browned, about 20 to 25 minutes.', 'Heat the sauce in a large deep skillet to warm the sauce, about 4 to 5 minutes. Add the meatballs to the sauce and simmer for 5 minutes.', 'Garnish the meatballs with fresh basil leaves and serve with ricotta or grated cheese if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/07/Zucchini22Meatballs22.jpg",
    "ingredients": "['cooking spray', '1 tsp olive oil', '2 garlic cloves (crushed)', '1 1/4 lbs unpeeled zucchini (grated)', '1/2 tsp kosher salt', '1/8 tsp black pepper', '3 tbsp chopped basil (plus leaves for garnish)', '1 cup Italian seasoned breadcrumbs', '1 large egg (beaten)', '1 ounce 1/4 cup Pecorino Romano cheese, freshly grated, plus more for serving', '2 cups quick marinara sauce or jarred (I love DeLallo Pomodoro)', 'part skim ricotta cheese (for serving (optional))', ';']",
    "recipe_name": "Zucchini Meatballs"
  },
  {
    "cooking_method": "['In a cocktail shaker, muddle the chopped cucumber, lemon zest, basil and agave.', 'Add the gin, lemon juice and ice cubes and stir 10 seconds.', 'Strain the mixture into a rocks glass filled with ice cubes and top with seltzer.', 'Garnish with lemon and cucumber and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/07/Basil-CucumberGinCooler.jpg",
    "ingredients": "['2- inch piece of cucumber (peeled and chopped)', '1 tsp grated lemon zest', '2 fresh basil leaves', '1 tsp agave nectar', '1 1/2 oz gin', '2 tbsp fresh lemon juice', 'ice cubes', 'splash of seltzer', '1 thin slice lemon (for garnish)', '1 thin slice cucumber (for garnish)']",
    "recipe_name": "Basil-Cucumber Gin Cooler"
  },
  {
    "cooking_method": "['Heat the oven to 375F. Spray a large rimmed baking sheet with cooking spray.', 'Place 1/2 tablespoon olive oil in a large nonstick skillet over medium high heat. When hot add the eggplant and 1/4 cup water. Season with salt and pepper to taste and cook, stirring occasionally until tender, 10 to 12 minutes. Transfer to the bowl of a food processor and pulse a few times.', 'Transfer to a bowl and add bread crumbs, beaten egg, Romano cheese, parsley, garlic and chopped basil into the eggplant. Season with 1/2 teaspoon kosher salt and 1/8 teaspoon of pepper.', 'Form the eggplant mixture into 24 balls about 1 1/8 oz each, rolling tightly and transfer to the prepared baking sheet. Bake until firm and browned, about 20 to 25 minutes.', 'Heat the sauce in a large deep skillet to warm the sauce. Add the meatballs to the sauce and simmer for 5 minutes. Garnish the meatballs with basil leaves and serve with ricotta cheese if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/07/EggplantMeatballs.jpg",
    "ingredients": "['cooking spray', '1/2 tbsp olive oil', '1 1/4 lbs unpeeled eggplant (cut into 1-inch pieces)', 'kosher salt', '1/4 tsp black pepper', '2 garlic cloves (crushed)', '2 tbsp chopped basil (plus leaves for garnish)', '1 1/2 cups Italian seasoned breadcrumbs', '1 large egg (beaten)', '2 ounces Pecorino Romano cheese (freshly grated, plus more for serving)', '1 tablespoon chopped flat-leaf parsley', '1 25.25 ounce jar DeLallo Pomodoro sauce', 'part skim ricotta cheese (for serving (optional))']",
    "recipe_name": "Eggplant \"Meatballs\""
  },
  {
    "cooking_method": "['Toast the garlic and jalapenos in a dry skillet until golden. Remove from heat, peel garlic and seed the peppers.', 'Combine with olive oil, cilantro and parsley in a small blender with just enough water to blend.', 'Place in a bowl and combine with diced cucumber and avocado.', 'Pat the scallops dry with paper towels. Season with salt and pepper.', 'Heat a medium skillet over high heat, add 1/2 teaspoon oil and cook the scallops 4 at a time for about 1 1/2 to 2 minutes on each side, or until they become caramelized and the center is do not overcook. Set aside and repeat with the others.', 'To serve, heat the tortillas on a separate skillet about 30 to 60 seconds on each side, top each with 1/4 cup sauce and 2 scallops. Squeeze some fresh lime juice on top and eat right away.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/06/ScallopTacos.jpg",
    "ingredients": "['2 garlic cloves (skin left on)', '2 small jalapenos', '2 tbsp olive oil', '1 large bunch fresh cilantro (leaves only)', '1 large bunch parsley (leaves only)', '1 cucumber (peeled, seeded and diced small)', '1 medium haas avocado', '1/2 tsp kosher salt', '1 to 2 tbsp water as needed', '16 fresh scallops (about 1 lb)', '1/8 tsp kosher salt and fresh ground pepper to taste', '2 tsp oil', '1 lime (cut into wedges)', '8 corn tortillas']",
    "recipe_name": "Green Scallop Tacos"
  },
  {
    "cooking_method": "['Combine diced onions, tomatoes, salt and lime juice in a non-reactive bowl and let it sit about 5 minutes.', 'Combine the remaining ingredients in a large bowl, taste for salt and adjust as needed.', 'Refrigerate and let the flavors combine at least an hour before serving.', 'Makes 4 1/4 cups.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/06/Skinny-Shrimp-Salsa.jpg",
    "ingredients": "['16 oz cooked peeled shrimp (diced fine)', '4 vine ripe tomatoes (diced fine)', '6 tbsp red onion (finely diced)', '3 tbsp jalapenos (diced fine (more or less to taste))', '2 tbsp minced cilantro', '2 limes (juice of (or more to taste))', '1/2 tsp kosher salt']",
    "recipe_name": "Skinny Shrimp Salsa"
  },
  {
    "cooking_method": "['Preheat oven to 350F. Spray a nonstick muffin pan with olive oil spray.', 'Heat the oil in a large non-stick skillet over medium heat.', 'Saute onions and salt for 5 minutes, until soft, add bell peppers, garlic, tomato, kielbasa saute for another 5 to 7 minutes. Add spinach and cook until wilted, about 1 minute. Set aside.', 'Meanwhile, in a large bowl, whisk the eggs, egg whites, milk, flour, salt and pepper until smooth.', 'Add the cheese and cooked kielbasa mixture to the bowl and mix well.', 'Pour into the prepared muffin pan and bake for 28 to 30 minutes, or until firm.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/02/minicrustless-quiche.jpg",
    "ingredients": "['olive oil spray', '1 tbsp olive oil', '1/2 medium onion (diced)', '1/3 cup chopped bell pepper', '2 garlic cloves (crushed)', '1 medium tomato (diced)', '6 oz turkey kielbasa (diced)', '2 cups baby spinach', '5 large whole eggs (beaten)', '4 large egg whites', '1/3 cup fat free milk (or milk of choice)', '1/3 cup all purpose flour*', '1/2 tsp salt', '1/8 tsp black pepper', '3 oz shredded cheddar cheese', '*For gluten free use GF all purpose flour.']",
    "recipe_name": "Petite Crust-less Quiche"
  },
  {
    "cooking_method": "['Preheat oven to 450F.', 'Combine cauliflower, olive oil, lemon juice, garlic, salt and pepper well so all the florets are coated and seasoned.', 'Place in a large shallow roasting pan and place in the center of the oven.', 'Roast for about 25-35 minutes, turning florets occasionally so they are evenly cooked.', 'Remove from oven and top with cheese and some lemon zest and additional salt and pepper if needed.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/02/roastedcauliflower.jpg",
    "ingredients": "['6 1/2 cups uncooked cauliflower florets (about 1 large cut small)', '3 garlic cloves (chopped)', '2 tbsp olive oil', 'kosher salt and fresh pepper', 'juice of 1/4 lemon', '2 tbsp Parmigiano Reggiano (freshly grated)']",
    "recipe_name": "Oven Roasted Cauliflower"
  },
  {
    "cooking_method": "['With a heart shaped cutter or the rim of a glass, press a hole in the center of the slice of bread.', 'Mash the avocado with a fork and season with salt and pepper.', 'Heat a skillet over medium-low heat and spray with the oil. Place the bread and the cut out piece on the skillet and crack the egg straight into the center of the hole.', 'Cook until the egg sets on the bottom, about 1 minute, season with salt and pepper and flip over with a spatula, season with salt and pepper the other side.', 'Cook the other side until the yolk is to your liking, I prefer mine soft.', 'Remove and top with avocado and hot sauce if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/02/avocadotoastegginahole.jpg",
    "ingredients": "['1 slice whole wheat or whole grain bread', '1 oz avocado', 'olive oil spray', '1 large egg', 'Kosher salt and freshly ground black pepper', 'hot sauce (optional)']",
    "recipe_name": "Avocado Toast Egg-in-a-Hole"
  },
  {
    "cooking_method": "['Heat a large heavy pot or dutch oven on medium heat. Add the oil, carrots, onion, celery and garlic to the pot and stir.', 'Add chicken, broth, parsley, and bay leaves and bring to a boil. When boiling, reduce heat to low and cover. Simmer covered over low heat until the chicken and vegetables are tender, about 30 minutes.', 'Remove the chicken, shred or cut the meat, discard the bones and return the chicken to the pot along with the barley, adjust the salt if needed and add fresh ground pepper. Simmer an additional 40 minutes, until the barley is cooked.', 'Discard the bay leaves and serve. Makes about 9 cups.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/02/Chicken-and-Barley-Soup.jpg",
    "ingredients": "['1 teaspoon olive oil', '1 cup chopped carrots', '1 cup chopped onions', '1/2 cup chopped celery', '2 cloves garlic (chopped)', '1-1/2 lbs skinless bone-in chicken breast (makes 14 oz cooked)', '7 cups reduced sodium chicken broth', '1/4 cup chopped parsley', '2 bay leaves', '2/3 cup dry barley', 'fresh ground black pepper (to taste)']",
    "recipe_name": "Chicken Barley Soup"
  },
  {
    "cooking_method": "['Preheat the oven to 400F.', 'Lightly spray a non-stick baking sheet with oil.', 'In a large bowl, combine the ground chicken, panko crumbs, egg, scallions, celery, carrot and garlic; season with salt and pepper, to taste.', 'Using clean hands, mix until combined. Roll the mixture (1/8 cup each) into 26 round meatballs.', 'Place meatballs onto prepared baking sheet and bake until cooked through and golden, about 16 to 18 minutes.', 'Place the meatballs in a bowl, add the buffalo sauce and gently toss to combine.', 'Serve immediately, drizzled with blue cheese dressing, if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/01/SkinnyChickenBuffaloMeatballs.jpg",
    "ingredients": "['oil spray (I used my mister)', '1 1/4 lb ground chicken', '1/4 cup panko crumbs', '1 large egg', '2 scallions (chopped)', '1/3 cup finely minced celery', '1/3 cup finely minced carrot', '1 clove crushed garlic', 'kosher salt and freshly ground black pepper (to taste)', '1/3 cup Franks Hot sauce', '1/4 cup skinny blue cheese dressing (optional)', 'finely chopped celery leaf for garnish (optional)']",
    "recipe_name": "Buffalo Chicken Meatballs"
  },
  {
    "cooking_method": "['Stove Top Directions:', 'Heat a large soup pot or Dutch oven over medium heat, spray with oil and add the sausage; cook until browned, breaking it up as it cooks with a wooden spoon about 4 to 5 minutes.', 'Add the chopped onion and crushed garlic and cook 2 to 3 minutes.', 'Add the parsley, broth, water, marinara sauce, bay leaves and fresh black pepper and bring to a boil; cover, reduce heat and simmer about 30 minutes.', 'In a medium bowl combine the ricotta, parmesan, and 2 tbsp parsley and mix.', 'Add the broken pasta and cook uncovered according to package directions.', 'Divide between 6 bowls and top each with 2 tbsp ricotta cheese mixture, mozzarella, fresh cracked pepper and fresh basil on top.', 'Slow Cooker Directions:', 'Heat a large nonstick skillet over medium-high heat, spray with oil and add the sausage; cook until browned, breaking it up as it cooks with a wooden spoon about 3 to 4 minutes. Add the chopped onion and crushed garlic and cook until soft, about 3 to 4 minutes.', 'Transfer to the slow cooker and add the parsley, broth, water, marinara sauce, bay leaves and fresh black pepper. Cover and set the slow cooker to low 8 hours or high 4 hours.', 'Meanwhile, in a medium bowl combine the ricotta, parmesan, and 2 tablespoons of the parsley and mix well; set aside until the soup is ready.', 'About 30 minutes before the soup is ready, remove the bay leaves and add the broken pasta, cover and cook until the pasta is cooked, about 30 minutes. Divide between 6 bowls and top each with 2 tbsp ricotta cheese mixture, mozzarella, fresh cracked pepper and fresh basil on top.', 'Instant Pot Directions:', 'Press saute on the Instant Pot and spray with oil. Add the sausage and cook until browned, breaking it up as it cooks with a wooden spoon about 4 to 5 minutes.', 'Add the chopped onion and crushed garlic and cook 2 to 3 minutes. Press cancel to shut off.', 'Add the parsley, broth, water, marinara sauce, bay leaves and fresh black pepper; cover and cook high pressure 15 minutes.', 'In a medium bowl combine the ricotta, parmesan, and 2 tbsp parsley and mix. Set aside.', 'Use the natural or the quick release method, then open the pot. Add the broken pasta, cover and cook high pressure 3 minutes. Use the quick release method to open the pot.', 'Divide between 6 bowls and top each with 2 tbsp ricotta cheese mixture, mozzarella, fresh cracked pepper and fresh basil on top.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/01/Lasagna-Soup.jpg",
    "ingredients": "['For the soup', 'cooking spray', '14 oz sweet Italian chicken sausage (casing removed)', '1/2 onion (chopped)', '2 crushed cloves garlic', '4 tbsp chopped fresh parsley (divided)', '3 cups low-sodium (fat-free chicken broth*)', '2 1/2 cups water', '2 cups quick marinara sauce', '2 bay leaves', 'fresh cracked black pepper', '6 oz broken lasagna noodles (whole wheat or gluten free*)', '6 tbsp part skim shredded mozzarella cheese*', '1/2 cup part skim ricotta cheese', '3 tbsp grated parmesan cheese', '2 tbsp chopped fresh parsley', '1/4 cup fresh basil chiffonade', '*check labels for gluten free']",
    "recipe_name": "Lasagna Soup"
  },
  {
    "cooking_method": "['In a medium bowl combine avocados, red onions, jalapeno, cilantro, lime juice, salt, and, if desired, hot pepper sauce.', 'Fold in crabmeat.', 'Cover surface with plastic wrap; chill until ready to use (up to 6 hours). Serve with tortilla chips.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/01/crab-guacamole-2.jpg",
    "ingredients": "['8 oz from 2 small haas diced avocados, coarsely mashed', '1/4 cup diced red onion', '1 jalapeno (seeded and minced)', '2 tbsp fresh cilantro', '3 tbsp fresh lime juice', '1/4 tsp kosher salt', '6 oz canned lump crabmeat (drained)']",
    "recipe_name": "Crab Guacamole"
  },
  {
    "cooking_method": "['Preheat the oven to 200F (90C).', 'Line two baking sheets with parchment and set aside.', 'Wipe a stainless steel bowl and the whisk of an electric mixer with a paper towel dampened with a little lemon juice to eliminate any trace of grease.', 'Put the egg whites into the bowl and beat on low speed until foamy, about 30 seconds.', 'Stop the mixer and add the cream of tartar.', 'Increase the speed to medium and beat until soft peaks form, about 1 minute.', 'Increase the speed to medium-high and add the sugar one spoonful at a time.', 'Beat on high speed until very stiff peaks form and the meringue is glossy and thick, about 3 minutes.', 'Add the vanilla and beat for 1 more minute.', 'Fit a large pastry bag with a large round decorating tip and pipe 2-inch-diameter cookies about 1 inch apart onto the prepared baking sheets.', 'Bake in the upper and lower third of the oven for 1 12 hours undisturbed, and then turn off the oven.', 'Leave the cookies inside the oven for 1 more hour to dry out.', 'The cookies should be crisp, but not browned or discolored.', 'Transfer the baking sheets to wire racks to cool completely.', 'In a heatproof bowl, melt the white chocolate either in the microwave in 20-second intervals (be careful not to burn it) or over a small saucepan of simmering water.', 'Line two baking sheets with fresh parchment paper and fill a shallow dish with the sprinkles.', 'Dip the bottom of each meringue into the white chocolate, and then immediately dip them into the sprinkles.', 'Put them on the prepared baking sheets and let them set, about 1 hour.', 'The meringues will keep in an airtight container at room temperature for up to 5 days.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/04/sprinkledippedmeringues.jpg",
    "ingredients": "['3 large egg whites (room temperature)', 'Pinch of cream of tartar', '3 4 cup (155 g superfine sugar)', '1 teaspoon pure vanilla or almond extract', '3 ounces 90 g best-quality white chocolate, chopped or callets/discs', 'Sprinkles of your choice', 'Large pastry bag Decorating tip #1A']",
    "recipe_name": "Sprinkle Dipped Meringues"
  },
  {
    "cooking_method": "['Preheat oven to 350F. Lightly spray a 8 x 4 loaf pan with baking spray.', 'In a medium bowl, combine flour, baking soda and salt with a wire whisk. Set aside.', 'In a large bowl cream butter and sugar with an electric mixer. Add egg whites, bananas, apple sauce and vanilla, and beat at medium speed until thick. Scrape down sides of the bowl.', 'Add flour mixture and blend at low speed until combined, do not over mix.', 'Fold in the blueberries and pour batter into the prepared loaf pans; bake in the center rack for about 50 to 55 minutes, or until a toothpick inserted in the center comes out clean.', 'Let the pan cool at least 20 minutes, bread should be room temperature before slicing.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/04/BlueberryBananaBread.jpg",
    "ingredients": "['1 cup blueberries', '3 ripe medium bananas (mashed)', '2 tbsp unsweetened apple sauce', \"1 1/4 cups white whole wheat flour (or Bob's Redmill AP GF blend)\", '3/4 tsp baking soda', '1/4 tsp salt', '2 tbsp butter (or DF Ghee) (softened)', '1/2 cup 4 oz light brown sugar, packed', '2 large egg whites', '1 tsp vanilla extract', 'baking spray']",
    "recipe_name": "Blueberry Banana Bread"
  },
  {
    "cooking_method": "['In a cast iron skillet, roast 2 garlic cloves until brown on each side.', 'Mash the garlic and place in a large bowl with the mushrooms, red onion and bell peppers.', 'In a medium bowl, combine the remaining ingredients, whisk well then pour over mushrooms.', 'Cover and refrigerate at least a few hours, or overnight.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/03/MushroomCeviche.jpg",
    "ingredients": "['2 roasted garlic cloves', '8 oz white button mushrooms (sliced thin)', '1 small red onion (sliced)', '1/2 green bell pepper (sliced into thin strips)', '1/2 red bell pepper (sliced into thin strips)', '1/3 cup freshly squeezed lemon juice', '1/2 cup vegetable broth (Pacific)', '1 tbsp chopped cilantro', '1/4 teaspoon honey (or agave for vegan)', '1 teaspoon finely chopped jalapeno', '1 tbsp olive oil', '1 teaspoon kosher salt', '1/8 teaspoon black pepper']",
    "recipe_name": "Mushroom Ceviche"
  },
  {
    "cooking_method": "['In a heavy saucepan combine egg whites, sugar and coconut flakes and cook over medium-low heat, stirring frequently until all the ingredients combine together, about 12 minutes. The mixture should be sticky and moist, not dry.', 'Remove from heat and stir in the almond and vanilla extracts.', 'Set aside and let it cool 10 minutes, should be warm.', 'Preheat the oven to 300F. Spray a nonstick a mini muffin tin with oil.', 'Drop heaping tablespoons into the tin, lightly press mixture into the bottom and up the sides of the tin to make \"nests\" with the back of the measuring spoon.', 'Bake 22 to 25 minutes, or until golden.', 'Let it cool 10 minutes, then carefully remove from the tin.', 'Arrange the nests and top each with two mini chocolate eggs.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/03/CoconutMacaroonNests-4.jpg",
    "ingredients": "['3/4 cup from 5 large egg whites', '6 tbsp granulated sugar', \"10 oz sweetened coconut flakes (I used Baker's)\", '1/2 tsp almond extract', '1/4 tsp vanilla extract', 'pinch of salt', 'cooking spray', '72 mini Cadbury chocolate eggs']",
    "recipe_name": "Coconut Macaroon Nests"
  },
  {
    "cooking_method": "['Preheat oven to 375F.', 'Place the whole graham crackers in a re-sealable plastic bag and crush with rolling pin, then measure 1 cup of crumbs and discard the rest.', 'In a medium-sized bowl or a food processor, combine the graham cracker crumbs, raw sugar, 3 tbsp shredded coconut, whipped butter and 1/2 tablespoon of water; blend until it has a texture of coarse meal.', 'Press into an 8-inch pie dish making the crust about 1/8-inch thick evenly all around and up the sides, evening the crumbs up to make sure there are no gaps or holes. Note: If you refrigerate the crust for 30 minutes before you bake it, this will help prevent crumbling when you want to serve it.', 'Bake until the edges are golden, about 8 to 10 minutes.', 'Remove from the oven and let the crust cool on a wire rack, before filling.', 'Meanwhile, dissolve the gelatin in 1/2 tablespoon of water in a small bowl for 5 minutes.', 'Lightly mash the silken tofu with a fork and place it in the blender with the coconut cream and remaining tablespoon of shredded coconut and blend until smooth, about 1 to 1 1/2 minutes.', 'Heat the 1/4 cup of coconut milk beverage in the microwave 40 to 45 seconds, and mix in with the gelatin until dissolved, 2 to 3 minutes.', 'Transfer to the blender and blend until smooth.', 'Pour into the graham cracker crust and refrigerate until it sets, about 3 to 4 hours.', 'Top with shaved coconut, if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/03/CoconutPie.jpg",
    "ingredients": "['6 whole reduced-fat or gluten-free graham crackers (about 4 oz)', '2 tablespoons raw sugar', '3 tablespoons whipped butter', '3 tablespoons sweetened shredded coconut', '1 teaspoon gelatin (or vegetarian substitute)', '12.3 oz package organic silken tofu (firm)', '1/4 cup milk of choice (I used plain unsweetened coconut milk)', '1/2 cup cream of coconut such as coco lopez', '1 tbsp sweetened shredded coconut', 'Optional topping: toasted coconut flakes']",
    "recipe_name": "Coconut Obsessed Pie"
  },
  {
    "cooking_method": "['In the blender combine the watermelon and water and puree until smooth.', 'Stir in chia seeds and let them sit for about 5 minutes.', 'Stir again, and let sit for as long as you like. The more it sits, the more gel-like the seeds become.', 'Pour into a glass over ice and garnish with lime and sprig of mint.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/09/IMG_0206.jpg",
    "ingredients": "['1 1/2 cups seedless watermelon cubes', '3 tbsp water', '1 tbsp chia seeds', '1 slice lime (for garnish)', 'a sprig of mint (for garnish)', 'ice']",
    "recipe_name": "Chia Watermelon Fresca"
  },
  {
    "cooking_method": "['In a medium bowl combine apple, 1/8 tsp cinnamon, agave, and lemon juice. Set aside.', 'Preheat oven to 350. Spray a 9 x 5 inch loaf pan with baking spray.', 'In a medium bowl, combine flour, baking soda, nutmeg, cinnamon, allspice and salt with a wire whisk. Set aside.', 'In a large bowl mix oil, egg whites, sugar, apple sauce and vanilla; beat at medium speed until thick. Scrape down sides of the bowl.', 'Add the flour mixture, then blend at low speed until combined. Do not over mix.', 'Fold in apples and walnuts.', 'Pour batter into loaf pan and bake in the center rack about 55 minutes, or until a toothpick inserted in the center comes out clean.', 'Let the pan cool at least 20 minutes, bread should be room temperature before slicing.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/09/applesauce-nut-bread.jpg",
    "ingredients": "['1 large finely diced (peeled apple, diced into 1/4\" pieces)', '1/2 tsp lemon juice', '1 tbsp agave', '1/8 tsp + 1/2 tsp cinnamon', '1 1/2 cups homemade applesauce (or store bought)', '1 1/2 cups King Arthur white whole wheat flour', '3/4 cup brown sugar (not packed)', '1 tsp baking soda', '1/4 tsp ground nutmeg', 'pinch allspice', '1/4 tsp salt', '2 tbsp vegetable oil', '2 large egg whites', '1 1/2 tsp vanilla extract', 'baking spray', '1 1/2 oz chopped walnuts']",
    "recipe_name": "Applesauce Nut Bread"
  },
  {
    "cooking_method": "['Stove Top Directions:', 'Heat a large pot over medium heat and add the olive oil, onion, jalapeno, and garlic. Cook until soft, about 5 minutes. Add the paprika, chili powder, cumin, black pepper, salt, and red pepper flakes. Stir and cook for 2 to 3 more minutes.', 'Add the chicken, red peppers, beans, chicken stock, tomatoes, and barbecue sauce, stirring to combine. Cover the pot, lower the heat to medium low, and cook for 20 minutes. Remove the lid and taste, adjusting the seasoning to taste, if needed. Cover and cook another 10 minutes.', 'Ladle the chili into bowls and top with cheddar cheese and cilantro. Enjoy!', 'Instant Pot Directions:', 'Press saute, add the olive oil, onion, jalapeno, and garlic. Cook until soft, about 5 minutes. Add the paprika, chili powder, cumin, black pepper, salt, and red pepper flakes. Stir and cook for 2 to 3 more minutes.', 'Add the chicken, red peppers, beans, chicken stock, tomatoes, and barbecue sauce, stirring to combine. Cover and cook high pressure 10 minutes (if using raw chicken, 15 minutes). Natural release, adjusting the seasoning to taste, if needed.', 'Ladle the chili into bowls and top with cheddar cheese and cilantro. Enjoy!']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/09/BBQ-Chicken-Chili.jpg",
    "ingredients": "['2 tablespoons olive oil', '1 cup red onion (diced)', '1 jalapeno pepper (seeded and diced)', '2 garlic cloves (minced)', '1 1/2 tablespoons smoked paprika', '1 tablespoon plus 2 teaspoons chili powder', '1 tablespoon ground cumin', '1/2 teaspoon black pepper', '1 teaspoon kosher salt', 'pinch of red pepper flakes', '12 oz cooked boneless skinless chicken breasts (shredded)', '12 oz jar roasted red peppers in water (drained and chopped)', '1 1/2 cups canned cannellini beans (rinsed and drained)', '1 1/2 cups canned kidney beans (rinsed and drained)', '3 cups low sodium chicken stock', '28 oz can diced tomatoes', '1/2 cup barbecue sauce', '11 tablespoons reduced fat cheddar cheese (for topping)', 'chopped cilantro (for topping)']",
    "recipe_name": "BBQ Chicken Chili"
  },
  {
    "cooking_method": "['Season the shrimp with cumin, and salt and pepper to taste.', 'Heat a very large nonstick skillet over high heat.', 'Add the oil and shrimp to the pan, and cook them undisturbed for about 2 minutes.', 'Turn the shrimp over, add garlic, red pepper flakes and cook until opaque throughout, about 1 minute.', 'Add the tequila and cook 30 to 40 seconds until slightly evaporated, remove from heat then squeeze the lime juice over all the shrimp.', 'Add the cilantro, toss well, and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/05/TequilaLimeShrimp.jpg",
    "ingredients": "['24 1 lb peeled and deveined jumbo shrimp', '1/4 tsp ground cumin', '1/4 tsp kosher salt and freshly ground black pepper', '1/2 tbsp extra-virgin olive oil', '4 garlic cloves (crushed)', '1/4 tsp crushed red pepper flakes', '2 tablespoons lime juice (from 1 medium lime)', '2 oz tequilla', '3 tablespoons rough chopped fresh cilantro']",
    "recipe_name": "Tequila Lime Shrimp"
  },
  {
    "cooking_method": "['In a large bowl combine all the ingredients, toss to combine and let stand 15 minutes before serving.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/04/QuickCababbageSlaw-2.jpg",
    "ingredients": "['1/2 small (about 5 cups head white cabbage, cored and shredded)', '1/2 red bell pepper (seeded and sliced thin)', '1/4 small red onion (sliced thin)', '2 tbsp extra virgin olive oil', '5 tsp apple cider vinegar', '1/4 tsp kosher salt', 'fresh black pepper (to taste)']",
    "recipe_name": "Quick Cabbage Slaw"
  },
  {
    "cooking_method": "['Line a baking sheet with foil and heat oven to 400F.', 'Cut salmon in 4 pieces and season with kosher salt.', 'Spread harissa over the top of the filet and sprinkle with lemon zest.', 'Bake for 10-12 minutes or until just opaque. Remove salmon from oven and set to broil.', 'Sprinkle sugar on top of fillet and return to oven for an additional 2 - 4 minutes until beginning to brown at edges and caramelize on top.', 'Sprinkle with additional zest, if desired, and serve with lemon wedges.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2015/04/greenharrisasalmon.jpg",
    "ingredients": "['1 lb wild salmon fillet (skin on)', '2 tbsp Mina green spicy harissa', 'zest of 1/2 lemon plus 4 wedges for serving', '1/4 tsp Kosher salt', '1/2 tsp raw sugar']",
    "recipe_name": "Green Harissa Salmon"
  },
  {
    "cooking_method": "['Heat a large pot over medium heat.', 'Add the oil, scallions, garlic and tomato to the pot, season with salt and pepper.', 'Cook stirring until soft, about 10 minutes.', 'Stir in 1/4 cup cilantro, cumin and cook 1 minute more.', 'Add the lentils, potato, broth and bay leaf.', 'Bring to a boil then reduce the heat to medium low, cover and cook until the lentils become tender about 30 minutes.', \"Remove the bay leaf, and puree the soup in the blender in 2 batches (so it doesn't explode) until very smooth.\", 'Adjust soup with salt and pepper to taste, then ladle into bowls and top with sour cream, scallions and cilantro, if desired; serve immediately.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/11/Creamy-Lentil-Soup.jpg",
    "ingredients": "['1 tsp olive oil', '3/4 cup chopped scallions', '2 garlic cloves (minced)', '1 medium chopped tomato', '1/4 cup plus 2 tbsp fresh cilantro chopped', '1/2 tsp cumin powder', '1 cup cup dried lentils', '1 small red potato (peeled and diced)', '4 cups reduced sodium chicken or vegetable broth', '1 bay leaf', 'kosher salt (to taste)', 'black pepper (to taste)', 'light sour cream', '2 tbsp chopped scallions (for garnish)']",
    "recipe_name": "Creamy Lentil Soup"
  },
  {
    "cooking_method": "['Wash leeks very carefully to remove all grit. I usually cut them horizontally and separate the rings to make sure no dirt remains.', 'Coarsely chop them when washed.', 'In a medium soup pot, melt butter and add flour on low flame.', 'Using a wooden spoon, stir and cook 1 to 2 minutes.', 'Add broth, leeks, and cauliflower and bring to a boil.', 'Cover and simmer on low for about 20 minutes, until cauliflower is soft.', 'Using an immersion blender, blend the soup until smooth adjusting the salt and pepper to taste.', 'Serve immediately.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/11/cauliflower-leek-soup.jpg",
    "ingredients": "['1 tbsp unsalted butter', '1 tbsp all purpose flour (use ap gluten-free flour for GF)', '4 cups reduced sodium chicken or vegetable broth', '1 bunch leeks (about 3 or 4 dark green stems removed)', '1 medium head cauliflower (chopped (about 1 1/2 lbs florets))', 'kosher salt and fresh pepper to taste', 'optional toppings: crumbled bacon, cheddar, scallions (extra)']",
    "recipe_name": "Cauliflower Leek Soup"
  },
  {
    "cooking_method": "['Preheat the oven to 450F.', 'Smash the garlic cloves with the side of the knife.', 'Place the cauliflower florets and smashed garlic on a large rimmed baking sheet and drizzle with olive oil.', 'Season with cumin, salt, and crushed red pepper flakes.', 'Sprinkle evenly over cauliflower, tossing well to coat evenly.', 'Bake in the center of the oven until browned and tender, about 25-30 minutes, turning the florets occasionally so they are evenly cooked.', 'Remove from the oven, squeeze with lime juice and top with lime zest and cilantro; serve warm.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/11/Cilantro-Lime-Chili-Roasted-Cauliflower.jpg",
    "ingredients": "['6 heaping cups cauliflower florets (from 1-1/2 pound cauliflower cut into 1-inch florets)', '3 garlic cloves', '3 tbsp olive oil', '1 tsp cumin', 'kosher salt (to taste)', '1/4 teaspoon crushed red pepper flakes', '1 tbsp lime juice', '1 tsp lime zest', '1 tbsp chopped cilantro']",
    "recipe_name": "Cilantro-Lime Roasted Cauliflower"
  },
  {
    "cooking_method": "['Slow Cooker Version:', 'Puree beans with 1 cup of the broth in a blender. Heat oil in a large nonstick skillet over medium-high heat. Add the carrots, celery, onion, garlic and saute until tender and fragrant, about 15 minutes.', 'Transfer to the crock pot along with the remaining broth, tomatoes, pureed beans, parmesan cheese rind, salt and pepper. Add the rosemary, bay leaves, basil and parsley, cover and cook on low for 6 to 8 hours.', 'Forty minutes before the soup is done cooking, add zucchini and spinach. Cover and cook 30 more minutes. Remove bay leaves, rosemary sprig, parmesan rind and season to taste with salt and black pepper. Ladle 1-1/4 cups soup into 8 bowls with 1/4 cup pasta in each and top with extra parmesan cheese if desired.', 'Stove Top Directions:', 'Puree beans with 1 cup of the broth in a blender. Heat oil in a large pot over medium-high heat. Add the carrots, celery, onion, garlic and saute until tender and fragrant, about 15 minutes.', 'Add the remaining broth, tomatoes, pureed beans, parmesan cheese rind, salt and pepper. Add the rosemary, bay leaves, basil and parsley, cover and cook on low 40 minutes. Add the zucchini and spinach, cover and simmer until the zucchini is tender, about 8 to 10 minutes.', 'Remove the bay leaves, rosemary sprig, parmesan rind and season to taste with salt and black pepper. Ladle 1-1/4 cups soup into 8 bowls with 1/4 cup pasta in each and top with extra parmesan cheese if desired.', 'Instant Pot Directions:', 'Puree beans with 1 cup of the broth in a blender. Press saute in the Instant Pot and heat oil. Add the carrots, celery, onion, garlic and saute until tender and fragrant, about 10 minutes.', 'Add the remaining broth, tomatoes, pureed beans, parmesan cheese rind, salt and pepper. Add the rosemary, basil and parsley, cover and cook high pressure 20 minutes.', \"Quick release, add the pasta, zucchini and spinach and cook high pressure 4 minutes. Quick release so the pasta doesn't overcook.\", 'Remove the bay leaves, rosemary sprig, parmesan rind and season to taste with salt and black pepper. Ladle 1-1/2 cups soup into 8 bowls and top with extra parmesan cheese if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/07/Crock-Pot-Minestrone-Soup.jpg",
    "ingredients": "['1 15 oz can white beans, drained, rinsed (cannellini or navy)', '32 oz container reduced sodium chicken broth (or vegetable broth for vegetarians)', '2 tsp olive oil', '1/2 cup chopped onion', '1 cup diced carrots', '1/2 cup diced celery', '2 garlic cloves (minced)', '1 28 oz can petite diced tomatoes', 'Parmesan cheese rind (optional)', '1 fresh rosemary sprig', '2 bay leaves', '2 tbsp chopped fresh basil', '1/4 cup chopped fresh Italian parsley', '1/2 tsp kosher salt and fresh black pepper', '1 medium 8 oz zucchini (diced)', '2 cups chopped fresh (or frozen defrosted spinach)', '2 cups cooked small pasta such as ditalini (al dente (or GF pasta))', 'extra parmesan cheese for garnish (optional)']",
    "recipe_name": "Minestrone Soup"
  },
  {
    "cooking_method": "['In a medium saucepan combine lentils, bay leaf, and thyme.', 'Add enough water to cover by 1 inch.', 'Bring to boil, reduce heat and simmer uncovered until lentils are tender but not mushy, about 16 to 20 minutes.', 'Drain lentils and discard bay leaf.', 'Place in a large work bowl with carrots, celery, red pepper, red onion, parsley, garlic, lemon juice, olive oil, salt and pepper.', 'Toss to combine and serve chilled or room temperature.', 'Makes 4 1/2 cups.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/07/Healthy-lentil-salad.jpg",
    "ingredients": "['1 cup dry brown lentils', '1 bay leaf', '2 sprigs fresh thyme', '1 cup finely diced carrots', '1/3 cup finely diced celery', '1/4 cup finely diced red bell pepper', '1/4 cup finely diced red onion', '1/4 cup minced parsley', '1 clove garlic (minced)', '5 tbsp lemon juice', '1 tablespoon olive oil', '1 teaspoon kosher salt', 'fresh ground black pepper']",
    "recipe_name": "Lentil salad"
  },
  {
    "cooking_method": "['Soak the skewers in water at least 20 minutes to prevent them from burning (or use metal skewers to save time).', 'Combine the shrimp with crushed garlic and season with salt and pepper. You can let this marinate for 15 minutes, or even overnight.', 'Heat a clean, lightly oiled grill to medium heat, when the grill is hot add the shrimp, careful not to burn the skewers.', 'Grill on both sides for about 6 - 8 minutes total cooking time or until the shrimp is opaque and cooked through.', 'Brush the sauce on during the last minute of cooking and eat right away.', ' ']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/07/Quick-Grilled-BBQ-Shrimp-Recipe.jpg",
    "ingredients": "['1 lb jumbo raw shrimp (shelled and deveined (weight after peeled))', '2 cloves garlic (crushed)', 'kosher salt and pepper', '3 tbsp Kansas City Style BBQ Sauce', '8 long wooden skewers']",
    "recipe_name": "BBQ Shrimp Skewers"
  },
  {
    "cooking_method": "['Heat a skillet or grill over high heat. When hot, spray with oil and add the patties.', 'Season with salt and pepper and cook a few minutes on each side, to your desired liking.', 'Add the cheese and cover; cook to melt, about 30 seconds.', 'Place the cooked burgers on the buns and top each burger with 2 tablespoons salsa verde, red cabbage and avocado slices.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/01/Best-Salsa-Verde-Burgers.jpg",
    "ingredients": "['cooking spray', 'pinch kosher salt and pepper (to taste)', '4 93% lean beef patties, 4.75 oz each', '1/2 cup salsa verde (homemade or store bought)', '4 slices Sargento reduced fat pepper jack cheese', '4 100 calorie whole wheat potato buns', '1/4 cup shredded red cabbage (ore lettuce)', '4 ounces sliced avocado (from 1 medium haas)']",
    "recipe_name": "Salsa Verde Burgers"
  },
  {
    "cooking_method": "['Place chicken, 1 onion, tomato, carrot, and 2 cloves of garlic into the slow cooker. Add just enough water to cover, add bay leaves and salt and cook high for 4 hours until the chicken is tender. When done, remove chicken and shred with two forks; set aside. Reserve the broth.', 'In a large deep skillet, heat the olive oil over medium heat. Add the remaining garlic, onions, green peppers, and red peppers. Cook about 3 to 4 minutes, or until soft. Stir in the cooked chicken, tomato sauce, white wine, and about 3/4 cup of the reserved broth to create a sauce. Season with cumin, garlic powder, salt, and pepper. Cover and simmer on low for about 8 to 10 minutes, adding more broth and seasoning if needed. Makes 4 cups.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/06/Chicken-Ropa-Vieja.jpg",
    "ingredients": "['3 22.5 oz skinless boneless chicken breasts', '1 small onion (quartered)', '1 to mato (quartered)', '1 carrot (peeled and chopped)', '2 cloves garlic (peeled)', '2 bay leaves', 'kosher salt', '1 tbsp olive oil', '2 cloves garlic', '1 small onion (sliced long)', '1 small green bell pepper (seeded and thinly sliced)', '1 small red bell pepper (seeded and thinly sliced)', '1/4 cup dry white wine (or chicken broth)', '1/2 cup tomato sauce', '1 tsp cumin', '1/4 tsp garlic powder', '1/2 tsp kosher salt (plus more to taste)', 'black pepper to taste']",
    "recipe_name": "Chicken Ropa Vieja"
  },
  {
    "cooking_method": "['Preheat oven to 400F. Spray a baking sheet with cooking spray.', 'Grate the zucchini into a clean dish towel until you have 1 packed cup. Wring all of the excess water out of the zucchini, there will be a lot of water. In a medium bowl, combine all of the ingredients and season with salt and pepper to taste.', 'Spoon 1 tablespoon of mixture in your hands and roll into small ovals. Place on the cookie sheet and bake for 16 to 18 minutes, turning halfway though cooking until golden. Makes 16.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/06/Skinnytaste-Zucchini-Tots.jpg",
    "ingredients": "['cooking spray', '1 packed cup grated zucchini', '1 large egg', '1/4 medium onion (minced)', '1/4 cup grated reduced fat sharp cheddar cheese', '1/3 cup seasoned breadcrumbs (or gluten-free crumbs)', '1/4 tsp kosher salt and black pepper to taste']",
    "recipe_name": "Zucchini Tots"
  },
  {
    "cooking_method": "['In a large deep non-stick skillet, brown the ground turkey over high heat until cooked through, seasoning with a pinch of salt and breaking it up into smaller pieces as it cooks.', 'Set aside on a dish.', 'Add olive oil to the skillet, reduce heat to medium and add the onion, red pepper, celery and carrots; saute until the vegetables soft, about 6 to 7 minutes.', 'Return the turkey to the skillet along with the remaining ingredients except for the pasta and cheese.', 'Bring to a boil and then lower heat to medium-low and simmer for 20 minutes.', 'While simmering, heat oven to 350F.', 'Spoon just enough of the turkey/vegetable mixture to cover the bottom of a 9x13 pan.', 'Cover with uncooked pasta.', 'Spoon remaining sauce mixture evenly over the top and sprinkle with cheese.', 'Cover with foil and bake 50-55 minutes.', 'Remove from oven and let stand, covered, for 15 minutes.', 'Divide into 8 servings.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/01/Grandmas-Macaroni-Casserole.jpg",
    "ingredients": "['1 lb 93% lean ground turkey', '1 tbsp olive oil', '1 cup chopped onion', '1 medium red pepper (chopped)', '1/4 cup finely diced celery', '1/4 cup finely diced carrots', '1 cup sliced mushrooms', '1 14.5 oz can petite diced tomatoes, drained', '2 cups marinara sauce (I used my own homemade)', '2 cups water', '1/2 tsp Italian seasoning', '1 tsp Kosher salt', '8 oz shredded mozzarella cheese', '8 oz uncooked DeLallo whole wheat elbows']",
    "recipe_name": "Easy Macaroni Casserole"
  },
  {
    "cooking_method": "['Place all the ingredients into the blender and blend until smooth.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/01/Blueberry-Kale-Smoothie.jpg",
    "ingredients": "['3/4 cup organic frozen blueberries', '1 loose cup baby kale', '1 tbsp peanut butter (or any nut butter)', '3/4 cup Almond Breeze Unsweetened Vanilla Almond Milk', '1/2 frozen ripe banana', '2 pitted dates', '1/2 cup ice', ';']",
    "recipe_name": "Blueberry Kale Smoothie"
  },
  {
    "cooking_method": "['Rinse and drain the black eyed peas in a colander.', 'In a large bowl, combine the garlic, lime juice, oil, cumin, crushed red pepper, and salt and mix well.', 'Add the black-eyed peas, corn, tomato, red onion, jalapeno if using and cilantro; mix well and refrigerate at least 20 minutes.', 'When ready to eat, gently mix in the avocado and serve right away.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/12/blackeyed-pea-dip-copy.jpg",
    "ingredients": "['15 oz canned no salt black eye peas (Eden)', '2 cloves garlic (crushed or minced)', '3 tbsp fresh lime juice (from about 1 1/2 limes)', '1 tbsp extra virgin olive', '1 tsp cumin', 'pinch crushed red pepper flakes', '1/2 tsp kosher salt', '1 cup cooked corn (fresh or frozen, thawed)', '1 cup cherry tomatoes (quartered)', '1/4 cup minced red onion (finely diced)', '1/4 cup cilantro (chopped)', '1 jalapeno (seeded and diced (optional))', '1 medium avocado (diced)']",
    "recipe_name": "Black-eyed Pea Dip"
  },
  {
    "cooking_method": "['Heat oven to 300F. Cover cookie sheet with silpat or nonstick silicone pad.', 'Using a mixer, beat the egg whites and cream of tartar together in large bowl at high speed until soft peaks form. Gradually add sugar a little at a time, then vanilla, beating well after each addition until you get stiff peaks, the sugar is dissolved and the mixture is glossy.', 'Sift cocoa onto egg white mixture; gently fold until combined.', 'Fold in chocolate chips. Drop mixture by heaping tablespoons onto cookie sheet. Makes 30 to 32 cookies.', 'Bake 34 to 40 minutes or just until dry. Cool slightly; remove from cookie sheet. Cool completely on wire rack. Store covered, at room temperature.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/12/chocolate-chip-clouds.jpg",
    "ingredients": "['1/2 cup egg whites (room temperature)', '1/8 tsp cream of tartar', '1/2 cup sugar', '1 tsp vanilla extract', '2 tbsp unsweetened cocoa powder', '1 cup chocolate chips']",
    "recipe_name": "Chocolate Chip Clouds"
  },
  {
    "cooking_method": "['In a small saucepan combine the cranberries water and sugar and bring to a boil. Simmer over medium heat until the cranberries burst, about 4 minutes.', 'Preheat oven to 350F. Lightly spray a loaf pan with baking spray.', 'In a medium bowl, combine flour, baking soda and salt with a wire whisk. Set aside.', 'In a large bowl cream butter and brown sugar with an electric mixer. Add egg whites, bananas, and vanilla, and beat at medium speed until thick. Scrape down sides of the bowl.', 'Add flour mixture and blend at low speed until combined, do not over mix.', 'Fold in cranberries and pour batter into the prepared loaf pan; sprinkle with turbinado sugar on top and bake in the center rack for about 60 minutes, or until a toothpick inserted in the center comes out clean.', 'Transfer the pan to a wire rack and let the pan cool at least 25 minutes, bread should be room temperature before slicing.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/12/Banana-Cranberry-Bread.jpg",
    "ingredients": "['1 cup fresh or frozen cranberries', '2 tbsp sugar', '2 tbsp water', 'baking spray', '1 1/4 cups white whole wheat flour', '3/4 tsp baking soda', '1/4 tsp salt', '2 tbsp butter (softened)', '1/2 cup light brown sugar (not packed)', '2 large egg whites', '3 ripe medium bananas (lightly mashed)', '1 1/2 tsp vanilla extract', '1/2 tbsp turbinado sugar']",
    "recipe_name": "Banana Cranberry Bread"
  },
  {
    "cooking_method": "['Trim about 1 1/2 inches off broccolini stems and discard. Slice the broccolini in half lengthwise.', 'Bring pot of water to a boil. When boiling, add broccolini and cook 2 minutes. Quickly drain and run under cold water to stop it from cooking.', 'Heat a large saute pan over medium-high heat. Add the oil and garlic and cook until golden, about 1 minute. Add the drained broccolini, season with kosher salt to taste and red pepper flakes (optional), and cook 1 minute, or until heated through.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/12/Garlic-Broccolini.jpg",
    "ingredients": "['2 bunches broccolini', '6 cloves peeled garlic (sliced thin)', '1 1/2 tbsp extra virgin olive oil', 'kosher salt', 'pinch red pepper flakes (optional)']",
    "recipe_name": "Easy Garlic Broccolini"
  },
  {
    "cooking_method": "['Season salmon with salt.', 'Heat a large saute pan over medium-high heat; when hot lightly spray with oil and add the salmon.', 'Cook until browned on one side, about 4 to 5 minutes then turn and cook an additional 4 to 5 minutes or until salmon easily flakes.', 'Set aside on a dish to cool.', 'Add the olive oil to the pan, then add the the onion, celery, red and yellow bell peppers, parsley, capers, hot sauce, Old Bay seasoning, 1/2 teaspoon kosher salt, and 1/2 teaspoon pepper in a large saute pan over medium-low heat and cook until the vegetables are soft, approximately 18 to 20 minutes.', 'Set aside to cool to room temperature.', 'Flake the salmon into a large bowl.', 'Add the bread crumbs, mayonnaise, yogurt, mustard, and eggs.', 'Add the vegetable mixture and mix well.', 'Cover and chill in the refrigerator for 30 minutes, this will make them easier to shape and become less sticky.', 'Preheat oven to 400F.', 'Spray a non-stick baking sheet with cooking spray.', 'Shape the batter into 15 (scant 1/4 cup each) cakes and place on prepared baking sheet.', 'Bake about 10 to 12 minutes on each side, or until golden brown.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/12/Baked-Salmon-Cakes-with-Avocado-Dip-550x825-1.jpg",
    "ingredients": "['1/2 pound wild Alaskan salmon filet (fresh or frozen (if frozen thaw overnight in the refrigerator))', 'olive oil cooking spray', '1 tbsp olive oil', 'Kosher salt and freshly ground black pepper', '3/4 cup small-diced red onion (1 small onion)', '1 1/2 cups small-diced celery (4 stalks)', '1/2 cup small-diced red bell pepper (from 1 small pepper)', '1/2 cup small-diced yellow bell pepper (from 1 small pepper)', '1/4 cup minced fresh flat-leaf parsley', '1 tablespoon capers (drained)', '1/4 tablespoon hot sauce', '1 1/2 tsp Old Bay seasoning', '1 cup seasoned breadcrumbs (or gluten-free crumbs)', '3 tablespoon light mayonnaise', '3 tablespoon Greek yogurt (0 %)', '1 tablespoon Dijon mustard', '1 large egg (lightly beaten)', '3 large egg whites (lightly beaten)', 'Zesty avocado cilantro dressing']",
    "recipe_name": "Baked Salmon Cakes"
  },
  {
    "cooking_method": "['In a medium bowl, combine the sea bass, tomato, onion, chopped cilantro, jalapeno, bell', 'pepper, oil, and Tabasco.', 'Add the lime juice and toss to coat the fish.', 'Season with salt and pepper.', 'Cover and marinate in the refrigerator at least 1 hour depending on the size of the fish cubes, stirring occasionally.', 'Look at the fish and you can see the flesh changing over time in the marinade, you are looking for a solid appearance in the flesh vs. an opaqueness all the way through the center of the fish.', 'Trim the cucumber slices with a round cutter to remove the rind.', 'With a melon baller scoop out a shallow pocket in the middle of the cucumber slicesdo not cut all the way through the slice.', 'Just before serving, fill the cucumber cups with the ceviche.', 'Garnish each ceviche cup with a small dot of sour cream and a cilantro leaf, if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/12/Ceviche-in-Cucumber-Cups.jpg",
    "ingredients": "['8 oz fresh raw fish fillet such as striped bass (finely diced)', '1 medium seeded tomato (finely diced)', '1 tbsp chopped cilantro', '1 tbsp minced red onion', '1/2 jalapeno (minced)', '1/4 yellow bell pepper (finely diced)', '1/2 tbsp olive oil', '3 drops tabasco sauce', '3 tbsp fresh lime ((1 or 2 limes))', 'Kosher salt and freshly ground black pepper (as needed)', '2 large cucumbers (thirty 1/2-inch-thick slices)', 'fresh cilantro for garnish']",
    "recipe_name": "Ceviche Cucumber Cups"
  },
  {
    "cooking_method": "['To cook the cauliflower florets, steam a little over 2 cups raw cauliflower florets in a little water covered for for 4 to 5 minutes or until tender but not mushy, then drain well and dry on paper towel. Using a knife, finely chop and set 2 cups aside.', 'Preheat oven to 400F. Spray a nonstick cookie sheet with cooking spray.', 'In a medium bowl, combine all of the ingredients and season with salt and pepper to taste.', 'Spoon 1 tablespoon of mixture in your hands and roll into small ovals. Place on the cookie sheet and bake for 16-18 minutes, turning halfway through cooking until golden.', 'Makes about 32 - 34 tots.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/11/vegetarian-cauliflower-tots.jpg",
    "ingredients": "['2 cups cooked cauliflower florets (finely chopped)', '1 large egg', '1 large egg white', '1/2 cup onion (minced)', '3 tbsp minced fresh parsley', '1/2 cup reduced fat sharp cheddar cheese (grated)', '1/2 cup seasoned breadcrumbs (can substitute with gluten-free bread crumbs)', 'salt and pepper to taste', 'cooking spray']",
    "recipe_name": "Cauliflower Tots"
  },
  {
    "cooking_method": "['Combine the avocado, milk and sugar in the blender and mix until smooth.', 'Add the coconut flakes and mix to incorporate.', 'Pour into the popsicle mold and freeze.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/06/Paletas-De-Aguacate-Y-Coco.jpg",
    "ingredients": "['4 oz haas avocado (from 1 medium)', '2 1/3 cups unsweetened Almond Breeze Almond Coconut milk', '6 tbsp raw sugar (or your favorite sweetener)', \"1/2 cup sweetened shredded coconut flakes (Baker's)\"]",
    "recipe_name": "Avocado Coconut Popsicles"
  },
  {
    "cooking_method": "['Heat the oven to 375.', 'Spray a large rimmed baking sheet with cooking spray.', 'Place 1/2 tablespoon olive oil in a large nonstick skillet over medium high heat.', 'When hot add the eggplant and 1/4 cup water.', 'Season with salt and pepper and cook, stirring occasionally until tender, 10 to 15 minutes.', 'Transfer to the bowl of a food processor.', 'Add the remaining 1/2 tablespoon of oil to the skillet with the onion and garlic and cook until translucent, 3 to 5 minutes.', 'Add to the food processor along with the drained beans and parsley and pulse until well combined and chopped, but not pureed.', 'Combine the mixture with the breadcrumbs and red chile flakes if using.', 'Taste for salt then roll into 12 meatballs, about 2-inches in diameter.', 'Transfer to the prepared baking sheet and bake until firm and browned, about 25 to 30 minutes.', 'Meanwhile, warm the marinara sauce and serve with the meatballs over pasta, zucchini noodles or on a whole wheat roll.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/05/Vegan-Egplant-Meatballs.jpg",
    "ingredients": "['cooking spray', '1 tbsp olive oil', '1 lb unpeeled eggplant (cut into 1-inch pieces)', '1 tsp kosher salt', '1/2 tsp black pepper', '1 medium onion (chopped)', '1 tbsp minced garlic', '1 cup cooked white beans (or drained, rinsed canned)', '1/4 cup chopped fresh parsley', '1 cup whole wheat breadcrumbs or panko (use gf crumbs for gluten free)', 'pinch red chili flakes (optional)', '2 cups quick marinara sauce']",
    "recipe_name": "Vegan Eggplant Meatballs"
  },
  {
    "cooking_method": "['Combine the ingredients for the quick pico de gallo in a small bowl.', 'Heat a nonstick skillet over medium heat. Spray the skillet with oil and add a tortilla.', 'Brown about 2 minutes on each side, then spread 1/4 cup picadillo on half of the tortilla.', 'Top with cheese and half of the pico de gallo, then fold and press down with a spatula. Cook 1 to 2 minutes on each side, until the cheese is melted and the tortilla is crisp.', 'Remove from heat and cut in 3 pieces. Repeat with the remaining. Eat hot!']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/05/picadillo-quesadilla.jpg",
    "ingredients": "['1 tbsp chopped cilantro', '1 tbsp chopped tomato', '1 tbsp chopped scallion', 'juice from 1/2 lime', 'cooking spray', '2 reduced-carb whole wheat flour tortillas', '6 tbsp shredded reduced fat cheddar jack', '1/2 cup Crock Pot Picadillo (drained)']",
    "recipe_name": "Picadillo Quesadillas"
  },
  {
    "cooking_method": "['Preheat oven to 350F. Lightly spray a 9 x 13 x 1.375 inch non-stick baking pan (quarter sheet pan) with cooking spray.', 'In a large bowl, combine the flour, baking soda, salt and cinnamon and stir to blend.', 'In another bowl, whisk the sugars with the butter, egg whites, applesauce and vanilla until light and fluffy.', 'Fold the dry ingredients into the wet ingredients with a spatula in two additions until the batter is very well blended. If the batter looks more crumbly than smooth, add just a drop of water at a time (ONLY if needed) until it smooths out.', 'Fold in the white chocolate chips.', 'Spread the batter onto the baking pan using the back of a measuring cup to smooth evenly.', \"Bake 14 to 16 minutes, until the edges are golden and a toothpick inserted comes out clean. Don't over-bake or your bars will be dry. Let it cool completely on wire rack.\", 'Meanwhile, prepare the frosting; in a large bowl, use an electric mixer to beat the cream cheese, powdered sugar and vanilla until well-blended.', 'Cut the bars into 15 large squares (5 cuts by 3 cuts with the knife). Then cut each square in half diagonally to create triangles. Spread the frosting in a thin, even layer over the surface of the cookie, leaving a small margin around the edges. Layer the fresh fruit over the frosting.', 'Store in the refrigerator until ready to serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/05/skinny-fruit-pizza.jpg",
    "ingredients": "['2 cups all purpose unbleached flour (Gold Medal)', '1/2 tsp baking soda', '1/4 tsp salt', '1/8 teaspoon ground cinnamon', '2/3 cup granulated sugar', '2/3 cup brown sugar (unpacked)', '1/4 cup melted unsalted butter', '2 large egg whites', '1/4 cup unsweetened apple sauce', '2 tsp vanilla extract', '2/3 cup white chocolate chips or chopped white chocolate', '8 oz 1/3 less fat cream cheese (softened)', '1/2 cup powdered sugar', '1 teaspoon vanilla', '1 large mango (diced)', '3 diced kiwis', '1 cup sliced strawberries', '1 cup blueberries', '1 cup raspberries']",
    "recipe_name": "Fruit Pizza"
  },
  {
    "cooking_method": "['In a medium bowl, combine the red onion, pinch of kosher salt, juice of 1 lime and olive oil.', 'Mix in the chopped cilantro, jalapeno, drained tuna, tomato, and Tabasco, if using.', 'Taste for salt and lime juice, adjust as needed (I used 1 1/2 limes).', 'Cover and marinate in the refrigerator at least 20 minutes to let the flavors blend.', 'To serve, top with fresh sliced avocado and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/04/canned-tuna-fish-ceviche.jpg",
    "ingredients": "['2 tbsp minced red onion', '1 to 1 1/2 limes', 'kosher salt and freshly ground black pepper (as needed)', '1 tsp olive oil', '1 7 oz can chunk white albacore tuna packed in water (5.1 oz drained)', '1 medium seeded plum tomato (finely diced)', '2 tbsp chopped cilantro', '1 jalapeno (minced (keep seeds for spicy) or you can use pickled)', '3 drops Tabasco sauce (optional)', '2 oz sliced avocado (1/2 medium haas)']",
    "recipe_name": "Canned Tuna Ceviche"
  },
  {
    "cooking_method": "['Preheat the oven to 375F.', 'Cut the pita rounds into quarters and pull them apart so you have 8 triangles from each pita.', 'Spread over a baking sheet and bake until toasted, about 8 to 10 minutes.', 'While toasting, combine the cucumbers, tomatoes and feta in a medium bowl.', 'Put the toasted pitas on two plates and drop some hummus onto the chips.', 'Spoon the tomato mixture on top and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2014/04/greek-nachos.jpg",
    "ingredients": "['2 small 100% whole wheat pita rounds (about 70 - 80 calories each)', '1/2 tomato (or 1/2 cup quartered grape tomatoes)', '1/2 cucumber diced (about 3/4 cup)', '1/4 cup crumbled feta cheese', '2 tbsp hummus (prepared or homemade)']",
    "recipe_name": "Greek Nachos"
  },
  {
    "cooking_method": "['If cooking outside on the grill, soak skewers at least 30 minutes.', 'Place the pulp from the avocados in a medium bowl and slightly mash with a fork or a potato masher leaving some large chunks. Add tomato, lime juice, salt, pepper, cilantro, red onion, garlic and mix thoroughly.', 'Season shrimp with salt, then mix in crushed garlic and 2 tbsp salsa verde. Thread the shrimp onto 4 skewers.', 'Light the grill or indoor grill pan on medium flame, when hot spray the grates with oil and grill the shrimp about 1 to 2 minutes on each side. Set aside.', 'Place a tostada on each plate, top each with 1/4 cup refried beans spread evenly, 1/4 cup lettuce and guacamole.', 'Top each with a shrimp skewer on top and serve with extra salsa verde and cheese if using.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/09/skinny-grilled-shrimp-tostadas.jpg",
    "ingredients": "['1 medium hass avocados (halved)', '1/2 plum tomato (seeded and diced)', '1/2 lime (juiced)', '2 tbsp red onion (minced)', '1 small clove garlic (mashed)', '1/2 tbsp chopped cilantro', 'kosher salt and fresh pepper (to taste)', '16 jumbo shrimp (3/4 lb, shelled and deveined)', '1 garlic crushed', '2 tbsp prepared salsa verde (or homemade salsa verde)', '4 tostada shells', '1 cup shredded romaine lettuce', \"1 cup canned fat free refried beans (love Trader Joe's)\", 'extra salsa verde (for topping)', '2 tbsp crumbled queso blacno (optional)']",
    "recipe_name": "Grilled Shrimp Tostadas"
  },
  {
    "cooking_method": "['In the blender combine the watermelon and water and puree until smooth.', 'Pour into a pitcher and garnish with sliced limes and a spring of mint.', 'To serve, place the ice in each glass and pour the watermelon agua fresca.', 'Garnish each glass with a lime wedge and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/08/agua-de-sandia-28watermelon-water29.jpg",
    "ingredients": "['6 cups seedless watermelon cubes', '3/4 cup water', '4 thin lime slices (for garnish)', 'a few sprigs mint (for garnish)', 'ice']",
    "recipe_name": "Watermelon Agua Fresca"
  },
  {
    "cooking_method": "['For the enchilada sauce:', 'In a medium saucepan, spray oil and saute garlic.', 'Add chipotle chili, chili powder, cumin, broth, tomato sauce, salt and pepper. Bring to a boil.', 'Reduce the heat to low and simmer for 5-10 minutes. Set aside until ready to use.', 'For the enchiladas:', 'Spray a baking dish with nonstick spray. Preheat oven to 400 degrees.', 'In a medium nonstick skillet, saute garlic and scallions in olive oil over medium heat for about 3 minutes; add zucchini and cilantro, salt and pepper to taste and cook until all the liquid evaporates from the zucchini, about 4-5 minutes.', 'Remove from heat and add 1/2 cup cheese; mix well.', 'Divide zucchini between in each tortilla, roll and place seam side down in baking dish.', 'Top with enchilada sauce (you might not use all) and remaining cheese and bake until hot and the cheese is melted, about 20 minutes.', 'Serve with chopped cilantro, scallions, and reduced fat sour cream if you wish. Enjoy!!']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/08/zucchini-enchiladas.jpg",
    "ingredients": "['cooking spray', '1 tsp olive oil', '2 cloves garlic (crushed)', '2 medium scallions (chopped)', '1/4 cup cilantro (chopped)', '2 medium zucchinis (grated)', 'kosher salt and fresh ground pepper', '1 1/2 cups grated reduced fat mexican blend cheese (Sargento)', '4 8-inch flour tortillas', 'chopped scallions (optional)', 'chopped cilantro (optional)', '1 garlic cloves (minced)', '1 tbsp canned chipotle in adobo sauce (chopped, optional for more heat)', '1 cups tomato sauce', '1/4 tsp chipotle chili powder (to taste)', '1/4 tsp ground cumin', '1/2 cup fat free vegetable broth', 'kosher salt and fresh pepper to taste']",
    "recipe_name": "Cheesy Zucchini Enchiladas"
  },
  {
    "cooking_method": "['Cut zucchini about 1/4 inch thick.', 'Spray both side lightly with oil and season with salt and pepper.', 'Broil or grill the zucchini for about 2 minute on each side.', 'Top with sauce and cheese and broil for an additional minute or two. (Careful not to burn cheese)']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/08/guiltless-zucchini-pizza-bites.jpg",
    "ingredients": "['4 slices large zucchini 1/4\" thick (or 1 medium zucchini cut on diagnal)', 'olive oil spray (I used my Misto)', 'salt and pepper', '2 tbsp quick marinara sauce', '1/4 cup shredded part skim mozzarella']",
    "recipe_name": "Zucchini Pizza Bites"
  },
  {
    "cooking_method": "['In a large bowl, combine the garlic, lime juice, oil, cumin, crushed red pepper, and salt.', 'Add the black beans, chickpeas, tomato, onion and cilantro; mix well.', 'When ready to eat, gently mix in avocado and serve right away.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/04/Two-Bean-Fiesta-Salad.jpg",
    "ingredients": "['2 cloves garlic (minced)', '3 tbsp fresh lime juice', '1 tbsp extra virgin olive', '1 tsp cumin', 'pinch crushed red pepper flakes', '1/2 teaspoon salt', '15 oz can black beans (rinsed and drained)', '1 cup canned chickpeas (rinsed and drained)', '1 cup cherry tomatoes (halved)', '1/4 cup minced red onion (finely diced)', '1/4 cup cilantro (chopped)', '1 medium avocado (diced)']",
    "recipe_name": "Fiesta Bean Salad"
  },
  {
    "cooking_method": "['Preheat the oven to 400F.', 'Bring a large pot of water to a boil.', 'Hollow out the flesh of the eggplant to create a boat using a melon baller or small knife, leaving a 1/2-inch of the skin all around to create a shell. Roughly chop the scooped out eggplant flesh.', 'Drop the eggplant into the boiling water and cook 3 minutes (poking it with a spoon so they stay submerged). Remove with a slotted spoon and set them on paper towels on the counter.', 'Meanwhile, brown the sausage in a large skillet over medium-high heat, breaking the meat up while it cooks into smaller pieces. Add the onions and garlic and cook on a medium-low heat for about 2-3 minutes, until onions are translucent. Add 1 cup chopped eggplant and cook about 2-3 minutes. Add 1 cup crushed tomatoes, season with salt and pepper and cook 2 to 3 minutes. Remove from heat and stir in fresh basil.', 'Pour 1/3 cup of crushed tomatoes on the bottom of a 9 x 12 baking dish and place the eggplant boats on top. Season the eggplant with salt and divide the sausage and sauce evenly among the 4 eggplant boats.', 'Top each with 2 tablespoons of shredded mozzarella cheese and 1 teaspoon each of Pecorino Romano cheese. Cover with foil and bake 30 minutes until cheese is melted and eggplant is cooked through.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/08/Baked-Eggplant-Parmesan-Boats-with-Sausage.jpg",
    "ingredients": "['2 medium (15 oz each white eggplants, stems trimmed off and halved lengthwise)', '3 links (8.4 oz sweet Italian chicken sausage, casings removed (I love Premio))', '1/2 small onion (finely diced)', '2 cloves garlic (crushed)', '1 1/3 cups crushed tomatoes', '5 basil leaves (chopped (plus more for garnish))', 'salt and pepper (to taste)', '1/2 cup shredded part skim mozzarella cheese', '4 teaspoons grated Pecorino Romano']",
    "recipe_name": "Stuffed Eggplant Parmesan"
  },
  {
    "cooking_method": "['In a large saucepan, heat broth over medium-high heat.', 'When it boils, reduce heat to a simmer and maintain over low heat, taste for salt and adjust as needed.', 'In a large heavy saucepan over medium heat, heat the oil and add the shallots; saute 3-4 minutes.', 'Add the rice; mix well so the rice is coated throughout and saute until the rice is slightly translucent, about 2-3 minutes.', 'Add the wine and stir until it is absorbed.', 'Add a ladleful of the simmering stock; stir and wait until it is absorbed before adding another ladleful stirring gently and almost constantly.', 'Continue this process until the rice is creamy, tender to the bite, but slightly firm in the center.', 'Add the asparagus along with the last ladle of broth and continue cooking 5 minutes, total time should be about 25-30 minutes from the time you started.', 'When all the liquid is absorbed, remove from heat and stir in the lemon juice, parsley and Parmigiano-Reggiano.', 'Serve immediately and top with fresh cracked pepper, lemon zest, and extra grated cheese if desired.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/03/asparagus-risotto.jpg",
    "ingredients": "['4 1/2 cups low-sodium chicken or vegetable broth', '2 tsp olive oil', '1/3 cup shallots (chopped)', '1 cup arborio rice', '2 oz dry white wine', '3/4 lb thin asparagus spears (tough ends trimmed, cut 2-inches long)', '1-2 tsp fresh lemon juice', '1/4 cup chopped fresh parsley', '1/4 cup freshly grated Parmigiano-Reggiano (plus more for serving)', 'salt and fresh cracked pepper (to taste)', '1 tsp grated lemon zest for garnish']",
    "recipe_name": "Spring Asparagus Risotto"
  },
  {
    "cooking_method": "['Place the lettuce on a large dish and top with meats, vegetables and cheese.', 'In a small bowl add vinegar or brine from pepperoncini, add black pepper and whisk in oil.', 'Drizzle over salad and enjoy!']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/04/Italian-Antipasto-Salad.jpg",
    "ingredients": "['1 cup romaine lettuce (chopped)', '1/4 cup chopped cherry tomatoes', '1 thin slice red onion', '4 green pitted olives (or black)', '1 pepperoncini (sliced)', '1/4 cup roasted red pepper (sliced (homemade, or buy packed in water))', '1/4 cup Giardiniera (I used Victoria brand)', '1/3 cup cucumbers (peeled and sliced)', '1/4 cup Polly-o part skim shredded mozzarella', '1/2 oz 4 turkey pepperoni, sliced thin', '2 slices Prosciutto (Di Parma, sliced)', '1 tsp olive oil', '1 tsp red wine vinegar or vinegar brine from pepperoncini', 'fresh black pepper']",
    "recipe_name": "Antipasto Salad"
  },
  {
    "cooking_method": "['Peel the cooled hard boiled eggs.', 'Cut the eggs in half horizontally, and set the yolks aside.', 'In a bowl, mash the avocado and 2 whole egg yolks; discard the rest.', 'Mix in lime juice, red onion, jalapeno, cilantro, salt and pepper and adjust to taste. Gently fold in tomato.', 'Scoop heaping spoonfuls of the guacamole into the 12 halved eggs.', 'Sprinkle with a little chile powder for color and arrange on a platter.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/03/green-deviled-eggs.jpg",
    "ingredients": "['6 large eggs (hard boiled (recipe here))', '1 medium haas avocado (about 5 oz)', '2-3 tsp fresh lime juice', '1 tsp red onion (minced)', '1 tbsp minced jalapeno', '1 tbsp fresh cilantro (chopped)', 'kosher salt and fresh ground pepper (to taste)', '1 tbsp diced tomato', 'pinch chile powder (for garnish)']",
    "recipe_name": "Guacamole Deviled Eggs"
  },
  {
    "cooking_method": "['Preheat the oven to 350 degrees. Spray a 9 x 13 inch baking dish with cooking spray.', 'In a large pot of boiling salted water, cook the pasta according to the package directions for al dente and drain well.', 'Meanwhile, in a large skillet, heat the oil over medium-low heat. Add the onions and cook until soft, about 5 minutes. Stir in the garlic and cook for 30 seconds.', 'Stir in the beef and cook until browned; season with salt and pepper.', 'Stir in the tomato paste, then add the tomatoes and mustard. Let the mixture bubble gently until it is slightly thickened, about 2 minutes.', 'Toss the meat mixture with the pasta and spread it into the prepared dish.', 'Top with the cheddar and bake until the cheese is melted, about 15 minutes. Sprinkle the chopped pickles over the top and serve.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/03/cheeseburger-casserole.jpg",
    "ingredients": "['2 cups 6 oz uncooked rotini pasta (use brown rice pasta for GF)', '2 tsp olive oil', '1 1/2 cups onions (finely chopped)', '1 garlic clove (finely chopped)', '1 lb lean ground beef (95% lean)', '3/4 tsp salt', '1/2 tsp black pepper', '2 tbsp tomato paste', '28 oz diced tomatoes', '2 tbsp Dijon Mustard', '2 cups reduced-fat grated cheddar cheese', '1/4 cup chopped dill pickles']",
    "recipe_name": "Cheeseburger Casserole"
  },
  {
    "cooking_method": "['Preheat over to 300F.', 'Spray a cookie sheet with cooking spray.', 'Remove the crust and cut the bread into small cubes.', 'Combine the garlic powder, salt and Italian seasoning in a medium bowl.', 'Spread the bread cubes on prepared cookie sheet in a single layer.', 'Spray the top with more oil to coat and top with half of the seasoning and half of the shredded cheese; season with black pepper then bake for 14 minutes or until dry, crispy, and golden brown.', 'Turn the croutons over, spray a little more oil and sprinkle with remaining seasoning, black pepper and shredded cheese; bake for an additional 14 minutes until done.', 'Store croutons in air-tight container or ziplock bag.', 'Makes 4 cups.', 'Enjoy!']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/03/Whole-Grain-Croutons.jpg",
    "ingredients": "['olive oil spray (I used my mister)', '6 slices 100% whole grain bread (I used Pepperidge Farm 15 grain*)', '1 tsp garlic powder', 'sea salt (to taste)', '3-4 tsp dried Italian seasoning (or dried parsley)', '1/4 cup shredded Parmesan cheese', 'fresh black pepper (to taste)']",
    "recipe_name": "Homemade Croutons"
  },
  {
    "cooking_method": "['Pour the milk, frozen yogurt, avocado, sugar, mint extract and ice into your blender.', 'Blend 3-4 minutes until the mixture is thick and icy.', 'Pour into two glasses, and serve with a straw. Serve immediately.']",
    "image": "https://www.skinnytaste.com/wp-content/uploads/2013/03/skinny-shamrock-shake.jpg",
    "ingredients": "['3/4 cup fat free milk', '3/4 cup Stonyfield Organic 0% fat vanilla frozen yogurt', '1/3 cup sliced avocado', 'a few drops Nu Naturals Stevia or 1 tbsp raw sugar', '1/4 tsp mint extract (not Peppermint)', '1 cup crushed ice']",
    "recipe_name": "Skinny(er) Shamrock Shake"
  }
]